marcel-galliker/Mouvent-PrintEngine/rx_balance_ctrl/common/mb9b160l.h
#elif (PDL_MCU_INT_TYPE == PDL_INT_TYPE_C)
#else
    #error Interrupt Type not found!        
#endif // PDL_INT_TYPE

#include "core_cm4.h"
#include "system_mb9bf16xl.h"
#include <stdint.h>

#define SUCCESS  0
#define ERROR    -1

#ifndef NULL
#define NULL 0
#endif


/******************************************************************************/
/*                Device Specific Peripheral Registers structures             */
/******************************************************************************/

#if defined ( __CC_ARM   )
#pragma anon_unions
#endif

/******************************************************************************
 * INTREQ_MODULE Bit fields and registers depending on device type
 ******************************************************************************/
#if (PDL_MCU_INT_TYPE == PDL_INT_TYPE_A)

/* Interrupt request read registers */
typedef struct
{
    __IO uint32_t DRQSEL;
    uint8_t RESERVED0[12];
    __IO uint32_t EXC02MON;
    __IO uint32_t IRQ000MON;
    __IO uint32_t IRQ001MON;
    __IO uint32_t IRQ002MON;
    __IO uint32_t IRQ003MON;
    __IO uint32_t IRQ004MON;
    __IO uint32_t IRQ005MON;
    __IO uint32_t IRQ006MON;
    __IO uint32_t IRQ007MON;
    __IO uint32_t IRQ008MON;
    __IO uint32_t IRQ009MON;
    __IO uint32_t IRQ010MON;
    __IO uint32_t IRQ011MON;
    __IO uint32_t IRQ012MON;
    __IO uint32_t IRQ013MON;
    __IO uint32_t IRQ014MON;
    __IO uint32_t IRQ015MON;
    __IO uint32_t IRQ016MON;
    __IO uint32_t IRQ017MON;
    __IO uint32_t IRQ018MON;
    __IO uint32_t IRQ019MON;
    __IO uint32_t IRQ020MON;
    __IO uint32_t IRQ021MON;
    __IO uint32_t IRQ022MON;
    __IO uint32_t IRQ023MON;
    __IO uint32_t IRQ024MON;
    __IO uint32_t IRQ025MON;
    __IO uint32_t IRQ026MON;
    __IO uint32_t IRQ027MON;
    __IO uint32_t IRQ028MON;
    __IO uint32_t IRQ029MON;
    __IO uint32_t IRQ030MON;
    __IO uint32_t IRQ031MON;
    __IO uint32_t IRQ032MON;
    __IO uint32_t IRQ033MON;
    __IO uint32_t IRQ034MON;
    __IO uint32_t IRQ035MON;
    __IO uint32_t IRQ036MON;
    __IO uint32_t IRQ037MON;
    __IO uint32_t IRQ038MON;
    __IO uint32_t IRQ039MON;
    __IO uint32_t IRQ040MON;
    __IO uint32_t IRQ041MON;
    __IO uint32_t IRQ042MON;
    __IO uint32_t IRQ043MON;
    __IO uint32_t IRQ044MON;
    __IO uint32_t IRQ045MON;
    __IO uint32_t IRQ046MON;
    __IO uint32_t IRQ047MON;
    __IO uint32_t IRQ048MON;
    __IO uint32_t IRQ049MON;
    __IO uint32_t IRQ050MON;
    __IO uint32_t IRQ051MON;
    __IO uint32_t IRQ052MON;
    __IO uint32_t IRQ053MON;
    __IO uint32_t IRQ054MON;
    __IO uint32_t IRQ055MON;
    __IO uint32_t IRQ056MON;
    __IO uint32_t IRQ057MON;
    __IO uint32_t IRQ058MON;
    __IO uint32_t IRQ059MON;
    __IO uint32_t IRQ060MON;
    __IO uint32_t IRQ061MON;
    __IO uint32_t IRQ062MON;
    __IO uint32_t IRQ063MON;
    __IO uint32_t IRQ064MON;
    __IO uint32_t IRQ065MON;
    __IO uint32_t IRQ066MON;
    __IO uint32_t IRQ067MON;
    __IO uint32_t IRQ068MON;
    __IO uint32_t IRQ069MON;
    __IO uint32_t IRQ070MON;
    __IO uint32_t IRQ071MON;
    __IO uint32_t IRQ072MON;
    __IO uint32_t IRQ073MON;
    __IO uint32_t IRQ074MON;
    __IO uint32_t IRQ075MON;
    __IO uint32_t IRQ076MON;
    __IO uint32_t IRQ077MON;
    __IO uint32_t IRQ078MON;
    __IO uint32_t IRQ079MON;
    __IO uint32_t IRQ080MON;
    __IO uint32_t IRQ081MON;
    __IO uint32_t IRQ082MON;
    __IO uint32_t IRQ083MON;
    __IO uint32_t IRQ084MON;
    __IO uint32_t IRQ085MON;
    __IO uint32_t IRQ086MON;
    __IO uint32_t IRQ087MON;
    __IO uint32_t IRQ088MON;
    __IO uint32_t IRQ089MON;
    __IO uint32_t IRQ090MON;
    __IO uint32_t IRQ091MON;
    __IO uint32_t IRQ092MON;
    __IO uint32_t IRQ093MON;
    __IO uint32_t IRQ094MON;
    __IO uint32_t IRQ095MON;
    __IO uint32_t IRQ096MON;
    __IO uint32_t IRQ097MON;
    __IO uint32_t IRQ098MON;
    __IO uint32_t IRQ099MON;
    __IO uint32_t IRQ100MON;
    __IO uint32_t IRQ101MON;
    __IO uint32_t IRQ102MON;
    __IO uint32_t IRQ103MON;
    __IO uint32_t IRQ104MON;
    __IO uint32_t IRQ105MON;
    __IO uint32_t IRQ106MON;
    __IO uint32_t IRQ107MON;
    __IO uint32_t IRQ108MON;
    __IO uint32_t IRQ109MON;
    __IO uint32_t IRQ110MON;
    __IO uint32_t IRQ111MON;
    __IO uint32_t IRQ112MON;
    __IO uint32_t IRQ113MON;
    __IO uint32_t IRQ114MON;
    __IO uint32_t IRQ115MON;
    __IO uint32_t IRQ116MON;
    __IO uint32_t IRQ117MON;
    __IO uint32_t IRQ118MON;
    __IO uint32_t IRQ119MON;
    __IO uint32_t IRQ120MON;
    __IO uint32_t IRQ121MON;
    __IO uint32_t IRQ122MON;
    __IO uint32_t IRQ123MON;
    __IO uint32_t IRQ124MON;
    __IO uint32_t IRQ125MON;
    __IO uint32_t IRQ126MON;
    __IO uint32_t IRQ127MON;
    __IO uint32_t IRQ128MON;
    __IO uint32_t IRQ129MON;
    __IO uint32_t IRQ130MON;
    __IO uint32_t IRQ131MON;
    __IO uint32_t IRQ132MON;
    __IO uint32_t IRQ133MON;
    __IO uint32_t IRQ134MON;
    __IO uint32_t IRQ135MON;
    __IO uint32_t IRQ136MON;
    __IO uint32_t IRQ137MON;
    __IO uint32_t IRQ138MON;
    __IO uint32_t IRQ139MON;
    __IO uint32_t IRQ140MON;
    __IO uint32_t IRQ141MON;
    __IO uint32_t IRQ142MON;
    __IO uint32_t IRQ143MON;
    __IO uint32_t IRQ144MON;
    __IO uint32_t IRQ145MON;
    __IO uint32_t IRQ146MON;
    __IO uint32_t IRQ147MON;
    __IO uint32_t IRQ148MON;
    __IO uint32_t IRQ149MON;
    __IO uint32_t IRQ150MON;
    __IO uint32_t IRQ151MON;
    __IO uint32_t IRQ152MON;
    __IO uint32_t IRQ153MON;
    __IO uint32_t IRQ154MON;
    __IO uint32_t IRQ155MON;
    __IO uint32_t IRQ156MON;
    __IO uint32_t IRQ157MON;
    __IO uint32_t IRQ158MON;
    __IO uint32_t IRQ159MON;
    __IO uint32_t IRQ160MON;
    __IO uint32_t IRQ161MON;
    __IO uint32_t IRQ162MON;
    __IO uint32_t IRQ163MON;
    __IO uint32_t IRQ164MON;
    __IO uint32_t IRQ165MON;
    __IO uint32_t IRQ166MON;
    __IO uint32_t IRQ167MON;
    __IO uint32_t IRQ168MON;
    __IO uint32_t IRQ169MON;
    __IO uint32_t IRQ170MON;
    __IO uint32_t IRQ171MON;
    __IO uint32_t IRQ172MON;
    __IO uint32_t IRQ173MON;
    __IO uint32_t IRQ174MON;
    __IO uint32_t IRQ175MON;
    __IO uint32_t IRQ176MON;
    __IO uint32_t IRQ177MON;
    __IO uint32_t IRQ178MON;
    __IO uint32_t IRQ179MON;
    __IO uint32_t IRQ180MON;
    __IO uint32_t IRQ181MON;
    __IO uint32_t IRQ182MON;
    __IO uint32_t IRQ183MON;
    __IO uint32_t IRQ184MON;
    __IO uint32_t IRQ185MON;
    __IO uint32_t IRQ186MON;
    __IO uint32_t IRQ187MON;
    __IO uint32_t IRQ188MON;
    __IO uint32_t IRQ189MON;
    __IO uint32_t IRQ190MON;
    __IO uint32_t IRQ191MON;
    __IO uint32_t IRQ192MON;
    __IO uint32_t IRQ193MON;
    __IO uint32_t IRQ194MON;
    __IO uint32_t IRQ195MON;
    __IO uint32_t IRQ196MON;
    __IO uint32_t IRQ197MON;
    __IO uint32_t IRQ198MON;
    __IO uint32_t IRQ199MON;
    __IO uint32_t IRQ200MON;
    __IO uint32_t IRQ201MON;
    __IO uint32_t IRQ202MON;
    __IO uint32_t IRQ203MON;
    __IO uint32_t IRQ204MON;
    __IO uint32_t IRQ205MON;
    __IO uint32_t IRQ206MON;
    __IO uint32_t IRQ207MON;
    __IO uint32_t IRQ208MON;
    __IO uint32_t IRQ209MON;
    __IO uint32_t IRQ210MON;
    __IO uint32_t IRQ211MON;
    __IO uint32_t IRQ212MON;
    __IO uint32_t IRQ213MON;
    __IO uint32_t IRQ214MON;
    __IO uint32_t IRQ215MON;
    __IO uint32_t IRQ216MON;
    __IO uint32_t IRQ217MON;
    __IO uint32_t IRQ218MON;
    __IO uint32_t IRQ219MON;
    __IO uint32_t IRQ220MON;
    __IO uint32_t IRQ221MON;
    __IO uint32_t IRQ222MON;
    __IO uint32_t IRQ223MON;
    __IO uint32_t IRQ224MON;
    __IO uint32_t IRQ225MON;
    __IO uint32_t IRQ226MON;
    __IO uint32_t IRQ227MON;
    __IO uint32_t IRQ228MON;
    __IO uint32_t IRQ229MON;
    __IO uint32_t IRQ230MON;
    __IO uint32_t IRQ231MON;
    __IO uint32_t IRQ232MON;
    __IO uint32_t IRQ233MON;
    __IO uint32_t IRQ234MON;
    __IO uint32_t IRQ235MON;
    __IO uint32_t IRQ236MON;
    __IO uint32_t IRQ237MON;
    __IO uint32_t IRQ238MON;
    __IO uint32_t IRQ239MON;
    __IO uint32_t IRQ240MON;
    __IO uint32_t IRQ241MON;
    __IO uint32_t IRQ242MON;
    __IO uint32_t IRQ243MON;
    __IO uint32_t IRQ244MON;
    __IO uint32_t IRQ245MON;
    __IO uint32_t IRQ246MON;
    __IO uint32_t IRQ247MON;
    __IO uint32_t IRQ248MON;
    __IO uint32_t IRQ249MON;
    __IO uint32_t IRQ250MON;
    __IO uint32_t IRQ251MON;
    __IO uint32_t IRQ252MON;
    __IO uint32_t IRQ253MON;
    __IO uint32_t IRQ254MON;
    __IO uint32_t IRQ255MON;
}PDL_INTREQ_TypeDef;

#define PDL_INTREQ_BASE     (PDL_PERIPH_BASE + 0x31000UL)  // Interrupt request read registers
#define PDL_INTREQ          ((PDL_INTREQ_TypeDef *)PDL_INTREQ_BASE)

