marcel-galliker/Mouvent-PrintEngine/rx_balance_ctrl/common/mb9b160l.h
typedef struct stc_exti_nmirr_field
{
  __IO  uint8_t NR         : 1;
} stc_exti_nmirr_field_t;

typedef struct stc_exti_nmicl_field
{
  __IO  uint8_t NCL        : 1;
} stc_exti_nmicl_field_t;

/******************************************************************************
 * INTREQ_MODULE
 ******************************************************************************/
/* INTREQ_MODULE register bit fields */
typedef struct stc_intreq_drqsel_field
{
  __IO uint32_t DRQSEL0    : 1;
  __IO uint32_t DRQSEL1    : 1;
  __IO uint32_t DRQSEL2    : 1;
  __IO uint32_t DRQSEL3    : 1;
  __IO uint32_t DRQSEL4    : 1;
  __IO uint32_t DRQSEL5    : 1;
  __IO uint32_t DRQSEL6    : 1;
  __IO uint32_t DRQSEL7    : 1;
  __IO uint32_t DRQSEL8    : 1;
  __IO uint32_t DRQSEL9    : 1;
  __IO uint32_t DRQSEL10   : 1;
  __IO uint32_t DRQSEL11   : 1;
  __IO uint32_t DRQSEL12   : 1;
  __IO uint32_t DRQSEL13   : 1;
  __IO uint32_t DRQSEL14   : 1;
  __IO uint32_t DRQSEL15   : 1;
  __IO uint32_t DRQSEL16   : 1;
  __IO uint32_t DRQSEL17   : 1;
  __IO uint32_t DRQSEL18   : 1;
  __IO uint32_t DRQSEL19   : 1;
  __IO uint32_t DRQSEL20   : 1;
  __IO uint32_t DRQSEL21   : 1;
  __IO uint32_t DRQSEL22   : 1;
  __IO uint32_t DRQSEL23   : 1;
  __IO uint32_t DRQSEL24   : 1;
  __IO uint32_t DRQSEL25   : 1;
  __IO uint32_t DRQSEL26   : 1;
  __IO uint32_t DRQSEL27   : 1;
  __IO uint32_t DRQSEL28   : 1;
  __IO uint32_t DRQSEL29   : 1;
  __IO uint32_t DRQSEL30   : 1;
  __IO uint32_t DRQSEL31   : 1;
} stc_intreq_drqsel_field_t;

typedef struct stc_intreq_oddpks_field
{
  __IO  uint8_t ODDPKS0    : 1;
  __IO  uint8_t ODDPKS1    : 1;
  __IO  uint8_t ODDPKS2    : 1;
  __IO  uint8_t ODDPKS3    : 1;
  __IO  uint8_t ODDPKS4    : 1;
} stc_intreq_oddpks_field_t;

typedef struct stc_intreq_irq003sel_field
{
  __IO uint32_t SELIRQ     : 8;
       uint32_t RESERVED8  : 8;
  __IO uint32_t SELBIT     : 8;
} stc_intreq_irq003sel_field_t;

typedef struct stc_intreq_irq004sel_field
{
  __IO uint32_t SELIRQ     : 8;
       uint32_t RESERVED8  : 8;
  __IO uint32_t SELBIT     : 8;
} stc_intreq_irq004sel_field_t;

typedef struct stc_intreq_irq005sel_field
{
  __IO uint32_t SELIRQ     : 8;
       uint32_t RESERVED8  : 8;
  __IO uint32_t SELBIT     : 8;
} stc_intreq_irq005sel_field_t;

typedef struct stc_intreq_irq006sel_field
{
  __IO uint32_t SELIRQ     : 8;
       uint32_t RESERVED8  : 8;
  __IO uint32_t SELBIT     : 8;
} stc_intreq_irq006sel_field_t;

typedef struct stc_intreq_irq007sel_field
{
  __IO uint32_t SELIRQ     : 8;
       uint32_t RESERVED8  : 8;
  __IO uint32_t SELBIT     : 8;
} stc_intreq_irq007sel_field_t;

typedef struct stc_intreq_irq008sel_field
{
  __IO uint32_t SELIRQ     : 8;
       uint32_t RESERVED8  : 8;
  __IO uint32_t SELBIT     : 8;
} stc_intreq_irq008sel_field_t;

typedef struct stc_intreq_irq009sel_field
{
  __IO uint32_t SELIRQ     : 8;
       uint32_t RESERVED8  : 8;
  __IO uint32_t SELBIT     : 8;
} stc_intreq_irq009sel_field_t;

typedef struct stc_intreq_irq010sel_field
{
  __IO uint32_t SELIRQ     : 8;
       uint32_t RESERVED8  : 8;
  __IO uint32_t SELBIT     : 8;
} stc_intreq_irq010sel_field_t;

typedef struct stc_intreq_exc02mon_field
{
  __IO uint32_t NMI        : 1;
  __IO uint32_t HWINT      : 1;
} stc_intreq_exc02mon_field_t;

typedef struct stc_intreq_irq000mon_field
{
  __IO uint32_t FCSINT     : 1;
} stc_intreq_irq000mon_field_t;

typedef struct stc_intreq_irq001mon_field
{
  __IO uint32_t SWWDTINT   : 1;
} stc_intreq_irq001mon_field_t;

typedef struct stc_intreq_irq002mon_field
{
  __IO uint32_t LVDINT     : 1;
} stc_intreq_irq002mon_field_t;

typedef struct stc_intreq_irq003mon_field
{
  __IO uint32_t IRQBIT0    : 1;
  __IO uint32_t IRQBIT1    : 1;
  __IO uint32_t IRQBIT2    : 1;
  __IO uint32_t IRQBIT3    : 1;
  __IO uint32_t IRQBIT4    : 1;
  __IO uint32_t IRQBIT5    : 1;
  __IO uint32_t IRQBIT6    : 1;
  __IO uint32_t IRQBIT7    : 1;
} stc_intreq_irq003mon_field_t;

typedef struct stc_intreq_irq004mon_field
{
  __IO uint32_t IRQBIT0    : 1;
  __IO uint32_t IRQBIT1    : 1;
  __IO uint32_t IRQBIT2    : 1;
  __IO uint32_t IRQBIT3    : 1;
  __IO uint32_t IRQBIT4    : 1;
  __IO uint32_t IRQBIT5    : 1;
  __IO uint32_t IRQBIT6    : 1;
  __IO uint32_t IRQBIT7    : 1;
} stc_intreq_irq004mon_field_t;

typedef struct stc_intreq_irq005mon_field
{
  __IO uint32_t IRQBIT0    : 1;
  __IO uint32_t IRQBIT1    : 1;
  __IO uint32_t IRQBIT2    : 1;
  __IO uint32_t IRQBIT3    : 1;
  __IO uint32_t IRQBIT4    : 1;
  __IO uint32_t IRQBIT5    : 1;
  __IO uint32_t IRQBIT6    : 1;
  __IO uint32_t IRQBIT7    : 1;
} stc_intreq_irq005mon_field_t;

typedef struct stc_intreq_irq006mon_field
{
  __IO uint32_t IRQBIT0    : 1;
  __IO uint32_t IRQBIT1    : 1;
  __IO uint32_t IRQBIT2    : 1;
  __IO uint32_t IRQBIT3    : 1;
  __IO uint32_t IRQBIT4    : 1;
  __IO uint32_t IRQBIT5    : 1;
  __IO uint32_t IRQBIT6    : 1;
  __IO uint32_t IRQBIT7    : 1;
} stc_intreq_irq006mon_field_t;

typedef struct stc_intreq_irq007mon_field
{
  __IO uint32_t IRQBIT0    : 1;
  __IO uint32_t IRQBIT1    : 1;
  __IO uint32_t IRQBIT2    : 1;
  __IO uint32_t IRQBIT3    : 1;
  __IO uint32_t IRQBIT4    : 1;
  __IO uint32_t IRQBIT5    : 1;
  __IO uint32_t IRQBIT6    : 1;
  __IO uint32_t IRQBIT7    : 1;
} stc_intreq_irq007mon_field_t;

typedef struct stc_intreq_irq008mon_field
{
  __IO uint32_t IRQBIT0    : 1;
  __IO uint32_t IRQBIT1    : 1;
  __IO uint32_t IRQBIT2    : 1;
  __IO uint32_t IRQBIT3    : 1;
  __IO uint32_t IRQBIT4    : 1;
  __IO uint32_t IRQBIT5    : 1;
  __IO uint32_t IRQBIT6    : 1;
  __IO uint32_t IRQBIT7    : 1;
} stc_intreq_irq008mon_field_t;

typedef struct stc_intreq_irq009mon_field
{
  __IO uint32_t IRQBIT0    : 1;
  __IO uint32_t IRQBIT1    : 1;
  __IO uint32_t IRQBIT2    : 1;
  __IO uint32_t IRQBIT3    : 1;
  __IO uint32_t IRQBIT4    : 1;
  __IO uint32_t IRQBIT5    : 1;
  __IO uint32_t IRQBIT6    : 1;
  __IO uint32_t IRQBIT7    : 1;
} stc_intreq_irq009mon_field_t;

