marcel-galliker/Mouvent-PrintEngine/rx_balance_ctrl/common/mb9b160l.h
typedef struct stc_intreq_irq010mon_field
{
  __IO uint32_t IRQBIT0    : 1;
  __IO uint32_t IRQBIT1    : 1;
  __IO uint32_t IRQBIT2    : 1;
  __IO uint32_t IRQBIT3    : 1;
  __IO uint32_t IRQBIT4    : 1;
  __IO uint32_t IRQBIT5    : 1;
  __IO uint32_t IRQBIT6    : 1;
  __IO uint32_t IRQBIT7    : 1;
} stc_intreq_irq010mon_field_t;

typedef struct stc_intreq_irq011mon_field
{
  __IO uint32_t EXTINT     : 1;
} stc_intreq_irq011mon_field_t;

typedef struct stc_intreq_irq012mon_field
{
  __IO uint32_t EXTINT     : 1;
} stc_intreq_irq012mon_field_t;

typedef struct stc_intreq_irq013mon_field
{
  __IO uint32_t EXTINT     : 1;
} stc_intreq_irq013mon_field_t;

typedef struct stc_intreq_irq014mon_field
{
  __IO uint32_t EXTINT     : 1;
} stc_intreq_irq014mon_field_t;

typedef struct stc_intreq_irq015mon_field
{
  __IO uint32_t EXTINT     : 1;
} stc_intreq_irq015mon_field_t;

typedef struct stc_intreq_irq016mon_field
{
  __IO uint32_t EXTINT     : 1;
} stc_intreq_irq016mon_field_t;

typedef struct stc_intreq_irq017mon_field
{
  __IO uint32_t EXTINT     : 1;
} stc_intreq_irq017mon_field_t;

typedef struct stc_intreq_irq018mon_field
{
  __IO uint32_t EXTINT     : 1;
} stc_intreq_irq018mon_field_t;

typedef struct stc_intreq_irq019mon_field
{
  __IO uint32_t QUDINT0    : 1;
  __IO uint32_t QUDINT1    : 1;
  __IO uint32_t QUDINT2    : 1;
  __IO uint32_t QUDINT3    : 1;
  __IO uint32_t QUDINT4    : 1;
  __IO uint32_t QUDINT5    : 1;
} stc_intreq_irq019mon_field_t;

typedef struct stc_intreq_irq020mon_field
{
  __IO uint32_t QUDINT0    : 1;
  __IO uint32_t QUDINT1    : 1;
  __IO uint32_t QUDINT2    : 1;
  __IO uint32_t QUDINT3    : 1;
  __IO uint32_t QUDINT4    : 1;
  __IO uint32_t QUDINT5    : 1;
} stc_intreq_irq020mon_field_t;

typedef struct stc_intreq_irq021mon_field
{
  __IO uint32_t WAVEINT0   : 1;
  __IO uint32_t WAVEINT1   : 1;
  __IO uint32_t WAVEINT2   : 1;
  __IO uint32_t WAVEINT3   : 1;
} stc_intreq_irq021mon_field_t;

typedef struct stc_intreq_irq022mon_field
{
  __IO uint32_t WAVEINT0   : 1;
  __IO uint32_t WAVEINT1   : 1;
  __IO uint32_t WAVEINT2   : 1;
  __IO uint32_t WAVEINT3   : 1;
} stc_intreq_irq022mon_field_t;

typedef struct stc_intreq_irq023mon_field
{
  __IO uint32_t WAVEINT0   : 1;
  __IO uint32_t WAVEINT1   : 1;
  __IO uint32_t WAVEINT2   : 1;
  __IO uint32_t WAVEINT3   : 1;
} stc_intreq_irq023mon_field_t;

typedef struct stc_intreq_irq024mon_field
{
  __IO uint32_t FRT_PEAK_INT0: 1;
  __IO uint32_t FRT_PEAK_INT1: 1;
  __IO uint32_t FRT_PEAK_INT2: 1;
} stc_intreq_irq024mon_field_t;

typedef struct stc_intreq_irq025mon_field
{
  __IO uint32_t FRT_ZERO_INT0: 1;
  __IO uint32_t FRT_ZERO_INT1: 1;
  __IO uint32_t FRT_ZERO_INT2: 1;
} stc_intreq_irq025mon_field_t;

typedef struct stc_intreq_irq026mon_field
{
  __IO uint32_t ICUINT0    : 1;
  __IO uint32_t ICUINT1    : 1;
  __IO uint32_t ICUINT2    : 1;
  __IO uint32_t ICUINT3    : 1;
} stc_intreq_irq026mon_field_t;

typedef struct stc_intreq_irq027mon_field
{
  __IO uint32_t OCUINT0    : 1;
  __IO uint32_t OCUINT1    : 1;
  __IO uint32_t OCUINT2    : 1;
  __IO uint32_t OCUINT3    : 1;
  __IO uint32_t OCUINT4    : 1;
  __IO uint32_t OCUINT5    : 1;
} stc_intreq_irq027mon_field_t;

typedef struct stc_intreq_irq028mon_field
{
  __IO uint32_t FRT_PEAK_INT0: 1;
  __IO uint32_t FRT_PEAK_INT1: 1;
  __IO uint32_t FRT_PEAK_INT2: 1;
} stc_intreq_irq028mon_field_t;

typedef struct stc_intreq_irq029mon_field
{
  __IO uint32_t FRT_ZERO_INT0: 1;
  __IO uint32_t FRT_ZERO_INT1: 1;
  __IO uint32_t FRT_ZERO_INT2: 1;
} stc_intreq_irq029mon_field_t;

typedef struct stc_intreq_irq030mon_field
{
  __IO uint32_t ICUINT0    : 1;
  __IO uint32_t ICUINT1    : 1;
  __IO uint32_t ICUINT2    : 1;
  __IO uint32_t ICUINT3    : 1;
} stc_intreq_irq030mon_field_t;

typedef struct stc_intreq_irq031mon_field
{
  __IO uint32_t OCUINT0    : 1;
  __IO uint32_t OCUINT1    : 1;
  __IO uint32_t OCUINT2    : 1;
  __IO uint32_t OCUINT3    : 1;
  __IO uint32_t OCUINT4    : 1;
  __IO uint32_t OCUINT5    : 1;
} stc_intreq_irq031mon_field_t;

typedef struct stc_intreq_irq032mon_field
{
  __IO uint32_t FRT_PEAK_INT0: 1;
  __IO uint32_t FRT_PEAK_INT1: 1;
  __IO uint32_t FRT_PEAK_INT2: 1;
} stc_intreq_irq032mon_field_t;

typedef struct stc_intreq_irq033mon_field
{
  __IO uint32_t FRT_ZERO_INT0: 1;
  __IO uint32_t FRT_ZERO_INT1: 1;
  __IO uint32_t FRT_ZERO_INT2: 1;
} stc_intreq_irq033mon_field_t;

typedef struct stc_intreq_irq034mon_field
{
  __IO uint32_t ICUINT0    : 1;
  __IO uint32_t ICUINT1    : 1;
  __IO uint32_t ICUINT2    : 1;
  __IO uint32_t ICUINT3    : 1;
} stc_intreq_irq034mon_field_t;

typedef struct stc_intreq_irq035mon_field
{
  __IO uint32_t OCUINT0    : 1;
  __IO uint32_t OCUINT1    : 1;
  __IO uint32_t OCUINT2    : 1;
  __IO uint32_t OCUINT3    : 1;
  __IO uint32_t OCUINT4    : 1;
  __IO uint32_t OCUINT5    : 1;
} stc_intreq_irq035mon_field_t;

typedef struct stc_intreq_irq036mon_field
{
  __IO uint32_t PPGINT0    : 1;
  __IO uint32_t PPGINT1    : 1;
  __IO uint32_t PPGINT2    : 1;
} stc_intreq_irq036mon_field_t;

typedef struct stc_intreq_irq037mon_field
{
  __IO uint32_t PPGINT0    : 1;
  __IO uint32_t PPGINT1    : 1;
  __IO uint32_t PPGINT2    : 1;
} stc_intreq_irq037mon_field_t;

typedef struct stc_intreq_irq038mon_field
{
  __IO uint32_t PPGINT0    : 1;
  __IO uint32_t PPGINT1    : 1;
  __IO uint32_t PPGINT2    : 1;
} stc_intreq_irq038mon_field_t;

typedef struct stc_intreq_irq039mon_field
{
  __IO uint32_t BTINT0     : 1;
  __IO uint32_t BTINT1     : 1;
} stc_intreq_irq039mon_field_t;

typedef struct stc_intreq_irq040mon_field
{
  __IO uint32_t BTINT0     : 1;
  __IO uint32_t BTINT1     : 1;
} stc_intreq_irq040mon_field_t;

typedef struct stc_intreq_irq041mon_field
{
  __IO uint32_t BTINT0     : 1;
  __IO uint32_t BTINT1     : 1;
} stc_intreq_irq041mon_field_t;

typedef struct stc_intreq_irq042mon_field
{
  __IO uint32_t BTINT0     : 1;
  __IO uint32_t BTINT1     : 1;
} stc_intreq_irq042mon_field_t;

typedef struct stc_intreq_irq043mon_field
{
  __IO uint32_t BTINT0     : 1;
  __IO uint32_t BTINT1     : 1;
} stc_intreq_irq043mon_field_t;

