marcel-galliker/Mouvent-PrintEngine/rx_balance_ctrl/common/mb9b160l.h
typedef struct stc_rtc_wtdr_field
{
  union {
    struct {
      __IO  uint8_t D          : 4;
      __IO  uint8_t TD         : 2;
            uint8_t RESERVED1  : 2;
    };
    struct {
      __IO  uint8_t D0         : 1;
      __IO  uint8_t D1         : 1;
      __IO  uint8_t D2         : 1;
      __IO  uint8_t D3         : 1;
      __IO  uint8_t TD0        : 1;
      __IO  uint8_t TD1        : 1;
            uint8_t RESERVED2  : 2;
    };
  };
} stc_rtc_wtdr_field_t;

typedef struct stc_rtc_wtdw_field
{
  union {
    struct {
      __IO  uint8_t DW         : 3;
            uint8_t RESERVED1  : 5;
    };
    struct {
      __IO  uint8_t DW0        : 1;
      __IO  uint8_t DW1        : 1;
      __IO  uint8_t DW2        : 1;
            uint8_t RESERVED2  : 5;
    };
  };
} stc_rtc_wtdw_field_t;

typedef struct stc_rtc_wtmor_field
{
  union {
    struct {
      __IO  uint8_t MO         : 4;
      __IO  uint8_t TMO        : 1;
            uint8_t RESERVED1  : 3;
    };
    struct {
      __IO  uint8_t MO0        : 1;
      __IO  uint8_t MO1        : 1;
      __IO  uint8_t MO2        : 1;
      __IO  uint8_t MO3        : 1;
            uint8_t RESERVED2  : 4;
    };
  };
} stc_rtc_wtmor_field_t;

typedef struct stc_rtc_wtyr_field
{
  union {
    struct {
      __IO  uint8_t Y          : 4;
      __IO  uint8_t TY         : 4;
    };
    struct {
      __IO  uint8_t Y0         : 1;
      __IO  uint8_t Y1         : 1;
      __IO  uint8_t Y2         : 1;
      __IO  uint8_t Y3         : 1;
      __IO  uint8_t TY0        : 1;
      __IO  uint8_t TY1        : 1;
      __IO  uint8_t TY2        : 1;
      __IO  uint8_t TY3        : 1;
    };
  };
} stc_rtc_wtyr_field_t;

typedef struct stc_rtc_almir_field
{
  union {
    struct {
      __IO  uint8_t AMI        : 4;
      __IO  uint8_t TAMI       : 3;
            uint8_t RESERVED1  : 1;
    };
    struct {
      __IO  uint8_t AMI0       : 1;
      __IO  uint8_t AMI1       : 1;
      __IO  uint8_t AMI2       : 1;
      __IO  uint8_t AMI3       : 1;
      __IO  uint8_t TAMI0      : 1;
      __IO  uint8_t TAMI1      : 1;
      __IO  uint8_t TAMI2      : 1;
            uint8_t RESERVED2  : 1;
    };
  };
} stc_rtc_almir_field_t;

typedef struct stc_rtc_alhr_field
{
  union {
    struct {
      __IO  uint8_t AH         : 4;
      __IO  uint8_t TAH        : 2;
            uint8_t RESERVED1  : 2;
    };
    struct {
      __IO  uint8_t AH0        : 1;
      __IO  uint8_t AH1        : 1;
      __IO  uint8_t AH2        : 1;
      __IO  uint8_t AH3        : 1;
      __IO  uint8_t TAH0       : 1;
      __IO  uint8_t TAH1       : 1;
            uint8_t RESERVED2  : 2;
    };
  };
} stc_rtc_alhr_field_t;

typedef struct stc_rtc_aldr_field
{
  union {
    struct {
      __IO  uint8_t AD         : 4;
      __IO  uint8_t TAD        : 2;
            uint8_t RESERVED1  : 2;
    };
    struct {
      __IO  uint8_t AD0        : 1;
      __IO  uint8_t AD1        : 1;
      __IO  uint8_t AD2        : 1;
      __IO  uint8_t AD3        : 1;
      __IO  uint8_t TAD0       : 1;
      __IO  uint8_t TAD1       : 1;
            uint8_t RESERVED2  : 2;
    };
  };
} stc_rtc_aldr_field_t;

typedef struct stc_rtc_almor_field
{
  union {
    struct {
      __IO  uint8_t AMO        : 4;
      __IO  uint8_t TAMO       : 1;
            uint8_t RESERVED1  : 3;
    };
    struct {
      __IO  uint8_t AMO0       : 1;
      __IO  uint8_t AMO1       : 1;
      __IO  uint8_t AMO2       : 1;
      __IO  uint8_t AMO3       : 1;
            uint8_t RESERVED2  : 4;
    };
  };
} stc_rtc_almor_field_t;

typedef struct stc_rtc_alyr_field
{
  union {
    struct {
      __IO  uint8_t AY         : 4;
      __IO  uint8_t TAY        : 4;
    };
    struct {
      __IO  uint8_t AY0        : 1;
      __IO  uint8_t AY1        : 1;
      __IO  uint8_t AY2        : 1;
      __IO  uint8_t AY3        : 1;
      __IO  uint8_t TAY0       : 1;
      __IO  uint8_t TAY1       : 1;
      __IO  uint8_t TAY2       : 1;
      __IO  uint8_t TAY3       : 1;
    };
  };
} stc_rtc_alyr_field_t;

typedef struct stc_rtc_wttr0_field
{
  __IO  uint8_t TM0        : 1;
  __IO  uint8_t TM1        : 1;
  __IO  uint8_t TM2        : 1;
  __IO  uint8_t TM3        : 1;
  __IO  uint8_t TM4        : 1;
  __IO  uint8_t TM5        : 1;
  __IO  uint8_t TM6        : 1;
  __IO  uint8_t TM7        : 1;
} stc_rtc_wttr0_field_t;

typedef struct stc_rtc_wttr1_field
{
  __IO  uint8_t TM8        : 1;
  __IO  uint8_t TM9        : 1;
  __IO  uint8_t TM10       : 1;
  __IO  uint8_t TM11       : 1;
  __IO  uint8_t TM12       : 1;
  __IO  uint8_t TM13       : 1;
  __IO  uint8_t TM14       : 1;
  __IO  uint8_t TM15       : 1;
} stc_rtc_wttr1_field_t;

typedef struct stc_rtc_wttr2_field
{
  __IO  uint8_t TM16       : 1;
  __IO  uint8_t TM17       : 1;
        uint8_t RESERVED1  : 6;
} stc_rtc_wttr2_field_t;

/* RTC CLK */
typedef struct stc_rtc_wtcal1_field
{
  union {
    struct {
      __IO  uint8_t WTCAL1     : 2;
            uint8_t RESERVED1  : 6;
    };
    struct {
      __IO  uint8_t WTCAL10    : 1;
      __IO  uint8_t WTCAL11    : 1;
            uint8_t RESERVED2  : 6;
    };
  };
} stc_rtc_wtcal1_field_t;

typedef struct stc_rtc_wtcalen_field
{
  __IO  uint8_t WTCALEN    : 1;
        uint8_t RESERVED1  : 7;
} stc_rtc_wtcalen_field_t;

typedef struct stc_rtc_wtdiv_field
{
  union {
    struct {
      __IO  uint8_t WTDIV      : 4;
            uint8_t RESERVED1  : 4;
    };
    struct {
      __IO  uint8_t WTDIV0     : 1;
      __IO  uint8_t WTDIV1     : 1;
      __IO  uint8_t WTDIV2     : 1;
      __IO  uint8_t WTDIV3     : 1;
            uint8_t RESERVED2  : 4;
    };
  };
} stc_rtc_wtdiv_field_t;

typedef struct stc_rtc_wtdiven_field
{
  __IO  uint8_t WTDIVEN    : 1;
  __IO  uint8_t WTDIVRDY   : 1;
        uint8_t RESERVED1  : 6;
} stc_rtc_wtdiven_field_t;

typedef struct stc_rtc_wtcalprd_field
{
  union {
    struct {
      __IO  uint8_t WTCALPRD   : 6;
            uint8_t RESERVED1  : 2;
    };
    struct {
      __IO  uint8_t WTCALPRD0  : 1;
      __IO  uint8_t WTCALPRD1  : 1;
      __IO  uint8_t WTCALPRD2  : 1;
      __IO  uint8_t WTCALPRD3  : 1;
      __IO  uint8_t WTCALPRD4  : 1;
      __IO  uint8_t WTCALPRD5  : 1;
            uint8_t RESERVED2  : 2;
    };
  };
} stc_rtc_wtcalprd_field_t;

typedef struct stc_rtc_wtcosel_field
{
  __IO  uint8_t WTCOSEL    : 1;
  __IO  uint8_t WTDIVRDY   : 7;
} stc_rtc_wtcosel_field_t;

/* VBVat Domain */
typedef struct stc_rtc_vb_clkdiv_field
{
  __IO  uint8_t DIV        : 8;
} stc_rtc_vb_clkdiv_field_t;

typedef struct stc_rtc_wtosccnt_field
{
  __IO  uint8_t SOSCEX     : 1;
  __IO  uint8_t SOSCNTL    : 1;
} stc_rtc_wtosccnt_field_t;

typedef struct stc_rtc_boost_field
{
  __IO  uint8_t BOOST      : 2;
} stc_rtc_boost_field_t;

typedef struct stc_rtc_ewkup_field
{
  __IO  uint8_t WUP0       : 1;
} stc_rtc_ewkup_field_t;

typedef struct stc_rtc_vdet_field
{
        uint8_t RESERVED0  : 7;
  __IO  uint8_t PON        : 1;
} stc_rtc_vdet_field_t;

