marcel-galliker/Mouvent-PrintEngine/rx_balance_ctrl/common/mb9b160l.h
/* General purpose I/O registers */
#define bFM4_GPIO_PFR0_P0                     *((volatile unsigned int*)(0x42DE0000UL))
#define bFM4_GPIO_PFR0_P1                     *((volatile unsigned int*)(0x42DE0004UL))
#define bFM4_GPIO_PFR0_P2                     *((volatile unsigned int*)(0x42DE0008UL))
#define bFM4_GPIO_PFR0_P3                     *((volatile unsigned int*)(0x42DE000CUL))
#define bFM4_GPIO_PFR0_P4                     *((volatile unsigned int*)(0x42DE0010UL))
#define bFM4_GPIO_PFR0_P5                     *((volatile unsigned int*)(0x42DE0014UL))
#define bFM4_GPIO_PFR0_P6                     *((volatile unsigned int*)(0x42DE0018UL))
#define bFM4_GPIO_PFR0_P7                     *((volatile unsigned int*)(0x42DE001CUL))
#define bFM4_GPIO_PFR0_P8                     *((volatile unsigned int*)(0x42DE0020UL))
#define bFM4_GPIO_PFR0_P9                     *((volatile unsigned int*)(0x42DE0024UL))
#define bFM4_GPIO_PFR0_PA                     *((volatile unsigned int*)(0x42DE0028UL))
#define bFM4_GPIO_PFR0_PB                     *((volatile unsigned int*)(0x42DE002CUL))
#define bFM4_GPIO_PFR0_PC                     *((volatile unsigned int*)(0x42DE0030UL))
#define bFM4_GPIO_PFR0_PD                     *((volatile unsigned int*)(0x42DE0034UL))
#define bFM4_GPIO_PFR0_PE                     *((volatile unsigned int*)(0x42DE0038UL))
#define bFM4_GPIO_PFR1_P0                     *((volatile unsigned int*)(0x42DE0080UL))
#define bFM4_GPIO_PFR1_P1                     *((volatile unsigned int*)(0x42DE0084UL))
#define bFM4_GPIO_PFR1_P2                     *((volatile unsigned int*)(0x42DE0088UL))
#define bFM4_GPIO_PFR1_P3                     *((volatile unsigned int*)(0x42DE008CUL))
#define bFM4_GPIO_PFR1_P4                     *((volatile unsigned int*)(0x42DE0090UL))
#define bFM4_GPIO_PFR1_P5                     *((volatile unsigned int*)(0x42DE0094UL))
#define bFM4_GPIO_PFR1_P6                     *((volatile unsigned int*)(0x42DE0098UL))
#define bFM4_GPIO_PFR1_P7                     *((volatile unsigned int*)(0x42DE009CUL))
#define bFM4_GPIO_PFR1_P8                     *((volatile unsigned int*)(0x42DE00A0UL))
#define bFM4_GPIO_PFR1_P9                     *((volatile unsigned int*)(0x42DE00A4UL))
#define bFM4_GPIO_PFR1_PA                     *((volatile unsigned int*)(0x42DE00A8UL))
#define bFM4_GPIO_PFR1_PB                     *((volatile unsigned int*)(0x42DE00ACUL))
#define bFM4_GPIO_PFR1_PC                     *((volatile unsigned int*)(0x42DE00B0UL))
#define bFM4_GPIO_PFR1_PD                     *((volatile unsigned int*)(0x42DE00B4UL))
#define bFM4_GPIO_PFR1_PE                     *((volatile unsigned int*)(0x42DE00B8UL))
#define bFM4_GPIO_PFR1_PF                     *((volatile unsigned int*)(0x42DE00BCUL))
#define bFM4_GPIO_PFR2_P0                     *((volatile unsigned int*)(0x42DE0100UL))
#define bFM4_GPIO_PFR2_P1                     *((volatile unsigned int*)(0x42DE0104UL))
#define bFM4_GPIO_PFR2_P2                     *((volatile unsigned int*)(0x42DE0108UL))
#define bFM4_GPIO_PFR2_P3                     *((volatile unsigned int*)(0x42DE010CUL))
#define bFM4_GPIO_PFR2_P4                     *((volatile unsigned int*)(0x42DE0110UL))
#define bFM4_GPIO_PFR2_P5                     *((volatile unsigned int*)(0x42DE0114UL))
#define bFM4_GPIO_PFR2_P6                     *((volatile unsigned int*)(0x42DE0118UL))
#define bFM4_GPIO_PFR2_P7                     *((volatile unsigned int*)(0x42DE011CUL))
#define bFM4_GPIO_PFR3_P0                     *((volatile unsigned int*)(0x42DE0180UL))
#define bFM4_GPIO_PFR3_P1                     *((volatile unsigned int*)(0x42DE0184UL))
#define bFM4_GPIO_PFR3_P2                     *((volatile unsigned int*)(0x42DE0188UL))
#define bFM4_GPIO_PFR3_P3                     *((volatile unsigned int*)(0x42DE018CUL))
#define bFM4_GPIO_PFR3_P4                     *((volatile unsigned int*)(0x42DE0190UL))
#define bFM4_GPIO_PFR3_P5                     *((volatile unsigned int*)(0x42DE0194UL))
#define bFM4_GPIO_PFR3_P6                     *((volatile unsigned int*)(0x42DE0198UL))
#define bFM4_GPIO_PFR3_P7                     *((volatile unsigned int*)(0x42DE019CUL))
#define bFM4_GPIO_PFR3_P8                     *((volatile unsigned int*)(0x42DE01A0UL))
#define bFM4_GPIO_PFR3_P9                     *((volatile unsigned int*)(0x42DE01A4UL))
#define bFM4_GPIO_PFR3_PA                     *((volatile unsigned int*)(0x42DE01A8UL))
#define bFM4_GPIO_PFR3_PB                     *((volatile unsigned int*)(0x42DE01ACUL))
#define bFM4_GPIO_PFR3_PC                     *((volatile unsigned int*)(0x42DE01B0UL))
#define bFM4_GPIO_PFR3_PD                     *((volatile unsigned int*)(0x42DE01B4UL))
#define bFM4_GPIO_PFR3_PE                     *((volatile unsigned int*)(0x42DE01B8UL))
#define bFM4_GPIO_PFR3_PF                     *((volatile unsigned int*)(0x42DE01BCUL))
#define bFM4_GPIO_PFR4_P0                     *((volatile unsigned int*)(0x42DE0200UL))
#define bFM4_GPIO_PFR4_P1                     *((volatile unsigned int*)(0x42DE0204UL))
#define bFM4_GPIO_PFR4_P2                     *((volatile unsigned int*)(0x42DE0208UL))
#define bFM4_GPIO_PFR4_P3                     *((volatile unsigned int*)(0x42DE020CUL))
#define bFM4_GPIO_PFR4_P4                     *((volatile unsigned int*)(0x42DE0210UL))
#define bFM4_GPIO_PFR4_P5                     *((volatile unsigned int*)(0x42DE0214UL))
#define bFM4_GPIO_PFR4_P6                     *((volatile unsigned int*)(0x42DE0218UL))
#define bFM4_GPIO_PFR4_P7                     *((volatile unsigned int*)(0x42DE021CUL))
#define bFM4_GPIO_PFR4_P8                     *((volatile unsigned int*)(0x42DE0220UL))
#define bFM4_GPIO_PFR4_P9                     *((volatile unsigned int*)(0x42DE0224UL))
#define bFM4_GPIO_PFR4_PA                     *((volatile unsigned int*)(0x42DE0228UL))
#define bFM4_GPIO_PFR4_PB                     *((volatile unsigned int*)(0x42DE022CUL))
#define bFM4_GPIO_PFR4_PC                     *((volatile unsigned int*)(0x42DE0230UL))
#define bFM4_GPIO_PFR4_PD                     *((volatile unsigned int*)(0x42DE0234UL))
#define bFM4_GPIO_PFR4_PE                     *((volatile unsigned int*)(0x42DE0238UL))
#define bFM4_GPIO_PFR5_P0                     *((volatile unsigned int*)(0x42DE0280UL))
#define bFM4_GPIO_PFR5_P1                     *((volatile unsigned int*)(0x42DE0284UL))
#define bFM4_GPIO_PFR5_P2                     *((volatile unsigned int*)(0x42DE0288UL))
#define bFM4_GPIO_PFR5_P3                     *((volatile unsigned int*)(0x42DE028CUL))
#define bFM4_GPIO_PFR5_P4                     *((volatile unsigned int*)(0x42DE0290UL))
#define bFM4_GPIO_PFR5_P5                     *((volatile unsigned int*)(0x42DE0294UL))
#define bFM4_GPIO_PFR5_P6                     *((volatile unsigned int*)(0x42DE0298UL))
#define bFM4_GPIO_PFR5_P7                     *((volatile unsigned int*)(0x42DE029CUL))
#define bFM4_GPIO_PFR5_P8                     *((volatile unsigned int*)(0x42DE02A0UL))
#define bFM4_GPIO_PFR5_P9                     *((volatile unsigned int*)(0x42DE02A4UL))
#define bFM4_GPIO_PFR5_PA                     *((volatile unsigned int*)(0x42DE02A8UL))
#define bFM4_GPIO_PFR5_PB                     *((volatile unsigned int*)(0x42DE02ACUL))
#define bFM4_GPIO_PFR6_P0                     *((volatile unsigned int*)(0x42DE0300UL))
#define bFM4_GPIO_PFR6_P1                     *((volatile unsigned int*)(0x42DE0304UL))
#define bFM4_GPIO_PFR6_P2                     *((volatile unsigned int*)(0x42DE0308UL))
#define bFM4_GPIO_PFR6_P3                     *((volatile unsigned int*)(0x42DE030CUL))
#define bFM4_GPIO_PFR6_P4                     *((volatile unsigned int*)(0x42DE0310UL))
#define bFM4_GPIO_PFR6_P5                     *((volatile unsigned int*)(0x42DE0314UL))
#define bFM4_GPIO_PFR6_P6                     *((volatile unsigned int*)(0x42DE0318UL))
#define bFM4_GPIO_PFR6_P7                     *((volatile unsigned int*)(0x42DE031CUL))
#define bFM4_GPIO_PFR6_P8                     *((volatile unsigned int*)(0x42DE0320UL))
#define bFM4_GPIO_PFR7_P0                     *((volatile unsigned int*)(0x42DE0380UL))
#define bFM4_GPIO_PFR7_P1                     *((volatile unsigned int*)(0x42DE0384UL))
#define bFM4_GPIO_PFR7_P2                     *((volatile unsigned int*)(0x42DE0388UL))
#define bFM4_GPIO_PFR7_P3                     *((volatile unsigned int*)(0x42DE038CUL))
#define bFM4_GPIO_PFR7_P4                     *((volatile unsigned int*)(0x42DE0390UL))
#define bFM4_GPIO_PFR8_P0                     *((volatile unsigned int*)(0x42DE0400UL))
#define bFM4_GPIO_PFR8_P1                     *((volatile unsigned int*)(0x42DE0404UL))
#define bFM4_GPIO_PFRE_P0                     *((volatile unsigned int*)(0x42DE0700UL))
#define bFM4_GPIO_PFRE_P2                     *((volatile unsigned int*)(0x42DE0708UL))
#define bFM4_GPIO_PFRE_P3                     *((volatile unsigned int*)(0x42DE070CUL))
#define bFM4_GPIO_PCR0_P0                     *((volatile unsigned int*)(0x42DE2000UL))
#define bFM4_GPIO_PCR0_P1                     *((volatile unsigned int*)(0x42DE2004UL))
#define bFM4_GPIO_PCR0_P2                     *((volatile unsigned int*)(0x42DE2008UL))
#define bFM4_GPIO_PCR0_P3                     *((volatile unsigned int*)(0x42DE200CUL))
#define bFM4_GPIO_PCR0_P4                     *((volatile unsigned int*)(0x42DE2010UL))
#define bFM4_GPIO_PCR0_P5                     *((volatile unsigned int*)(0x42DE2014UL))
#define bFM4_GPIO_PCR0_P6                     *((volatile unsigned int*)(0x42DE2018UL))
#define bFM4_GPIO_PCR0_P7                     *((volatile unsigned int*)(0x42DE201CUL))
#define bFM4_GPIO_PCR0_P8                     *((volatile unsigned int*)(0x42DE2020UL))
#define bFM4_GPIO_PCR0_P9                     *((volatile unsigned int*)(0x42DE2024UL))
#define bFM4_GPIO_PCR0_PA                     *((volatile unsigned int*)(0x42DE2028UL))
#define bFM4_GPIO_PCR0_PB                     *((volatile unsigned int*)(0x42DE202CUL))
#define bFM4_GPIO_PCR0_PC                     *((volatile unsigned int*)(0x42DE2030UL))
#define bFM4_GPIO_PCR0_PD                     *((volatile unsigned int*)(0x42DE2034UL))
#define bFM4_GPIO_PCR0_PE                     *((volatile unsigned int*)(0x42DE2038UL))
#define bFM4_GPIO_PCR1_P0                     *((volatile unsigned int*)(0x42DE2080UL))
#define bFM4_GPIO_PCR1_P1                     *((volatile unsigned int*)(0x42DE2084UL))
#define bFM4_GPIO_PCR1_P2                     *((volatile unsigned int*)(0x42DE2088UL))
#define bFM4_GPIO_PCR1_P3                     *((volatile unsigned int*)(0x42DE208CUL))
#define bFM4_GPIO_PCR1_P4                     *((volatile unsigned int*)(0x42DE2090UL))
#define bFM4_GPIO_PCR1_P5                     *((volatile unsigned int*)(0x42DE2094UL))
#define bFM4_GPIO_PCR1_P6                     *((volatile unsigned int*)(0x42DE2098UL))
#define bFM4_GPIO_PCR1_P7                     *((volatile unsigned int*)(0x42DE209CUL))
#define bFM4_GPIO_PCR1_P8                     *((volatile unsigned int*)(0x42DE20A0UL))
#define bFM4_GPIO_PCR1_P9                     *((volatile unsigned int*)(0x42DE20A4UL))
#define bFM4_GPIO_PCR1_PA                     *((volatile unsigned int*)(0x42DE20A8UL))
#define bFM4_GPIO_PCR1_PB                     *((volatile unsigned int*)(0x42DE20ACUL))
#define bFM4_GPIO_PCR1_PC                     *((volatile unsigned int*)(0x42DE20B0UL))
#define bFM4_GPIO_PCR1_PD                     *((volatile unsigned int*)(0x42DE20B4UL))
#define bFM4_GPIO_PCR1_PE                     *((volatile unsigned int*)(0x42DE20B8UL))
#define bFM4_GPIO_PCR1_PF                     *((volatile unsigned int*)(0x42DE20BCUL))
#define bFM4_GPIO_PCR2_P0                     *((volatile unsigned int*)(0x42DE2100UL))
#define bFM4_GPIO_PCR2_P1                     *((volatile unsigned int*)(0x42DE2104UL))
#define bFM4_GPIO_PCR2_P2                     *((volatile unsigned int*)(0x42DE2108UL))
#define bFM4_GPIO_PCR2_P3                     *((volatile unsigned int*)(0x42DE210CUL))
#define bFM4_GPIO_PCR2_P4                     *((volatile unsigned int*)(0x42DE2110UL))
#define bFM4_GPIO_PCR2_P5                     *((volatile unsigned int*)(0x42DE2114UL))
#define bFM4_GPIO_PCR2_P6                     *((volatile unsigned int*)(0x42DE2118UL))
#define bFM4_GPIO_PCR2_P7                     *((volatile unsigned int*)(0x42DE211CUL))
#define bFM4_GPIO_PCR3_P0                     *((volatile unsigned int*)(0x42DE2180UL))
#define bFM4_GPIO_PCR3_P1                     *((volatile unsigned int*)(0x42DE2184UL))
#define bFM4_GPIO_PCR3_P2                     *((volatile unsigned int*)(0x42DE2188UL))
#define bFM4_GPIO_PCR3_P3                     *((volatile unsigned int*)(0x42DE218CUL))
#define bFM4_GPIO_PCR3_P4                     *((volatile unsigned int*)(0x42DE2190UL))
#define bFM4_GPIO_PCR3_P5                     *((volatile unsigned int*)(0x42DE2194UL))
#define bFM4_GPIO_PCR3_P6                     *((volatile unsigned int*)(0x42DE2198UL))
#define bFM4_GPIO_PCR3_P7                     *((volatile unsigned int*)(0x42DE219CUL))
#define bFM4_GPIO_PCR3_P8                     *((volatile unsigned int*)(0x42DE21A0UL))
#define bFM4_GPIO_PCR3_P9                     *((volatile unsigned int*)(0x42DE21A4UL))
#define bFM4_GPIO_PCR3_PA                     *((volatile unsigned int*)(0x42DE21A8UL))
#define bFM4_GPIO_PCR3_PB                     *((volatile unsigned int*)(0x42DE21ACUL))
#define bFM4_GPIO_PCR3_PC                     *((volatile unsigned int*)(0x42DE21B0UL))
#define bFM4_GPIO_PCR3_PD                     *((volatile unsigned int*)(0x42DE21B4UL))
#define bFM4_GPIO_PCR3_PE                     *((volatile unsigned int*)(0x42DE21B8UL))
#define bFM4_GPIO_PCR3_PF                     *((volatile unsigned int*)(0x42DE21BCUL))
#define bFM4_GPIO_PCR4_P0                     *((volatile unsigned int*)(0x42DE2200UL))
#define bFM4_GPIO_PCR4_P1                     *((volatile unsigned int*)(0x42DE2204UL))
#define bFM4_GPIO_PCR4_P2                     *((volatile unsigned int*)(0x42DE2208UL))
#define bFM4_GPIO_PCR4_P3                     *((volatile unsigned int*)(0x42DE220CUL))
#define bFM4_GPIO_PCR4_P4                     *((volatile unsigned int*)(0x42DE2210UL))
#define bFM4_GPIO_PCR4_P5                     *((volatile unsigned int*)(0x42DE2214UL))
#define bFM4_GPIO_PCR4_P6                     *((volatile unsigned int*)(0x42DE2218UL))
#define bFM4_GPIO_PCR4_P7                     *((volatile unsigned int*)(0x42DE221CUL))
#define bFM4_GPIO_PCR4_P8                     *((volatile unsigned int*)(0x42DE2220UL))
#define bFM4_GPIO_PCR4_P9                     *((volatile unsigned int*)(0x42DE2224UL))
#define bFM4_GPIO_PCR4_PA                     *((volatile unsigned int*)(0x42DE2228UL))
#define bFM4_GPIO_PCR4_PB                     *((volatile unsigned int*)(0x42DE222CUL))
#define bFM4_GPIO_PCR4_PC                     *((volatile unsigned int*)(0x42DE2230UL))
#define bFM4_GPIO_PCR4_PD                     *((volatile unsigned int*)(0x42DE2234UL))
#define bFM4_GPIO_PCR4_PE                     *((volatile unsigned int*)(0x42DE2238UL))
#define bFM4_GPIO_PCR5_P0                     *((volatile unsigned int*)(0x42DE2280UL))
#define bFM4_GPIO_PCR5_P1                     *((volatile unsigned int*)(0x42DE2284UL))
#define bFM4_GPIO_PCR5_P2                     *((volatile unsigned int*)(0x42DE2288UL))
#define bFM4_GPIO_PCR5_P3                     *((volatile unsigned int*)(0x42DE228CUL))
#define bFM4_GPIO_PCR5_P4                     *((volatile unsigned int*)(0x42DE2290UL))
#define bFM4_GPIO_PCR5_P5                     *((volatile unsigned int*)(0x42DE2294UL))
#define bFM4_GPIO_PCR5_P6                     *((volatile unsigned int*)(0x42DE2298UL))
#define bFM4_GPIO_PCR5_P7                     *((volatile unsigned int*)(0x42DE229CUL))
#define bFM4_GPIO_PCR5_P8                     *((volatile unsigned int*)(0x42DE22A0UL))
#define bFM4_GPIO_PCR5_P9                     *((volatile unsigned int*)(0x42DE22A4UL))
#define bFM4_GPIO_PCR5_PA                     *((volatile unsigned int*)(0x42DE22A8UL))
#define bFM4_GPIO_PCR5_PB                     *((volatile unsigned int*)(0x42DE22ACUL))
#define bFM4_GPIO_PCR6_P0                     *((volatile unsigned int*)(0x42DE2300UL))
#define bFM4_GPIO_PCR6_P1                     *((volatile unsigned int*)(0x42DE2304UL))
#define bFM4_GPIO_PCR6_P2                     *((volatile unsigned int*)(0x42DE2308UL))
#define bFM4_GPIO_PCR6_P3                     *((volatile unsigned int*)(0x42DE230CUL))
#define bFM4_GPIO_PCR6_P4                     *((volatile unsigned int*)(0x42DE2310UL))
#define bFM4_GPIO_PCR6_P5                     *((volatile unsigned int*)(0x42DE2314UL))
#define bFM4_GPIO_PCR6_P6                     *((volatile unsigned int*)(0x42DE2318UL))
#define bFM4_GPIO_PCR6_P7                     *((volatile unsigned int*)(0x42DE231CUL))
#define bFM4_GPIO_PCR6_P8                     *((volatile unsigned int*)(0x42DE2320UL))
#define bFM4_GPIO_PCR7_P0                     *((volatile unsigned int*)(0x42DE2380UL))
#define bFM4_GPIO_PCR7_P1                     *((volatile unsigned int*)(0x42DE2384UL))
#define bFM4_GPIO_PCR7_P2                     *((volatile unsigned int*)(0x42DE2388UL))
#define bFM4_GPIO_PCR7_P3                     *((volatile unsigned int*)(0x42DE238CUL))
#define bFM4_GPIO_PCR7_P4                     *((volatile unsigned int*)(0x42DE2390UL))
#define bFM4_GPIO_PCR8_P0                     *((volatile unsigned int*)(0x42DE2400UL))
#define bFM4_GPIO_PCR8_P1                     *((volatile unsigned int*)(0x42DE2404UL))
#define bFM4_GPIO_PCRE_P0                     *((volatile unsigned int*)(0x42DE2700UL))
#define bFM4_GPIO_PCRE_P2                     *((volatile unsigned int*)(0x42DE2708UL))
#define bFM4_GPIO_PCRE_P3                     *((volatile unsigned int*)(0x42DE270CUL))
#define bFM4_GPIO_DDR0_P0                     *((volatile unsigned int*)(0x42DE4000UL))
#define bFM4_GPIO_DDR0_P1                     *((volatile unsigned int*)(0x42DE4004UL))
#define bFM4_GPIO_DDR0_P2                     *((volatile unsigned int*)(0x42DE4008UL))
#define bFM4_GPIO_DDR0_P3                     *((volatile unsigned int*)(0x42DE400CUL))
#define bFM4_GPIO_DDR0_P4                     *((volatile unsigned int*)(0x42DE4010UL))
#define bFM4_GPIO_DDR0_P5                     *((volatile unsigned int*)(0x42DE4014UL))
#define bFM4_GPIO_DDR0_P6                     *((volatile unsigned int*)(0x42DE4018UL))
#define bFM4_GPIO_DDR0_P7                     *((volatile unsigned int*)(0x42DE401CUL))
#define bFM4_GPIO_DDR0_P8                     *((volatile unsigned int*)(0x42DE4020UL))
#define bFM4_GPIO_DDR0_P9                     *((volatile unsigned int*)(0x42DE4024UL))
#define bFM4_GPIO_DDR0_PA                     *((volatile unsigned int*)(0x42DE4028UL))
#define bFM4_GPIO_DDR0_PB                     *((volatile unsigned int*)(0x42DE402CUL))
#define bFM4_GPIO_DDR0_PC                     *((volatile unsigned int*)(0x42DE4030UL))
#define bFM4_GPIO_DDR0_PD                     *((volatile unsigned int*)(0x42DE4034UL))
#define bFM4_GPIO_DDR0_PE                     *((volatile unsigned int*)(0x42DE4038UL))
#define bFM4_GPIO_DDR0_PF                     *((volatile unsigned int*)(0x42DE403CUL))
#define bFM4_GPIO_DDR1_P0                     *((volatile unsigned int*)(0x42DE4080UL))
#define bFM4_GPIO_DDR1_P1                     *((volatile unsigned int*)(0x42DE4084UL))
#define bFM4_GPIO_DDR1_P2                     *((volatile unsigned int*)(0x42DE4088UL))
#define bFM4_GPIO_DDR1_P3                     *((volatile unsigned int*)(0x42DE408CUL))
#define bFM4_GPIO_DDR1_P4                     *((volatile unsigned int*)(0x42DE4090UL))
#define bFM4_GPIO_DDR1_P5                     *((volatile unsigned int*)(0x42DE4094UL))
#define bFM4_GPIO_DDR1_P6                     *((volatile unsigned int*)(0x42DE4098UL))
#define bFM4_GPIO_DDR1_P7                     *((volatile unsigned int*)(0x42DE409CUL))
#define bFM4_GPIO_DDR1_P8                     *((volatile unsigned int*)(0x42DE40A0UL))
#define bFM4_GPIO_DDR1_P9                     *((volatile unsigned int*)(0x42DE40A4UL))
#define bFM4_GPIO_DDR1_PA                     *((volatile unsigned int*)(0x42DE40A8UL))
#define bFM4_GPIO_DDR1_PB                     *((volatile unsigned int*)(0x42DE40ACUL))
#define bFM4_GPIO_DDR1_PC                     *((volatile unsigned int*)(0x42DE40B0UL))
#define bFM4_GPIO_DDR1_PD                     *((volatile unsigned int*)(0x42DE40B4UL))
#define bFM4_GPIO_DDR1_PE                     *((volatile unsigned int*)(0x42DE40B8UL))
#define bFM4_GPIO_DDR1_PF                     *((volatile unsigned int*)(0x42DE40BCUL))
#define bFM4_GPIO_DDR2_P0                     *((volatile unsigned int*)(0x42DE4100UL))
#define bFM4_GPIO_DDR2_P1                     *((volatile unsigned int*)(0x42DE4104UL))
#define bFM4_GPIO_DDR2_P2                     *((volatile unsigned int*)(0x42DE4108UL))
#define bFM4_GPIO_DDR2_P3                     *((volatile unsigned int*)(0x42DE410CUL))
#define bFM4_GPIO_DDR2_P4                     *((volatile unsigned int*)(0x42DE4110UL))
#define bFM4_GPIO_DDR2_P5                     *((volatile unsigned int*)(0x42DE4114UL))
#define bFM4_GPIO_DDR2_P6                     *((volatile unsigned int*)(0x42DE4118UL))
#define bFM4_GPIO_DDR2_P7                     *((volatile unsigned int*)(0x42DE411CUL))
#define bFM4_GPIO_DDR3_P0                     *((volatile unsigned int*)(0x42DE4180UL))
#define bFM4_GPIO_DDR3_P1                     *((volatile unsigned int*)(0x42DE4184UL))
#define bFM4_GPIO_DDR3_P2                     *((volatile unsigned int*)(0x42DE4188UL))
#define bFM4_GPIO_DDR3_P3                     *((volatile unsigned int*)(0x42DE418CUL))
#define bFM4_GPIO_DDR3_P4                     *((volatile unsigned int*)(0x42DE4190UL))
#define bFM4_GPIO_DDR3_P5                     *((volatile unsigned int*)(0x42DE4194UL))
#define bFM4_GPIO_DDR3_P6                     *((volatile unsigned int*)(0x42DE4198UL))
#define bFM4_GPIO_DDR3_P7                     *((volatile unsigned int*)(0x42DE419CUL))
#define bFM4_GPIO_DDR3_P8                     *((volatile unsigned int*)(0x42DE41A0UL))
#define bFM4_GPIO_DDR3_P9                     *((volatile unsigned int*)(0x42DE41A4UL))
#define bFM4_GPIO_DDR3_PA                     *((volatile unsigned int*)(0x42DE41A8UL))
#define bFM4_GPIO_DDR3_PB                     *((volatile unsigned int*)(0x42DE41ACUL))
#define bFM4_GPIO_DDR3_PC                     *((volatile unsigned int*)(0x42DE41B0UL))
#define bFM4_GPIO_DDR3_PD                     *((volatile unsigned int*)(0x42DE41B4UL))
#define bFM4_GPIO_DDR3_PE                     *((volatile unsigned int*)(0x42DE41B8UL))
#define bFM4_GPIO_DDR3_PF                     *((volatile unsigned int*)(0x42DE41BCUL))
#define bFM4_GPIO_DDR4_P0                     *((volatile unsigned int*)(0x42DE4200UL))
#define bFM4_GPIO_DDR4_P1                     *((volatile unsigned int*)(0x42DE4204UL))
#define bFM4_GPIO_DDR4_P2                     *((volatile unsigned int*)(0x42DE4208UL))
#define bFM4_GPIO_DDR4_P3                     *((volatile unsigned int*)(0x42DE420CUL))
#define bFM4_GPIO_DDR4_P4                     *((volatile unsigned int*)(0x42DE4210UL))
#define bFM4_GPIO_DDR4_P5                     *((volatile unsigned int*)(0x42DE4214UL))
#define bFM4_GPIO_DDR4_P6                     *((volatile unsigned int*)(0x42DE4218UL))
#define bFM4_GPIO_DDR4_P7                     *((volatile unsigned int*)(0x42DE421CUL))
#define bFM4_GPIO_DDR4_P8                     *((volatile unsigned int*)(0x42DE4220UL))
#define bFM4_GPIO_DDR4_P9                     *((volatile unsigned int*)(0x42DE4224UL))
#define bFM4_GPIO_DDR4_PA                     *((volatile unsigned int*)(0x42DE4228UL))
