marcel-galliker/Mouvent-PrintEngine/rx_balance_ctrl/common/mb9b160l.h
#define bFM4_GPIO_DDR4_PB                     *((volatile unsigned int*)(0x42DE422CUL))
#define bFM4_GPIO_DDR4_PC                     *((volatile unsigned int*)(0x42DE4230UL))
#define bFM4_GPIO_DDR4_PD                     *((volatile unsigned int*)(0x42DE4234UL))
#define bFM4_GPIO_DDR4_PE                     *((volatile unsigned int*)(0x42DE4238UL))
#define bFM4_GPIO_DDR5_P0                     *((volatile unsigned int*)(0x42DE4280UL))
#define bFM4_GPIO_DDR5_P1                     *((volatile unsigned int*)(0x42DE4284UL))
#define bFM4_GPIO_DDR5_P2                     *((volatile unsigned int*)(0x42DE4288UL))
#define bFM4_GPIO_DDR5_P3                     *((volatile unsigned int*)(0x42DE428CUL))
#define bFM4_GPIO_DDR5_P4                     *((volatile unsigned int*)(0x42DE4290UL))
#define bFM4_GPIO_DDR5_P5                     *((volatile unsigned int*)(0x42DE4294UL))
#define bFM4_GPIO_DDR5_P6                     *((volatile unsigned int*)(0x42DE4298UL))
#define bFM4_GPIO_DDR5_P7                     *((volatile unsigned int*)(0x42DE429CUL))
#define bFM4_GPIO_DDR5_P8                     *((volatile unsigned int*)(0x42DE42A0UL))
#define bFM4_GPIO_DDR5_P9                     *((volatile unsigned int*)(0x42DE42A4UL))
#define bFM4_GPIO_DDR5_PA                     *((volatile unsigned int*)(0x42DE42A8UL))
#define bFM4_GPIO_DDR5_PB                     *((volatile unsigned int*)(0x42DE42ACUL))
#define bFM4_GPIO_DDR6_P0                     *((volatile unsigned int*)(0x42DE4300UL))
#define bFM4_GPIO_DDR6_P1                     *((volatile unsigned int*)(0x42DE4304UL))
#define bFM4_GPIO_DDR6_P2                     *((volatile unsigned int*)(0x42DE4308UL))
#define bFM4_GPIO_DDR6_P3                     *((volatile unsigned int*)(0x42DE430CUL))
#define bFM4_GPIO_DDR6_P4                     *((volatile unsigned int*)(0x42DE4310UL))
#define bFM4_GPIO_DDR6_P5                     *((volatile unsigned int*)(0x42DE4314UL))
#define bFM4_GPIO_DDR6_P6                     *((volatile unsigned int*)(0x42DE4318UL))
#define bFM4_GPIO_DDR6_P7                     *((volatile unsigned int*)(0x42DE431CUL))
#define bFM4_GPIO_DDR6_P8                     *((volatile unsigned int*)(0x42DE4320UL))
#define bFM4_GPIO_DDR7_P0                     *((volatile unsigned int*)(0x42DE4380UL))
#define bFM4_GPIO_DDR7_P1                     *((volatile unsigned int*)(0x42DE4384UL))
#define bFM4_GPIO_DDR7_P2                     *((volatile unsigned int*)(0x42DE4388UL))
#define bFM4_GPIO_DDR7_P3                     *((volatile unsigned int*)(0x42DE438CUL))
#define bFM4_GPIO_DDR7_P4                     *((volatile unsigned int*)(0x42DE4390UL))
#define bFM4_GPIO_DDR8_P0                     *((volatile unsigned int*)(0x42DE4400UL))
#define bFM4_GPIO_DDR8_P1                     *((volatile unsigned int*)(0x42DE4404UL))
#define bFM4_GPIO_DDRE_P0                     *((volatile unsigned int*)(0x42DE4700UL))
#define bFM4_GPIO_DDRE_P2                     *((volatile unsigned int*)(0x42DE4708UL))
#define bFM4_GPIO_DDRE_P3                     *((volatile unsigned int*)(0x42DE470CUL))
#define bFM4_GPIO_PDIR0_P0                    *((volatile unsigned int*)(0x42DE6000UL))
#define bFM4_GPIO_PDIR0_P1                    *((volatile unsigned int*)(0x42DE6004UL))
#define bFM4_GPIO_PDIR0_P2                    *((volatile unsigned int*)(0x42DE6008UL))
#define bFM4_GPIO_PDIR0_P3                    *((volatile unsigned int*)(0x42DE600CUL))
#define bFM4_GPIO_PDIR0_P4                    *((volatile unsigned int*)(0x42DE6010UL))
#define bFM4_GPIO_PDIR0_P5                    *((volatile unsigned int*)(0x42DE6014UL))
#define bFM4_GPIO_PDIR0_P6                    *((volatile unsigned int*)(0x42DE6018UL))
#define bFM4_GPIO_PDIR0_P7                    *((volatile unsigned int*)(0x42DE601CUL))
#define bFM4_GPIO_PDIR0_P8                    *((volatile unsigned int*)(0x42DE6020UL))
#define bFM4_GPIO_PDIR0_P9                    *((volatile unsigned int*)(0x42DE6024UL))
#define bFM4_GPIO_PDIR0_PA                    *((volatile unsigned int*)(0x42DE6028UL))
#define bFM4_GPIO_PDIR0_PB                    *((volatile unsigned int*)(0x42DE602CUL))
#define bFM4_GPIO_PDIR0_PC                    *((volatile unsigned int*)(0x42DE6030UL))
#define bFM4_GPIO_PDIR0_PD                    *((volatile unsigned int*)(0x42DE6034UL))
#define bFM4_GPIO_PDIR0_PE                    *((volatile unsigned int*)(0x42DE6038UL))
#define bFM4_GPIO_PDIR0_PF                    *((volatile unsigned int*)(0x42DE603CUL))
#define bFM4_GPIO_PDIR1_P0                    *((volatile unsigned int*)(0x42DE6080UL))
#define bFM4_GPIO_PDIR1_P1                    *((volatile unsigned int*)(0x42DE6084UL))
#define bFM4_GPIO_PDIR1_P2                    *((volatile unsigned int*)(0x42DE6088UL))
#define bFM4_GPIO_PDIR1_P3                    *((volatile unsigned int*)(0x42DE608CUL))
#define bFM4_GPIO_PDIR1_P4                    *((volatile unsigned int*)(0x42DE6090UL))
#define bFM4_GPIO_PDIR1_P5                    *((volatile unsigned int*)(0x42DE6094UL))
#define bFM4_GPIO_PDIR1_P6                    *((volatile unsigned int*)(0x42DE6098UL))
#define bFM4_GPIO_PDIR1_P7                    *((volatile unsigned int*)(0x42DE609CUL))
#define bFM4_GPIO_PDIR1_P8                    *((volatile unsigned int*)(0x42DE60A0UL))
#define bFM4_GPIO_PDIR1_P9                    *((volatile unsigned int*)(0x42DE60A4UL))
#define bFM4_GPIO_PDIR1_PA                    *((volatile unsigned int*)(0x42DE60A8UL))
#define bFM4_GPIO_PDIR1_PB                    *((volatile unsigned int*)(0x42DE60ACUL))
#define bFM4_GPIO_PDIR1_PC                    *((volatile unsigned int*)(0x42DE60B0UL))
#define bFM4_GPIO_PDIR1_PD                    *((volatile unsigned int*)(0x42DE60B4UL))
#define bFM4_GPIO_PDIR1_PE                    *((volatile unsigned int*)(0x42DE60B8UL))
#define bFM4_GPIO_PDIR1_PF                    *((volatile unsigned int*)(0x42DE60BCUL))
#define bFM4_GPIO_PDIR2_P0                    *((volatile unsigned int*)(0x42DE6100UL))
#define bFM4_GPIO_PDIR2_P1                    *((volatile unsigned int*)(0x42DE6104UL))
#define bFM4_GPIO_PDIR2_P2                    *((volatile unsigned int*)(0x42DE6108UL))
#define bFM4_GPIO_PDIR2_P3                    *((volatile unsigned int*)(0x42DE610CUL))
#define bFM4_GPIO_PDIR2_P4                    *((volatile unsigned int*)(0x42DE6110UL))
#define bFM4_GPIO_PDIR2_P5                    *((volatile unsigned int*)(0x42DE6114UL))
#define bFM4_GPIO_PDIR2_P6                    *((volatile unsigned int*)(0x42DE6118UL))
#define bFM4_GPIO_PDIR2_P7                    *((volatile unsigned int*)(0x42DE611CUL))
#define bFM4_GPIO_PDIR3_P0                    *((volatile unsigned int*)(0x42DE6180UL))
#define bFM4_GPIO_PDIR3_P1                    *((volatile unsigned int*)(0x42DE6184UL))
#define bFM4_GPIO_PDIR3_P2                    *((volatile unsigned int*)(0x42DE6188UL))
#define bFM4_GPIO_PDIR3_P3                    *((volatile unsigned int*)(0x42DE618CUL))
#define bFM4_GPIO_PDIR3_P4                    *((volatile unsigned int*)(0x42DE6190UL))
#define bFM4_GPIO_PDIR3_P5                    *((volatile unsigned int*)(0x42DE6194UL))
#define bFM4_GPIO_PDIR3_P6                    *((volatile unsigned int*)(0x42DE6198UL))
#define bFM4_GPIO_PDIR3_P7                    *((volatile unsigned int*)(0x42DE619CUL))
#define bFM4_GPIO_PDIR3_P8                    *((volatile unsigned int*)(0x42DE61A0UL))
#define bFM4_GPIO_PDIR3_P9                    *((volatile unsigned int*)(0x42DE61A4UL))
#define bFM4_GPIO_PDIR3_PA                    *((volatile unsigned int*)(0x42DE61A8UL))
#define bFM4_GPIO_PDIR3_PB                    *((volatile unsigned int*)(0x42DE61ACUL))
#define bFM4_GPIO_PDIR3_PC                    *((volatile unsigned int*)(0x42DE61B0UL))
#define bFM4_GPIO_PDIR3_PD                    *((volatile unsigned int*)(0x42DE61B4UL))
#define bFM4_GPIO_PDIR3_PE                    *((volatile unsigned int*)(0x42DE61B8UL))
#define bFM4_GPIO_PDIR3_PF                    *((volatile unsigned int*)(0x42DE61BCUL))
#define bFM4_GPIO_PDIR4_P0                    *((volatile unsigned int*)(0x42DE6200UL))
#define bFM4_GPIO_PDIR4_P1                    *((volatile unsigned int*)(0x42DE6204UL))
#define bFM4_GPIO_PDIR4_P2                    *((volatile unsigned int*)(0x42DE6208UL))
#define bFM4_GPIO_PDIR4_P3                    *((volatile unsigned int*)(0x42DE620CUL))
#define bFM4_GPIO_PDIR4_P4                    *((volatile unsigned int*)(0x42DE6210UL))
#define bFM4_GPIO_PDIR4_P5                    *((volatile unsigned int*)(0x42DE6214UL))
#define bFM4_GPIO_PDIR4_P6                    *((volatile unsigned int*)(0x42DE6218UL))
#define bFM4_GPIO_PDIR4_P7                    *((volatile unsigned int*)(0x42DE621CUL))
#define bFM4_GPIO_PDIR4_P8                    *((volatile unsigned int*)(0x42DE6220UL))
#define bFM4_GPIO_PDIR4_P9                    *((volatile unsigned int*)(0x42DE6224UL))
#define bFM4_GPIO_PDIR4_PA                    *((volatile unsigned int*)(0x42DE6228UL))
#define bFM4_GPIO_PDIR4_PB                    *((volatile unsigned int*)(0x42DE622CUL))
#define bFM4_GPIO_PDIR4_PC                    *((volatile unsigned int*)(0x42DE6230UL))
#define bFM4_GPIO_PDIR4_PD                    *((volatile unsigned int*)(0x42DE6234UL))
#define bFM4_GPIO_PDIR4_PE                    *((volatile unsigned int*)(0x42DE6238UL))
#define bFM4_GPIO_PDIR5_P0                    *((volatile unsigned int*)(0x42DE6280UL))
#define bFM4_GPIO_PDIR5_P1                    *((volatile unsigned int*)(0x42DE6284UL))
#define bFM4_GPIO_PDIR5_P2                    *((volatile unsigned int*)(0x42DE6288UL))
#define bFM4_GPIO_PDIR5_P3                    *((volatile unsigned int*)(0x42DE628CUL))
#define bFM4_GPIO_PDIR5_P4                    *((volatile unsigned int*)(0x42DE6290UL))
#define bFM4_GPIO_PDIR5_P5                    *((volatile unsigned int*)(0x42DE6294UL))
#define bFM4_GPIO_PDIR5_P6                    *((volatile unsigned int*)(0x42DE6298UL))
#define bFM4_GPIO_PDIR5_P7                    *((volatile unsigned int*)(0x42DE629CUL))
#define bFM4_GPIO_PDIR5_P8                    *((volatile unsigned int*)(0x42DE62A0UL))
#define bFM4_GPIO_PDIR5_P9                    *((volatile unsigned int*)(0x42DE62A4UL))
#define bFM4_GPIO_PDIR5_PA                    *((volatile unsigned int*)(0x42DE62A8UL))
#define bFM4_GPIO_PDIR5_PB                    *((volatile unsigned int*)(0x42DE62ACUL))
#define bFM4_GPIO_PDIR6_P0                    *((volatile unsigned int*)(0x42DE6300UL))
#define bFM4_GPIO_PDIR6_P1                    *((volatile unsigned int*)(0x42DE6304UL))
#define bFM4_GPIO_PDIR6_P2                    *((volatile unsigned int*)(0x42DE6308UL))
#define bFM4_GPIO_PDIR6_P3                    *((volatile unsigned int*)(0x42DE630CUL))
#define bFM4_GPIO_PDIR6_P4                    *((volatile unsigned int*)(0x42DE6310UL))
#define bFM4_GPIO_PDIR6_P5                    *((volatile unsigned int*)(0x42DE6314UL))
#define bFM4_GPIO_PDIR6_P6                    *((volatile unsigned int*)(0x42DE6318UL))
#define bFM4_GPIO_PDIR6_P7                    *((volatile unsigned int*)(0x42DE631CUL))
#define bFM4_GPIO_PDIR6_P8                    *((volatile unsigned int*)(0x42DE6320UL))
#define bFM4_GPIO_PDIR7_P0                    *((volatile unsigned int*)(0x42DE6380UL))
#define bFM4_GPIO_PDIR7_P1                    *((volatile unsigned int*)(0x42DE6384UL))
#define bFM4_GPIO_PDIR7_P2                    *((volatile unsigned int*)(0x42DE6388UL))
#define bFM4_GPIO_PDIR7_P3                    *((volatile unsigned int*)(0x42DE638CUL))
#define bFM4_GPIO_PDIR7_P4                    *((volatile unsigned int*)(0x42DE6390UL))
#define bFM4_GPIO_PDIR8_P0                    *((volatile unsigned int*)(0x42DE6400UL))
#define bFM4_GPIO_PDIR8_P1                    *((volatile unsigned int*)(0x42DE6404UL))
#define bFM4_GPIO_PDIRE_P0                    *((volatile unsigned int*)(0x42DE6700UL))
#define bFM4_GPIO_PDIRE_P2                    *((volatile unsigned int*)(0x42DE6708UL))
#define bFM4_GPIO_PDIRE_P3                    *((volatile unsigned int*)(0x42DE670CUL))
#define bFM4_GPIO_PDOR0_P0                    *((volatile unsigned int*)(0x42DE8000UL))
#define bFM4_GPIO_PDOR0_P1                    *((volatile unsigned int*)(0x42DE8004UL))
#define bFM4_GPIO_PDOR0_P2                    *((volatile unsigned int*)(0x42DE8008UL))
#define bFM4_GPIO_PDOR0_P3                    *((volatile unsigned int*)(0x42DE800CUL))
#define bFM4_GPIO_PDOR0_P4                    *((volatile unsigned int*)(0x42DE8010UL))
#define bFM4_GPIO_PDOR0_P5                    *((volatile unsigned int*)(0x42DE8014UL))
#define bFM4_GPIO_PDOR0_P6                    *((volatile unsigned int*)(0x42DE8018UL))
#define bFM4_GPIO_PDOR0_P7                    *((volatile unsigned int*)(0x42DE801CUL))
#define bFM4_GPIO_PDOR0_P8                    *((volatile unsigned int*)(0x42DE8020UL))
#define bFM4_GPIO_PDOR0_P9                    *((volatile unsigned int*)(0x42DE8024UL))
#define bFM4_GPIO_PDOR0_PA                    *((volatile unsigned int*)(0x42DE8028UL))
#define bFM4_GPIO_PDOR0_PB                    *((volatile unsigned int*)(0x42DE802CUL))
#define bFM4_GPIO_PDOR0_PC                    *((volatile unsigned int*)(0x42DE8030UL))
#define bFM4_GPIO_PDOR0_PD                    *((volatile unsigned int*)(0x42DE8034UL))
#define bFM4_GPIO_PDOR0_PE                    *((volatile unsigned int*)(0x42DE8038UL))
#define bFM4_GPIO_PDOR0_PF                    *((volatile unsigned int*)(0x42DE803CUL))
#define bFM4_GPIO_PDOR1_P0                    *((volatile unsigned int*)(0x42DE8080UL))
#define bFM4_GPIO_PDOR1_P1                    *((volatile unsigned int*)(0x42DE8084UL))
#define bFM4_GPIO_PDOR1_P2                    *((volatile unsigned int*)(0x42DE8088UL))
#define bFM4_GPIO_PDOR1_P3                    *((volatile unsigned int*)(0x42DE808CUL))
#define bFM4_GPIO_PDOR1_P4                    *((volatile unsigned int*)(0x42DE8090UL))
#define bFM4_GPIO_PDOR1_P5                    *((volatile unsigned int*)(0x42DE8094UL))
#define bFM4_GPIO_PDOR1_P6                    *((volatile unsigned int*)(0x42DE8098UL))
#define bFM4_GPIO_PDOR1_P7                    *((volatile unsigned int*)(0x42DE809CUL))
#define bFM4_GPIO_PDOR1_P8                    *((volatile unsigned int*)(0x42DE80A0UL))
#define bFM4_GPIO_PDOR1_P9                    *((volatile unsigned int*)(0x42DE80A4UL))
#define bFM4_GPIO_PDOR1_PA                    *((volatile unsigned int*)(0x42DE80A8UL))
#define bFM4_GPIO_PDOR1_PB                    *((volatile unsigned int*)(0x42DE80ACUL))
#define bFM4_GPIO_PDOR1_PC                    *((volatile unsigned int*)(0x42DE80B0UL))
#define bFM4_GPIO_PDOR1_PD                    *((volatile unsigned int*)(0x42DE80B4UL))
#define bFM4_GPIO_PDOR1_PE                    *((volatile unsigned int*)(0x42DE80B8UL))
#define bFM4_GPIO_PDOR1_PF                    *((volatile unsigned int*)(0x42DE80BCUL))
#define bFM4_GPIO_PDOR2_P0                    *((volatile unsigned int*)(0x42DE8100UL))
#define bFM4_GPIO_PDOR2_P1                    *((volatile unsigned int*)(0x42DE8104UL))
#define bFM4_GPIO_PDOR2_P2                    *((volatile unsigned int*)(0x42DE8108UL))
#define bFM4_GPIO_PDOR2_P3                    *((volatile unsigned int*)(0x42DE810CUL))
#define bFM4_GPIO_PDOR2_P4                    *((volatile unsigned int*)(0x42DE8110UL))
#define bFM4_GPIO_PDOR2_P5                    *((volatile unsigned int*)(0x42DE8114UL))
#define bFM4_GPIO_PDOR2_P6                    *((volatile unsigned int*)(0x42DE8118UL))
#define bFM4_GPIO_PDOR2_P7                    *((volatile unsigned int*)(0x42DE811CUL))
#define bFM4_GPIO_PDOR3_P0                    *((volatile unsigned int*)(0x42DE8180UL))
#define bFM4_GPIO_PDOR3_P1                    *((volatile unsigned int*)(0x42DE8184UL))
#define bFM4_GPIO_PDOR3_P2                    *((volatile unsigned int*)(0x42DE8188UL))
#define bFM4_GPIO_PDOR3_P3                    *((volatile unsigned int*)(0x42DE818CUL))
#define bFM4_GPIO_PDOR3_P4                    *((volatile unsigned int*)(0x42DE8190UL))
#define bFM4_GPIO_PDOR3_P5                    *((volatile unsigned int*)(0x42DE8194UL))
#define bFM4_GPIO_PDOR3_P6                    *((volatile unsigned int*)(0x42DE8198UL))
#define bFM4_GPIO_PDOR3_P7                    *((volatile unsigned int*)(0x42DE819CUL))
#define bFM4_GPIO_PDOR3_P8                    *((volatile unsigned int*)(0x42DE81A0UL))
#define bFM4_GPIO_PDOR3_P9                    *((volatile unsigned int*)(0x42DE81A4UL))
#define bFM4_GPIO_PDOR3_PA                    *((volatile unsigned int*)(0x42DE81A8UL))
#define bFM4_GPIO_PDOR3_PB                    *((volatile unsigned int*)(0x42DE81ACUL))
#define bFM4_GPIO_PDOR3_PC                    *((volatile unsigned int*)(0x42DE81B0UL))
#define bFM4_GPIO_PDOR3_PD                    *((volatile unsigned int*)(0x42DE81B4UL))
#define bFM4_GPIO_PDOR3_PE                    *((volatile unsigned int*)(0x42DE81B8UL))
#define bFM4_GPIO_PDOR3_PF                    *((volatile unsigned int*)(0x42DE81BCUL))
#define bFM4_GPIO_PDOR4_P0                    *((volatile unsigned int*)(0x42DE8200UL))
#define bFM4_GPIO_PDOR4_P1                    *((volatile unsigned int*)(0x42DE8204UL))
#define bFM4_GPIO_PDOR4_P2                    *((volatile unsigned int*)(0x42DE8208UL))
#define bFM4_GPIO_PDOR4_P3                    *((volatile unsigned int*)(0x42DE820CUL))
#define bFM4_GPIO_PDOR4_P4                    *((volatile unsigned int*)(0x42DE8210UL))
#define bFM4_GPIO_PDOR4_P5                    *((volatile unsigned int*)(0x42DE8214UL))
#define bFM4_GPIO_PDOR4_P6                    *((volatile unsigned int*)(0x42DE8218UL))
#define bFM4_GPIO_PDOR4_P7                    *((volatile unsigned int*)(0x42DE821CUL))
#define bFM4_GPIO_PDOR4_P8                    *((volatile unsigned int*)(0x42DE8220UL))
#define bFM4_GPIO_PDOR4_P9                    *((volatile unsigned int*)(0x42DE8224UL))
#define bFM4_GPIO_PDOR4_PA                    *((volatile unsigned int*)(0x42DE8228UL))
#define bFM4_GPIO_PDOR4_PB                    *((volatile unsigned int*)(0x42DE822CUL))
#define bFM4_GPIO_PDOR4_PC                    *((volatile unsigned int*)(0x42DE8230UL))
#define bFM4_GPIO_PDOR4_PD                    *((volatile unsigned int*)(0x42DE8234UL))
#define bFM4_GPIO_PDOR4_PE                    *((volatile unsigned int*)(0x42DE8238UL))
#define bFM4_GPIO_PDOR5_P0                    *((volatile unsigned int*)(0x42DE8280UL))
#define bFM4_GPIO_PDOR5_P1                    *((volatile unsigned int*)(0x42DE8284UL))
#define bFM4_GPIO_PDOR5_P2                    *((volatile unsigned int*)(0x42DE8288UL))
#define bFM4_GPIO_PDOR5_P3                    *((volatile unsigned int*)(0x42DE828CUL))
#define bFM4_GPIO_PDOR5_P4                    *((volatile unsigned int*)(0x42DE8290UL))
#define bFM4_GPIO_PDOR5_P5                    *((volatile unsigned int*)(0x42DE8294UL))
#define bFM4_GPIO_PDOR5_P6                    *((volatile unsigned int*)(0x42DE8298UL))
#define bFM4_GPIO_PDOR5_P7                    *((volatile unsigned int*)(0x42DE829CUL))
#define bFM4_GPIO_PDOR5_P8                    *((volatile unsigned int*)(0x42DE82A0UL))
#define bFM4_GPIO_PDOR5_P9                    *((volatile unsigned int*)(0x42DE82A4UL))
#define bFM4_GPIO_PDOR5_PA                    *((volatile unsigned int*)(0x42DE82A8UL))
#define bFM4_GPIO_PDOR5_PB                    *((volatile unsigned int*)(0x42DE82ACUL))
#define bFM4_GPIO_PDOR6_P0                    *((volatile unsigned int*)(0x42DE8300UL))
#define bFM4_GPIO_PDOR6_P1                    *((volatile unsigned int*)(0x42DE8304UL))
#define bFM4_GPIO_PDOR6_P2                    *((volatile unsigned int*)(0x42DE8308UL))
#define bFM4_GPIO_PDOR6_P3                    *((volatile unsigned int*)(0x42DE830CUL))
#define bFM4_GPIO_PDOR6_P4                    *((volatile unsigned int*)(0x42DE8310UL))
#define bFM4_GPIO_PDOR6_P5                    *((volatile unsigned int*)(0x42DE8314UL))
#define bFM4_GPIO_PDOR6_P6                    *((volatile unsigned int*)(0x42DE8318UL))
#define bFM4_GPIO_PDOR6_P7                    *((volatile unsigned int*)(0x42DE831CUL))
#define bFM4_GPIO_PDOR6_P8                    *((volatile unsigned int*)(0x42DE8320UL))
#define bFM4_GPIO_PDOR7_P0                    *((volatile unsigned int*)(0x42DE8380UL))
#define bFM4_GPIO_PDOR7_P1                    *((volatile unsigned int*)(0x42DE8384UL))
#define bFM4_GPIO_PDOR7_P2                    *((volatile unsigned int*)(0x42DE8388UL))
#define bFM4_GPIO_PDOR7_P3                    *((volatile unsigned int*)(0x42DE838CUL))
#define bFM4_GPIO_PDOR7_P4                    *((volatile unsigned int*)(0x42DE8390UL))
#define bFM4_GPIO_PDOR8_P0                    *((volatile unsigned int*)(0x42DE8400UL))
#define bFM4_GPIO_PDOR8_P1                    *((volatile unsigned int*)(0x42DE8404UL))
#define bFM4_GPIO_PDORE_P0                    *((volatile unsigned int*)(0x42DE8700UL))
#define bFM4_GPIO_PDORE_P2                    *((volatile unsigned int*)(0x42DE8708UL))
#define bFM4_GPIO_PDORE_P3                    *((volatile unsigned int*)(0x42DE870CUL))
#define bFM4_GPIO_ADE_AN00                     *((volatile unsigned int*)(0x42DEA000UL))
#define bFM4_GPIO_ADE_AN01                     *((volatile unsigned int*)(0x42DEA004UL))
#define bFM4_GPIO_ADE_AN02                     *((volatile unsigned int*)(0x42DEA008UL))
#define bFM4_GPIO_ADE_AN03                     *((volatile unsigned int*)(0x42DEA00CUL))
#define bFM4_GPIO_ADE_AN04                     *((volatile unsigned int*)(0x42DEA010UL))
#define bFM4_GPIO_ADE_AN05                     *((volatile unsigned int*)(0x42DEA014UL))
#define bFM4_GPIO_ADE_AN06                     *((volatile unsigned int*)(0x42DEA018UL))
#define bFM4_GPIO_ADE_AN07                     *((volatile unsigned int*)(0x42DEA01CUL))
#define bFM4_GPIO_ADE_AN08                     *((volatile unsigned int*)(0x42DEA020UL))
#define bFM4_GPIO_ADE_AN09                     *((volatile unsigned int*)(0x42DEA024UL))
#define bFM4_GPIO_ADE_AN10                     *((volatile unsigned int*)(0x42DEA028UL))
#define bFM4_GPIO_ADE_AN11                     *((volatile unsigned int*)(0x42DEA02CUL))
#define bFM4_GPIO_ADE_AN12                     *((volatile unsigned int*)(0x42DEA030UL))
#define bFM4_GPIO_ADE_AN13                     *((volatile unsigned int*)(0x42DEA034UL))
#define bFM4_GPIO_ADE_AN14                     *((volatile unsigned int*)(0x42DEA038UL))
#define bFM4_GPIO_ADE_AN15                     *((volatile unsigned int*)(0x42DEA03CUL))
#define bFM4_GPIO_ADE_AN16                     *((volatile unsigned int*)(0x42DEA040UL))
#define bFM4_GPIO_ADE_AN17                     *((volatile unsigned int*)(0x42DEA044UL))
#define bFM4_GPIO_ADE_AN18                     *((volatile unsigned int*)(0x42DEA048UL))
#define bFM4_GPIO_ADE_AN19                     *((volatile unsigned int*)(0x42DEA04CUL))
#define bFM4_GPIO_ADE_AN20                     *((volatile unsigned int*)(0x42DEA050UL))
#define bFM4_GPIO_ADE_AN21                     *((volatile unsigned int*)(0x42DEA054UL))
#define bFM4_GPIO_ADE_AN22                     *((volatile unsigned int*)(0x42DEA058UL))
#define bFM4_GPIO_ADE_AN23                     *((volatile unsigned int*)(0x42DEA05CUL))
#define bFM4_GPIO_ADE_AN24                     *((volatile unsigned int*)(0x42DEA060UL))
#define bFM4_GPIO_ADE_AN25                     *((volatile unsigned int*)(0x42DEA064UL))
#define bFM4_GPIO_ADE_AN26                     *((volatile unsigned int*)(0x42DEA068UL))
#define bFM4_GPIO_ADE_AN27                     *((volatile unsigned int*)(0x42DEA02CUL))
#define bFM4_GPIO_ADE_AN28                     *((volatile unsigned int*)(0x42DEA070UL))
#define bFM4_GPIO_ADE_AN29                     *((volatile unsigned int*)(0x42DEA074UL))
