marcel-galliker/Mouvent-PrintEngine/rx_balance_ctrl/common/mb9b160l.h
#define bFM4_GPIO_ADE_AN30                     *((volatile unsigned int*)(0x42DEA078UL))
#define bFM4_GPIO_ADE_AN31                     *((volatile unsigned int*)(0x42DEA07CUL))
#define bFM4_GPIO_SPSR_MAINXC0                 *((volatile unsigned int*)(0x42DEB008UL))
#define bFM4_GPIO_SPSR_MAINXC1                 *((volatile unsigned int*)(0x42DEB00CUL))
#define bFM4_GPIO_SPSR_USB0C                   *((volatile unsigned int*)(0x42DEB010UL))
#define bFM4_GPIO_SPSR_USB1C                   *((volatile unsigned int*)(0x42DEB014UL))
#define bFM4_GPIO_EPFR00_NMIS                  *((volatile unsigned int*)(0x42DEC000UL))
#define bFM4_GPIO_EPFR00_CROUTE0               *((volatile unsigned int*)(0x42DEC004UL))
#define bFM4_GPIO_EPFR00_CROUTE1               *((volatile unsigned int*)(0x42DEC008UL))
#define bFM4_GPIO_EPFR00_RTCCOE0               *((volatile unsigned int*)(0x42DEC010UL))
#define bFM4_GPIO_EPFR00_RTCCOE1               *((volatile unsigned int*)(0x42DEC014UL))
#define bFM4_GPIO_EPFR00_SUBOUTE0              *((volatile unsigned int*)(0x42DEC018UL))
#define bFM4_GPIO_EPFR00_SUBOUTE1              *((volatile unsigned int*)(0x42DEC01CUL))
#define bFM4_GPIO_EPFR00_USBP0E                *((volatile unsigned int*)(0x42DEC024UL))
#define bFM4_GPIO_EPFR00_USBP1E                *((volatile unsigned int*)(0x42DEC034UL))
#define bFM4_GPIO_EPFR00_JTAGEN0B              *((volatile unsigned int*)(0x42DEC040UL))
#define bFM4_GPIO_EPFR00_JTAGEN1S              *((volatile unsigned int*)(0x42DEC044UL))
#define bFM4_GPIO_EPFR00_TRC0E                 *((volatile unsigned int*)(0x42DEC060UL))
#define bFM4_GPIO_EPFR00_TRC1E                 *((volatile unsigned int*)(0x42DEC064UL))
#define bFM4_GPIO_EPFR01_RTO00E0               *((volatile unsigned int*)(0x42DEC080UL))
#define bFM4_GPIO_EPFR01_RTO00E1               *((volatile unsigned int*)(0x42DEC084UL))
#define bFM4_GPIO_EPFR01_RTO01E0               *((volatile unsigned int*)(0x42DEC088UL))
#define bFM4_GPIO_EPFR01_RTO01E1               *((volatile unsigned int*)(0x42DEC08CUL))
#define bFM4_GPIO_EPFR01_RTO02E0               *((volatile unsigned int*)(0x42DEC090UL))
#define bFM4_GPIO_EPFR01_RTO02E1               *((volatile unsigned int*)(0x42DEC094UL))
#define bFM4_GPIO_EPFR01_RTO03E0               *((volatile unsigned int*)(0x42DEC098UL))
#define bFM4_GPIO_EPFR01_RTO03E1               *((volatile unsigned int*)(0x42DEC09CUL))
#define bFM4_GPIO_EPFR01_RTO04E0               *((volatile unsigned int*)(0x42DEC0A0UL))
#define bFM4_GPIO_EPFR01_RTO04E1               *((volatile unsigned int*)(0x42DEC0A4UL))
#define bFM4_GPIO_EPFR01_RTO05E0               *((volatile unsigned int*)(0x42DEC0A8UL))
#define bFM4_GPIO_EPFR01_RTO05E1               *((volatile unsigned int*)(0x42DEC0ACUL))
#define bFM4_GPIO_EPFR01_DTTI0C                *((volatile unsigned int*)(0x42DEC0B0UL))
#define bFM4_GPIO_EPFR01_DTTI0S0               *((volatile unsigned int*)(0x42DEC0C0UL))
#define bFM4_GPIO_EPFR01_DTTI0S1               *((volatile unsigned int*)(0x42DEC0C4UL))
#define bFM4_GPIO_EPFR01_FRCK0S0               *((volatile unsigned int*)(0x42DEC0C8UL))
#define bFM4_GPIO_EPFR01_FRCK0S1               *((volatile unsigned int*)(0x42DEC0CCUL))
#define bFM4_GPIO_EPFR01_IC00S0                *((volatile unsigned int*)(0x42DEC0D0UL))
#define bFM4_GPIO_EPFR01_IC00S1                *((volatile unsigned int*)(0x42DEC0D4UL))
#define bFM4_GPIO_EPFR01_IC00S2                *((volatile unsigned int*)(0x42DEC0D8UL))
#define bFM4_GPIO_EPFR01_IC01S0                *((volatile unsigned int*)(0x42DEC0DCUL))
#define bFM4_GPIO_EPFR01_IC01S1                *((volatile unsigned int*)(0x42DEC0E0UL))
#define bFM4_GPIO_EPFR01_IC01S2                *((volatile unsigned int*)(0x42DEC0E4UL))
#define bFM4_GPIO_EPFR01_IC02S0                *((volatile unsigned int*)(0x42DEC0E8UL))
#define bFM4_GPIO_EPFR01_IC02S1                *((volatile unsigned int*)(0x42DEC0ECUL))
#define bFM4_GPIO_EPFR01_IC02S2                *((volatile unsigned int*)(0x42DEC0F0UL))
#define bFM4_GPIO_EPFR01_IC03S0                *((volatile unsigned int*)(0x42DEC0F4UL))
#define bFM4_GPIO_EPFR01_IC03S1                *((volatile unsigned int*)(0x42DEC0F8UL))
#define bFM4_GPIO_EPFR01_IC03S2                *((volatile unsigned int*)(0x42DEC0FCUL))
#define bFM4_GPIO_EPFR02_RTO10E0               *((volatile unsigned int*)(0x42DEC100UL))
#define bFM4_GPIO_EPFR02_RTO10E1               *((volatile unsigned int*)(0x42DEC104UL))
#define bFM4_GPIO_EPFR02_RTO11E0               *((volatile unsigned int*)(0x42DEC108UL))
#define bFM4_GPIO_EPFR02_RTO11E1               *((volatile unsigned int*)(0x42DEC10CUL))
#define bFM4_GPIO_EPFR02_RTO12E0               *((volatile unsigned int*)(0x42DEC110UL))
#define bFM4_GPIO_EPFR02_RTO12E1               *((volatile unsigned int*)(0x42DEC114UL))
#define bFM4_GPIO_EPFR02_RTO13E0               *((volatile unsigned int*)(0x42DEC118UL))
#define bFM4_GPIO_EPFR02_RTO13E1               *((volatile unsigned int*)(0x42DEC11CUL))
#define bFM4_GPIO_EPFR02_RTO14E0               *((volatile unsigned int*)(0x42DEC120UL))
#define bFM4_GPIO_EPFR02_RTO14E1               *((volatile unsigned int*)(0x42DEC124UL))
#define bFM4_GPIO_EPFR02_RTO15E0               *((volatile unsigned int*)(0x42DEC128UL))
#define bFM4_GPIO_EPFR02_RTO15E1               *((volatile unsigned int*)(0x42DEC12CUL))
#define bFM4_GPIO_EPFR02_DTTI1C                *((volatile unsigned int*)(0x42DEC130UL))
#define bFM4_GPIO_EPFR02_DTTI1S0               *((volatile unsigned int*)(0x42DEC140UL))
#define bFM4_GPIO_EPFR02_DTTI1S1               *((volatile unsigned int*)(0x42DEC144UL))
#define bFM4_GPIO_EPFR02_FRCK1S0               *((volatile unsigned int*)(0x42DEC148UL))
#define bFM4_GPIO_EPFR02_FRCK1S1               *((volatile unsigned int*)(0x42DEC14CUL))
#define bFM4_GPIO_EPFR02_IC10S0                *((volatile unsigned int*)(0x42DEC150UL))
#define bFM4_GPIO_EPFR02_IC10S1                *((volatile unsigned int*)(0x42DEC154UL))
#define bFM4_GPIO_EPFR02_IC10S2                *((volatile unsigned int*)(0x42DEC158UL))
#define bFM4_GPIO_EPFR02_IC11S0                *((volatile unsigned int*)(0x42DEC15CUL))
#define bFM4_GPIO_EPFR02_IC11S1                *((volatile unsigned int*)(0x42DEC160UL))
#define bFM4_GPIO_EPFR02_IC11S2                *((volatile unsigned int*)(0x42DEC164UL))
#define bFM4_GPIO_EPFR02_IC12S0                *((volatile unsigned int*)(0x42DEC168UL))
#define bFM4_GPIO_EPFR02_IC12S1                *((volatile unsigned int*)(0x42DEC16CUL))
#define bFM4_GPIO_EPFR02_IC12S2                *((volatile unsigned int*)(0x42DEC170UL))
#define bFM4_GPIO_EPFR02_IC13S0                *((volatile unsigned int*)(0x42DEC174UL))
#define bFM4_GPIO_EPFR02_IC13S1                *((volatile unsigned int*)(0x42DEC178UL))
#define bFM4_GPIO_EPFR02_IC13S2                *((volatile unsigned int*)(0x42DEC17CUL))
#define bFM4_GPIO_EPFR03_RTO20E0               *((volatile unsigned int*)(0x42DEC180UL))
#define bFM4_GPIO_EPFR03_RTO20E1               *((volatile unsigned int*)(0x42DEC184UL))
#define bFM4_GPIO_EPFR03_RTO21E0               *((volatile unsigned int*)(0x42DEC188UL))
#define bFM4_GPIO_EPFR03_RTO21E1               *((volatile unsigned int*)(0x42DEC18CUL))
#define bFM4_GPIO_EPFR03_RTO22E0               *((volatile unsigned int*)(0x42DEC190UL))
#define bFM4_GPIO_EPFR03_RTO22E1               *((volatile unsigned int*)(0x42DEC194UL))
#define bFM4_GPIO_EPFR03_RTO23E0               *((volatile unsigned int*)(0x42DEC198UL))
#define bFM4_GPIO_EPFR03_RTO23E1               *((volatile unsigned int*)(0x42DEC19CUL))
#define bFM4_GPIO_EPFR03_RTO24E0               *((volatile unsigned int*)(0x42DEC1A0UL))
#define bFM4_GPIO_EPFR03_RTO24E1               *((volatile unsigned int*)(0x42DEC1A4UL))
#define bFM4_GPIO_EPFR03_RTO25E0               *((volatile unsigned int*)(0x42DEC1A8UL))
#define bFM4_GPIO_EPFR03_RTO25E1               *((volatile unsigned int*)(0x42DEC1ACUL))
#define bFM4_GPIO_EPFR03_DTTI2C                *((volatile unsigned int*)(0x42DEC1B0UL))
#define bFM4_GPIO_EPFR03_DTTI2S0               *((volatile unsigned int*)(0x42DEC1C0UL))
#define bFM4_GPIO_EPFR03_DTTI2S1               *((volatile unsigned int*)(0x42DEC1C4UL))
#define bFM4_GPIO_EPFR03_FRCK2S0               *((volatile unsigned int*)(0x42DEC1C8UL))
#define bFM4_GPIO_EPFR03_FRCK2S1               *((volatile unsigned int*)(0x42DEC1CCUL))
#define bFM4_GPIO_EPFR03_IC20S0                *((volatile unsigned int*)(0x42DEC1D0UL))
#define bFM4_GPIO_EPFR03_IC20S1                *((volatile unsigned int*)(0x42DEC1D4UL))
#define bFM4_GPIO_EPFR03_IC20S2                *((volatile unsigned int*)(0x42DEC1D8UL))
#define bFM4_GPIO_EPFR03_IC21S0                *((volatile unsigned int*)(0x42DEC1DCUL))
#define bFM4_GPIO_EPFR03_IC21S1                *((volatile unsigned int*)(0x42DEC1E0UL))
#define bFM4_GPIO_EPFR03_IC21S2                *((volatile unsigned int*)(0x42DEC1E4UL))
#define bFM4_GPIO_EPFR03_IC22S0                *((volatile unsigned int*)(0x42DEC1E8UL))
#define bFM4_GPIO_EPFR03_IC22S1                *((volatile unsigned int*)(0x42DEC1ECUL))
#define bFM4_GPIO_EPFR03_IC22S2                *((volatile unsigned int*)(0x42DEC1F0UL))
#define bFM4_GPIO_EPFR03_IC23S0                *((volatile unsigned int*)(0x42DEC1F4UL))
#define bFM4_GPIO_EPFR03_IC23S1                *((volatile unsigned int*)(0x42DEC1F8UL))
#define bFM4_GPIO_EPFR03_IC23S2                *((volatile unsigned int*)(0x42DEC1FCUL))
#define bFM4_GPIO_EPFR04_TIOA0E0               *((volatile unsigned int*)(0x42DEC208UL))
#define bFM4_GPIO_EPFR04_TIOA0E1               *((volatile unsigned int*)(0x42DEC20CUL))
#define bFM4_GPIO_EPFR04_TIOB0S0               *((volatile unsigned int*)(0x42DEC210UL))
#define bFM4_GPIO_EPFR04_TIOB0S1               *((volatile unsigned int*)(0x42DEC214UL))
#define bFM4_GPIO_EPFR04_TIOB0S2               *((volatile unsigned int*)(0x42DEC218UL))
#define bFM4_GPIO_EPFR04_TIOA1S0               *((volatile unsigned int*)(0x42DEC220UL))
#define bFM4_GPIO_EPFR04_TIOA1S1               *((volatile unsigned int*)(0x42DEC224UL))
#define bFM4_GPIO_EPFR04_TIOA1E0               *((volatile unsigned int*)(0x42DEC228UL))
#define bFM4_GPIO_EPFR04_TIOA1E1               *((volatile unsigned int*)(0x42DEC22CUL))
#define bFM4_GPIO_EPFR04_TIOB1S0               *((volatile unsigned int*)(0x42DEC230UL))
#define bFM4_GPIO_EPFR04_TIOB1S1               *((volatile unsigned int*)(0x42DEC234UL))
#define bFM4_GPIO_EPFR04_TIOA2E0               *((volatile unsigned int*)(0x42DEC248UL))
#define bFM4_GPIO_EPFR04_TIOA2E1               *((volatile unsigned int*)(0x42DEC24CUL))
#define bFM4_GPIO_EPFR04_TIOB2S0               *((volatile unsigned int*)(0x42DEC250UL))
#define bFM4_GPIO_EPFR04_TIOB2S1               *((volatile unsigned int*)(0x42DEC254UL))
#define bFM4_GPIO_EPFR04_TIOA3S0               *((volatile unsigned int*)(0x42DEC260UL))
#define bFM4_GPIO_EPFR04_TIOA3S1               *((volatile unsigned int*)(0x42DEC264UL))
#define bFM4_GPIO_EPFR04_TIOA3E0               *((volatile unsigned int*)(0x42DEC268UL))
#define bFM4_GPIO_EPFR04_TIOA3E1               *((volatile unsigned int*)(0x42DEC26CUL))
#define bFM4_GPIO_EPFR04_TIOB3S0               *((volatile unsigned int*)(0x42DEC270UL))
#define bFM4_GPIO_EPFR04_TIOB3S1               *((volatile unsigned int*)(0x42DEC274UL))
#define bFM4_GPIO_EPFR05_TIOA4E0               *((volatile unsigned int*)(0x42DEC288UL))
#define bFM4_GPIO_EPFR05_TIOA4E1               *((volatile unsigned int*)(0x42DEC28CUL))
#define bFM4_GPIO_EPFR05_TIOB4S0               *((volatile unsigned int*)(0x42DEC290UL))
#define bFM4_GPIO_EPFR05_TIOB4S1               *((volatile unsigned int*)(0x42DEC294UL))
#define bFM4_GPIO_EPFR05_TIOA5S0               *((volatile unsigned int*)(0x42DEC2A0UL))
#define bFM4_GPIO_EPFR05_TIOA5S1               *((volatile unsigned int*)(0x42DEC2A4UL))
#define bFM4_GPIO_EPFR05_TIOA5E0               *((volatile unsigned int*)(0x42DEC2A8UL))
#define bFM4_GPIO_EPFR05_TIOA5E1               *((volatile unsigned int*)(0x42DEC2ACUL))
#define bFM4_GPIO_EPFR05_TIOB5S0               *((volatile unsigned int*)(0x42DEC2B0UL))
#define bFM4_GPIO_EPFR05_TIOB5S1               *((volatile unsigned int*)(0x42DEC2B4UL))
#define bFM4_GPIO_EPFR05_TIOA6E0               *((volatile unsigned int*)(0x42DEC2C8UL))
#define bFM4_GPIO_EPFR05_TIOA6E1               *((volatile unsigned int*)(0x42DEC2CCUL))
#define bFM4_GPIO_EPFR05_TIOB6S0               *((volatile unsigned int*)(0x42DEC2D0UL))
#define bFM4_GPIO_EPFR05_TIOB6S1               *((volatile unsigned int*)(0x42DEC2D4UL))
#define bFM4_GPIO_EPFR05_TIOA7S0               *((volatile unsigned int*)(0x42DEC2E0UL))
#define bFM4_GPIO_EPFR05_TIOA7S1               *((volatile unsigned int*)(0x42DEC2E4UL))
#define bFM4_GPIO_EPFR05_TIOA7E0               *((volatile unsigned int*)(0x42DEC2E8UL))
#define bFM4_GPIO_EPFR05_TIOA7E1               *((volatile unsigned int*)(0x42DEC2ECUL))
#define bFM4_GPIO_EPFR05_TIOB7S0               *((volatile unsigned int*)(0x42DEC2F0UL))
#define bFM4_GPIO_EPFR05_TIOB7S1               *((volatile unsigned int*)(0x42DEC2F4UL))
#define bFM4_GPIO_EPFR06_EINT00S0              *((volatile unsigned int*)(0x42DEC300UL))
#define bFM4_GPIO_EPFR06_EINT00S1              *((volatile unsigned int*)(0x42DEC304UL))
#define bFM4_GPIO_EPFR06_EINT01S0              *((volatile unsigned int*)(0x42DEC308UL))
#define bFM4_GPIO_EPFR06_EINT01S1              *((volatile unsigned int*)(0x42DEC30CUL))
#define bFM4_GPIO_EPFR06_EINT02S0              *((volatile unsigned int*)(0x42DEC310UL))
#define bFM4_GPIO_EPFR06_EINT02S1              *((volatile unsigned int*)(0x42DEC314UL))
#define bFM4_GPIO_EPFR06_EINT03S0              *((volatile unsigned int*)(0x42DEC318UL))
#define bFM4_GPIO_EPFR06_EINT03S1              *((volatile unsigned int*)(0x42DEC31CUL))
#define bFM4_GPIO_EPFR06_EINT04S0              *((volatile unsigned int*)(0x42DEC320UL))
#define bFM4_GPIO_EPFR06_EINT04S1              *((volatile unsigned int*)(0x42DEC324UL))
#define bFM4_GPIO_EPFR06_EINT05S0              *((volatile unsigned int*)(0x42DEC328UL))
#define bFM4_GPIO_EPFR06_EINT05S1              *((volatile unsigned int*)(0x42DEC32CUL))
#define bFM4_GPIO_EPFR06_EINT06S0              *((volatile unsigned int*)(0x42DEC330UL))
#define bFM4_GPIO_EPFR06_EINT06S1              *((volatile unsigned int*)(0x42DEC334UL))
#define bFM4_GPIO_EPFR06_EINT07S0              *((volatile unsigned int*)(0x42DEC338UL))
#define bFM4_GPIO_EPFR06_EINT07S1              *((volatile unsigned int*)(0x42DEC33CUL))
#define bFM4_GPIO_EPFR06_EINT08S0              *((volatile unsigned int*)(0x42DEC340UL))
#define bFM4_GPIO_EPFR06_EINT08S1              *((volatile unsigned int*)(0x42DEC344UL))
#define bFM4_GPIO_EPFR06_EINT09S0              *((volatile unsigned int*)(0x42DEC348UL))
#define bFM4_GPIO_EPFR06_EINT09S1              *((volatile unsigned int*)(0x42DEC34CUL))
#define bFM4_GPIO_EPFR06_EINT10S0              *((volatile unsigned int*)(0x42DEC350UL))
#define bFM4_GPIO_EPFR06_EINT10S1              *((volatile unsigned int*)(0x42DEC354UL))
#define bFM4_GPIO_EPFR06_EINT11S0              *((volatile unsigned int*)(0x42DEC358UL))
#define bFM4_GPIO_EPFR06_EINT11S1              *((volatile unsigned int*)(0x42DEC35CUL))
#define bFM4_GPIO_EPFR06_EINT12S0              *((volatile unsigned int*)(0x42DEC360UL))
#define bFM4_GPIO_EPFR06_EINT12S1              *((volatile unsigned int*)(0x42DEC364UL))
#define bFM4_GPIO_EPFR06_EINT13S0              *((volatile unsigned int*)(0x42DEC368UL))
#define bFM4_GPIO_EPFR06_EINT13S1              *((volatile unsigned int*)(0x42DEC36CUL))
#define bFM4_GPIO_EPFR06_EINT14S0              *((volatile unsigned int*)(0x42DEC370UL))
#define bFM4_GPIO_EPFR06_EINT14S1              *((volatile unsigned int*)(0x42DEC374UL))
#define bFM4_GPIO_EPFR06_EINT15S0              *((volatile unsigned int*)(0x42DEC378UL))
#define bFM4_GPIO_EPFR06_EINT15S1              *((volatile unsigned int*)(0x42DEC37CUL))
#define bFM4_GPIO_EPFR07_SIN0S0                *((volatile unsigned int*)(0x42DEC390UL))
#define bFM4_GPIO_EPFR07_SIN0S1                *((volatile unsigned int*)(0x42DEC394UL))
#define bFM4_GPIO_EPFR07_SOT0B0                *((volatile unsigned int*)(0x42DEC398UL))
#define bFM4_GPIO_EPFR07_SOT0B1                *((volatile unsigned int*)(0x42DEC39CUL))
#define bFM4_GPIO_EPFR07_SCK0B0                *((volatile unsigned int*)(0x42DEC3A0UL))
#define bFM4_GPIO_EPFR07_SCK0B1                *((volatile unsigned int*)(0x42DEC3A4UL))
#define bFM4_GPIO_EPFR07_SIN1S0                *((volatile unsigned int*)(0x42DEC3A8UL))
#define bFM4_GPIO_EPFR07_SIN1S1                *((volatile unsigned int*)(0x42DEC3ACUL))
#define bFM4_GPIO_EPFR07_SOT1B0                *((volatile unsigned int*)(0x42DEC3B0UL))
#define bFM4_GPIO_EPFR07_SOT1B1                *((volatile unsigned int*)(0x42DEC3B4UL))
#define bFM4_GPIO_EPFR07_SCK1B0                *((volatile unsigned int*)(0x42DEC3B8UL))
#define bFM4_GPIO_EPFR07_SCK1B1                *((volatile unsigned int*)(0x42DEC3BCUL))
#define bFM4_GPIO_EPFR07_SIN2S0                *((volatile unsigned int*)(0x42DEC3C0UL))
#define bFM4_GPIO_EPFR07_SIN2S1                *((volatile unsigned int*)(0x42DEC3C4UL))
#define bFM4_GPIO_EPFR07_SOT2B0                *((volatile unsigned int*)(0x42DEC3C8UL))
#define bFM4_GPIO_EPFR07_SOT2B1                *((volatile unsigned int*)(0x42DEC3CCUL))
#define bFM4_GPIO_EPFR07_SCK2B0                *((volatile unsigned int*)(0x42DEC3D0UL))
#define bFM4_GPIO_EPFR07_SCK2B1                *((volatile unsigned int*)(0x42DEC3D4UL))
#define bFM4_GPIO_EPFR07_SIN3S0                *((volatile unsigned int*)(0x42DEC3D8UL))
#define bFM4_GPIO_EPFR07_SIN3S1                *((volatile unsigned int*)(0x42DEC3DCUL))
#define bFM4_GPIO_EPFR07_SOT3B0                *((volatile unsigned int*)(0x42DEC3E0UL))
#define bFM4_GPIO_EPFR07_SOT3B1                *((volatile unsigned int*)(0x42DEC3E4UL))
#define bFM4_GPIO_EPFR07_SCK3B0                *((volatile unsigned int*)(0x42DEC3E8UL))
#define bFM4_GPIO_EPFR07_SCK3B1                *((volatile unsigned int*)(0x42DEC3ECUL))
#define bFM4_GPIO_EPFR08_RTS4E0                *((volatile unsigned int*)(0x42DEC400UL))
#define bFM4_GPIO_EPFR08_RTS4E1                *((volatile unsigned int*)(0x42DEC404UL))
#define bFM4_GPIO_EPFR08_CTS4S0                *((volatile unsigned int*)(0x42DEC408UL))
#define bFM4_GPIO_EPFR08_CTS4S1                *((volatile unsigned int*)(0x42DEC40CUL))
#define bFM4_GPIO_EPFR08_SIN4S0                *((volatile unsigned int*)(0x42DEC410UL))
#define bFM4_GPIO_EPFR08_SIN4S1                *((volatile unsigned int*)(0x42DEC414UL))
#define bFM4_GPIO_EPFR08_SOT4B0                *((volatile unsigned int*)(0x42DEC418UL))
#define bFM4_GPIO_EPFR08_SOT4B1                *((volatile unsigned int*)(0x42DEC41CUL))
#define bFM4_GPIO_EPFR08_SCK4B0                *((volatile unsigned int*)(0x42DEC420UL))
#define bFM4_GPIO_EPFR08_SCK4B1                *((volatile unsigned int*)(0x42DEC424UL))
#define bFM4_GPIO_EPFR08_SIN5S0                *((volatile unsigned int*)(0x42DEC428UL))
#define bFM4_GPIO_EPFR08_SIN5S1                *((volatile unsigned int*)(0x42DEC42CUL))
#define bFM4_GPIO_EPFR08_SOT5B0                *((volatile unsigned int*)(0x42DEC430UL))
#define bFM4_GPIO_EPFR08_SOT5B1                *((volatile unsigned int*)(0x42DEC434UL))
#define bFM4_GPIO_EPFR08_SCK5B0                *((volatile unsigned int*)(0x42DEC438UL))
#define bFM4_GPIO_EPFR08_SCK5B1                *((volatile unsigned int*)(0x42DEC43CUL))
#define bFM4_GPIO_EPFR08_SIN6S0                *((volatile unsigned int*)(0x42DEC440UL))
#define bFM4_GPIO_EPFR08_SIN6S1                *((volatile unsigned int*)(0x42DEC444UL))
#define bFM4_GPIO_EPFR08_SOT6B0                *((volatile unsigned int*)(0x42DEC448UL))
#define bFM4_GPIO_EPFR08_SOT6B1                *((volatile unsigned int*)(0x42DEC44CUL))
#define bFM4_GPIO_EPFR08_SCK6B0                *((volatile unsigned int*)(0x42DEC450UL))
#define bFM4_GPIO_EPFR08_SCK6B1                *((volatile unsigned int*)(0x42DEC454UL))
#define bFM4_GPIO_EPFR08_SIN7S0                *((volatile unsigned int*)(0x42DEC458UL))
#define bFM4_GPIO_EPFR08_SIN7S1                *((volatile unsigned int*)(0x42DEC45CUL))
#define bFM4_GPIO_EPFR08_SOT7B0                *((volatile unsigned int*)(0x42DEC460UL))
#define bFM4_GPIO_EPFR08_SOT7B1                *((volatile unsigned int*)(0x42DEC464UL))
#define bFM4_GPIO_EPFR08_SCK7B0                *((volatile unsigned int*)(0x42DEC468UL))
#define bFM4_GPIO_EPFR08_SCK7B1                *((volatile unsigned int*)(0x42DEC46CUL))
#define bFM4_GPIO_EPFR08_RTS5E0                *((volatile unsigned int*)(0x42DEC470UL))
#define bFM4_GPIO_EPFR08_RTS5E1                *((volatile unsigned int*)(0x42DEC474UL))
#define bFM4_GPIO_EPFR08_CTS5S0                *((volatile unsigned int*)(0x42DEC478UL))
#define bFM4_GPIO_EPFR08_CTS5S1                *((volatile unsigned int*)(0x42DEC47CUL))
#define bFM4_GPIO_EPFR09_QAIN0S0               *((volatile unsigned int*)(0x42DEC480UL))
#define bFM4_GPIO_EPFR09_QAIN0S1               *((volatile unsigned int*)(0x42DEC484UL))
#define bFM4_GPIO_EPFR09_QBIN0S0               *((volatile unsigned int*)(0x42DEC488UL))
#define bFM4_GPIO_EPFR09_QBIN0S1               *((volatile unsigned int*)(0x42DEC48CUL))
#define bFM4_GPIO_EPFR09_QZIN0S0               *((volatile unsigned int*)(0x42DEC490UL))
#define bFM4_GPIO_EPFR09_QZIN0S1               *((volatile unsigned int*)(0x42DEC494UL))
#define bFM4_GPIO_EPFR09_QAIN1S0               *((volatile unsigned int*)(0x42DEC498UL))
#define bFM4_GPIO_EPFR09_QAIN1S1               *((volatile unsigned int*)(0x42DEC49CUL))
#define bFM4_GPIO_EPFR09_QBIN1S0               *((volatile unsigned int*)(0x42DEC4A0UL))
#define bFM4_GPIO_EPFR09_QBIN1S1               *((volatile unsigned int*)(0x42DEC4A4UL))
#define bFM4_GPIO_EPFR09_QZIN1S0               *((volatile unsigned int*)(0x42DEC4A8UL))
#define bFM4_GPIO_EPFR09_QZIN1S1               *((volatile unsigned int*)(0x42DEC4ACUL))
#define bFM4_GPIO_EPFR09_ADTRG0S0              *((volatile unsigned int*)(0x42DEC4B0UL))
#define bFM4_GPIO_EPFR09_ADTRG0S1              *((volatile unsigned int*)(0x42DEC4B4UL))
#define bFM4_GPIO_EPFR09_ADTRG0S2              *((volatile unsigned int*)(0x42DEC4B8UL))
#define bFM4_GPIO_EPFR09_ADTRG0S3              *((volatile unsigned int*)(0x42DEC4BCUL))
#define bFM4_GPIO_EPFR09_ADTRG1S0              *((volatile unsigned int*)(0x42DEC4C0UL))
#define bFM4_GPIO_EPFR09_ADTRG1S1              *((volatile unsigned int*)(0x42DEC4C4UL))
#define bFM4_GPIO_EPFR09_ADTRG1S2              *((volatile unsigned int*)(0x42DEC4C8UL))
#define bFM4_GPIO_EPFR09_ADTRG1S3              *((volatile unsigned int*)(0x42DEC4CCUL))
#define bFM4_GPIO_EPFR09_ADTRG2S0              *((volatile unsigned int*)(0x42DEC4D0UL))
#define bFM4_GPIO_EPFR09_ADTRG2S1              *((volatile unsigned int*)(0x42DEC4D4UL))
#define bFM4_GPIO_EPFR09_ADTRG2S2              *((volatile unsigned int*)(0x42DEC4D8UL))
#define bFM4_GPIO_EPFR09_ADTRG2S3              *((volatile unsigned int*)(0x42DEC4DCUL))
#define bFM4_GPIO_EPFR09_CRX0S0                *((volatile unsigned int*)(0x42DEC4E0UL))
#define bFM4_GPIO_EPFR09_CRX0S1                *((volatile unsigned int*)(0x42DEC4E4UL))
#define bFM4_GPIO_EPFR09_CTX0E0                *((volatile unsigned int*)(0x42DEC4E8UL))
#define bFM4_GPIO_EPFR09_CTX0E1                *((volatile unsigned int*)(0x42DEC4ECUL))
#define bFM4_GPIO_EPFR09_CRX1S0                *((volatile unsigned int*)(0x42DEC4F0UL))
#define bFM4_GPIO_EPFR09_CRX1S1                *((volatile unsigned int*)(0x42DEC4F4UL))
#define bFM4_GPIO_EPFR09_CTX1E0                *((volatile unsigned int*)(0x42DEC4F8UL))
