marcel-galliker/Mouvent-PrintEngine/rx_balance_ctrl/common/mb9b160l.h
#define bFM4_GPIO_PZR1_P0                     *((volatile unsigned int*)(0x42DEE080UL))
#define bFM4_GPIO_PZR1_P1                     *((volatile unsigned int*)(0x42DEE084UL))
#define bFM4_GPIO_PZR1_P2                     *((volatile unsigned int*)(0x42DEE088UL))
#define bFM4_GPIO_PZR1_P3                     *((volatile unsigned int*)(0x42DEE08CUL))
#define bFM4_GPIO_PZR1_P4                     *((volatile unsigned int*)(0x42DEE090UL))
#define bFM4_GPIO_PZR1_P5                     *((volatile unsigned int*)(0x42DEE094UL))
#define bFM4_GPIO_PZR1_P6                     *((volatile unsigned int*)(0x42DEE098UL))
#define bFM4_GPIO_PZR1_P7                     *((volatile unsigned int*)(0x42DEE09CUL))
#define bFM4_GPIO_PZR1_P8                     *((volatile unsigned int*)(0x42DEE0A0UL))
#define bFM4_GPIO_PZR1_P9                     *((volatile unsigned int*)(0x42DEE0A4UL))
#define bFM4_GPIO_PZR1_PA                     *((volatile unsigned int*)(0x42DEE0A8UL))
#define bFM4_GPIO_PZR1_PB                     *((volatile unsigned int*)(0x42DEE0ACUL))
#define bFM4_GPIO_PZR1_PC                     *((volatile unsigned int*)(0x42DEE0B0UL))
#define bFM4_GPIO_PZR1_PD                     *((volatile unsigned int*)(0x42DEE0B4UL))
#define bFM4_GPIO_PZR1_PE                     *((volatile unsigned int*)(0x42DEE0B8UL))
#define bFM4_GPIO_PZR1_PF                     *((volatile unsigned int*)(0x42DEE0BCUL))
#define bFM4_GPIO_PZR2_P0                     *((volatile unsigned int*)(0x42DEE100UL))
#define bFM4_GPIO_PZR2_P1                     *((volatile unsigned int*)(0x42DEE104UL))
#define bFM4_GPIO_PZR2_P2                     *((volatile unsigned int*)(0x42DEE108UL))
#define bFM4_GPIO_PZR2_P3                     *((volatile unsigned int*)(0x42DEE10CUL))
#define bFM4_GPIO_PZR2_P4                     *((volatile unsigned int*)(0x42DEE110UL))
#define bFM4_GPIO_PZR2_P5                     *((volatile unsigned int*)(0x42DEE114UL))
#define bFM4_GPIO_PZR2_P6                     *((volatile unsigned int*)(0x42DEE118UL))
#define bFM4_GPIO_PZR2_P7                     *((volatile unsigned int*)(0x42DEE11CUL))
#define bFM4_GPIO_PZR3_P0                     *((volatile unsigned int*)(0x42DEE180UL))
#define bFM4_GPIO_PZR3_P1                     *((volatile unsigned int*)(0x42DEE184UL))
#define bFM4_GPIO_PZR3_P2                     *((volatile unsigned int*)(0x42DEE188UL))
#define bFM4_GPIO_PZR3_P3                     *((volatile unsigned int*)(0x42DEE18CUL))
#define bFM4_GPIO_PZR3_P4                     *((volatile unsigned int*)(0x42DEE190UL))
#define bFM4_GPIO_PZR3_P5                     *((volatile unsigned int*)(0x42DEE194UL))
#define bFM4_GPIO_PZR3_P6                     *((volatile unsigned int*)(0x42DEE198UL))
#define bFM4_GPIO_PZR3_P7                     *((volatile unsigned int*)(0x42DEE19CUL))
#define bFM4_GPIO_PZR3_P8                     *((volatile unsigned int*)(0x42DEE1A0UL))
#define bFM4_GPIO_PZR3_P9                     *((volatile unsigned int*)(0x42DEE1A4UL))
#define bFM4_GPIO_PZR3_PA                     *((volatile unsigned int*)(0x42DEE1A8UL))
#define bFM4_GPIO_PZR3_PB                     *((volatile unsigned int*)(0x42DEE1ACUL))
#define bFM4_GPIO_PZR3_PC                     *((volatile unsigned int*)(0x42DEE1B0UL))
#define bFM4_GPIO_PZR3_PD                     *((volatile unsigned int*)(0x42DEE1B4UL))
#define bFM4_GPIO_PZR3_PE                     *((volatile unsigned int*)(0x42DEE1B8UL))
#define bFM4_GPIO_PZR3_PF                     *((volatile unsigned int*)(0x42DEE1BCUL))
#define bFM4_GPIO_PZR4_P0                     *((volatile unsigned int*)(0x42DEE200UL))
#define bFM4_GPIO_PZR4_P1                     *((volatile unsigned int*)(0x42DEE204UL))
#define bFM4_GPIO_PZR4_P2                     *((volatile unsigned int*)(0x42DEE208UL))
#define bFM4_GPIO_PZR4_P3                     *((volatile unsigned int*)(0x42DEE20CUL))
#define bFM4_GPIO_PZR4_P4                     *((volatile unsigned int*)(0x42DEE210UL))
#define bFM4_GPIO_PZR4_P5                     *((volatile unsigned int*)(0x42DEE214UL))
#define bFM4_GPIO_PZR4_P6                     *((volatile unsigned int*)(0x42DEE218UL))
#define bFM4_GPIO_PZR4_P7                     *((volatile unsigned int*)(0x42DEE21CUL))
#define bFM4_GPIO_PZR4_P8                     *((volatile unsigned int*)(0x42DEE220UL))
#define bFM4_GPIO_PZR4_P9                     *((volatile unsigned int*)(0x42DEE224UL))
#define bFM4_GPIO_PZR4_PA                     *((volatile unsigned int*)(0x42DEE228UL))
#define bFM4_GPIO_PZR4_PB                     *((volatile unsigned int*)(0x42DEE22CUL))
#define bFM4_GPIO_PZR4_PC                     *((volatile unsigned int*)(0x42DEE230UL))
#define bFM4_GPIO_PZR4_PD                     *((volatile unsigned int*)(0x42DEE234UL))
#define bFM4_GPIO_PZR4_PE                     *((volatile unsigned int*)(0x42DEE238UL))
#define bFM4_GPIO_PZR5_P0                     *((volatile unsigned int*)(0x42DEE280UL))
#define bFM4_GPIO_PZR5_P1                     *((volatile unsigned int*)(0x42DEE284UL))
#define bFM4_GPIO_PZR5_P2                     *((volatile unsigned int*)(0x42DEE288UL))
#define bFM4_GPIO_PZR5_P3                     *((volatile unsigned int*)(0x42DEE28CUL))
#define bFM4_GPIO_PZR5_P4                     *((volatile unsigned int*)(0x42DEE290UL))
#define bFM4_GPIO_PZR5_P5                     *((volatile unsigned int*)(0x42DEE294UL))
#define bFM4_GPIO_PZR5_P6                     *((volatile unsigned int*)(0x42DEE298UL))
#define bFM4_GPIO_PZR5_P7                     *((volatile unsigned int*)(0x42DEE29CUL))
#define bFM4_GPIO_PZR5_P8                     *((volatile unsigned int*)(0x42DEE2A0UL))
#define bFM4_GPIO_PZR5_P9                     *((volatile unsigned int*)(0x42DEE2A4UL))
#define bFM4_GPIO_PZR5_PA                     *((volatile unsigned int*)(0x42DEE2A8UL))
#define bFM4_GPIO_PZR5_PB                     *((volatile unsigned int*)(0x42DEE2ACUL))
#define bFM4_GPIO_PZR6_P0                     *((volatile unsigned int*)(0x42DEE300UL))
#define bFM4_GPIO_PZR6_P1                     *((volatile unsigned int*)(0x42DEE304UL))
#define bFM4_GPIO_PZR6_P2                     *((volatile unsigned int*)(0x42DEE308UL))
#define bFM4_GPIO_PZR6_P3                     *((volatile unsigned int*)(0x42DEE30CUL))
#define bFM4_GPIO_PZR6_P4                     *((volatile unsigned int*)(0x42DEE310UL))
#define bFM4_GPIO_PZR6_P5                     *((volatile unsigned int*)(0x42DEE314UL))
#define bFM4_GPIO_PZR6_P6                     *((volatile unsigned int*)(0x42DEE318UL))
#define bFM4_GPIO_PZR6_P7                     *((volatile unsigned int*)(0x42DEE31CUL))
#define bFM4_GPIO_PZR6_P8                     *((volatile unsigned int*)(0x42DEE320UL))
#define bFM4_GPIO_PZR7_P0                     *((volatile unsigned int*)(0x42DEE380UL))
#define bFM4_GPIO_PZR7_P1                     *((volatile unsigned int*)(0x42DEE384UL))
#define bFM4_GPIO_PZR7_P2                     *((volatile unsigned int*)(0x42DEE388UL))
#define bFM4_GPIO_PZR7_P3                     *((volatile unsigned int*)(0x42DEE38CUL))
#define bFM4_GPIO_PZR7_P4                     *((volatile unsigned int*)(0x42DEE390UL))
#define bFM4_GPIO_PZR8_P0                     *((volatile unsigned int*)(0x42DEE400UL))
#define bFM4_GPIO_PZR8_P1                     *((volatile unsigned int*)(0x42DEE404UL))
#define bFM4_GPIO_PZRE_P0                     *((volatile unsigned int*)(0x42DEE700UL))
#define bFM4_GPIO_PZRE_P2                     *((volatile unsigned int*)(0x42DEE708UL))
#define bFM4_GPIO_PZRE_P3                     *((volatile unsigned int*)(0x42DEE70CUL))

/* Low voltage detection registers */
#define bFM4_LVD_LVD_CTL_SVHI0                 *((volatile unsigned int*)(0x426A0008UL))
#define bFM4_LVD_LVD_CTL_SVHI1                 *((volatile unsigned int*)(0x426A000CUL))
#define bFM4_LVD_LVD_CTL_SVHI2                 *((volatile unsigned int*)(0x426A0010UL))
#define bFM4_LVD_LVD_CTL_SVHI3                 *((volatile unsigned int*)(0x426A0014UL))
#define bFM4_LVD_LVD_CTL_LVDIE                 *((volatile unsigned int*)(0x426A001CUL))
#define bFM4_LVD_LVD_STR_LVDIR                 *((volatile unsigned int*)(0x426A009CUL))
#define bFM4_LVD_LVD_CLR_LVDCL                 *((volatile unsigned int*)(0x426A011CUL))
#define bFM4_LVD_LVD_STR2_LVDIRDY              *((volatile unsigned int*)(0x426A021CUL))

/* DS mode registers */
#define bFM4_DS_RCK_CTL_RTCCKE                 *((volatile unsigned int*)(0x426A2080UL))
#define bFM4_DS_PMD_CTL_RTCE                   *((volatile unsigned int*)(0x426B0000UL))
#define bFM4_DS_WRFSR_WINITX                   *((volatile unsigned int*)(0x426B0080UL))
#define bFM4_DS_WRFSR_WLVDH                    *((volatile unsigned int*)(0x426B0084UL))
#define bFM4_DS_WIFSR_WRTCI                    *((volatile unsigned int*)(0x426B0100UL))
#define bFM4_DS_WIFSR_WLVDI                    *((volatile unsigned int*)(0x426B0104UL))
#define bFM4_DS_WIFSR_WUI0                     *((volatile unsigned int*)(0x426B0108UL))
#define bFM4_DS_WIFSR_WUI1                     *((volatile unsigned int*)(0x426B010CUL))
#define bFM4_DS_WIFSR_WUI2                     *((volatile unsigned int*)(0x426B0110UL))
#define bFM4_DS_WIFSR_WUI3                     *((volatile unsigned int*)(0x426B0114UL))
#define bFM4_DS_WIFSR_WUI4                     *((volatile unsigned int*)(0x426B0118UL))
#define bFM4_DS_WIFSR_WUI5                     *((volatile unsigned int*)(0x426B011CUL))
#define bFM4_DS_WIER_WRTCE                     *((volatile unsigned int*)(0x426B0180UL))
#define bFM4_DS_WIER_WLVDE                     *((volatile unsigned int*)(0x426B0184UL))
#define bFM4_DS_WIER_WUI1E                     *((volatile unsigned int*)(0x426B018CUL))
#define bFM4_DS_WIER_WUI2E                     *((volatile unsigned int*)(0x426B0190UL))
#define bFM4_DS_WIER_WUI3E                     *((volatile unsigned int*)(0x426B0194UL))
#define bFM4_DS_WIER_WUI4E                     *((volatile unsigned int*)(0x426B0198UL))
#define bFM4_DS_WIER_WUI5E                     *((volatile unsigned int*)(0x426B019CUL))
#define bFM4_DS_WILVR_WUI1LV                   *((volatile unsigned int*)(0x426B0200UL))
#define bFM4_DS_WILVR_WUI2LV                   *((volatile unsigned int*)(0x426B0204UL))
#define bFM4_DS_WILVR_WUI3LV                   *((volatile unsigned int*)(0x426B0208UL))
#define bFM4_DS_WILVR_WUI4LV                   *((volatile unsigned int*)(0x426B020CUL))
#define bFM4_DS_WILVR_WUI5LV                   *((volatile unsigned int*)(0x426B0210UL))
#define bFM4_DS_DSRAMR_SRAMR0                  *((volatile unsigned int*)(0x426B0280UL))
#define bFM4_DS_DSRAMR_SRAMR1                  *((volatile unsigned int*)(0x426B0284UL))

/* USB clock registers */
#define bFM4_USBCLK_UCCR_UCEN                  *((volatile unsigned int*)(0x426C0000UL))
#define bFM4_USBCLK_UCCR_UCSEL                 *((volatile unsigned int*)(0x426C0004UL))
#define bFM4_USBCLK_UPCR1_UPLLEN               *((volatile unsigned int*)(0x426C0080UL))
#define bFM4_USBCLK_UPCR1_UPINC                *((volatile unsigned int*)(0x426C0084UL))
#define bFM4_USBCLK_UPCR2_UPOWT0               *((volatile unsigned int*)(0x426C0100UL))
#define bFM4_USBCLK_UPCR2_UPOWT1               *((volatile unsigned int*)(0x426C0104UL))
#define bFM4_USBCLK_UPCR2_UPOWT2               *((volatile unsigned int*)(0x426C0108UL))
#define bFM4_USBCLK_UPCR3_UPLLK0               *((volatile unsigned int*)(0x426C0180UL))
#define bFM4_USBCLK_UPCR3_UPLLK1               *((volatile unsigned int*)(0x426C0184UL))
#define bFM4_USBCLK_UPCR3_UPLLK2               *((volatile unsigned int*)(0x426C0188UL))
#define bFM4_USBCLK_UPCR3_UPLLK3               *((volatile unsigned int*)(0x426C018CUL))
#define bFM4_USBCLK_UPCR3_UPLLK4               *((volatile unsigned int*)(0x426C0190UL))
#define bFM4_USBCLK_UPCR4_UPLLN0               *((volatile unsigned int*)(0x426C0200UL))
#define bFM4_USBCLK_UPCR4_UPLLN1               *((volatile unsigned int*)(0x426C0204UL))
#define bFM4_USBCLK_UPCR4_UPLLN2               *((volatile unsigned int*)(0x426C0208UL))
#define bFM4_USBCLK_UPCR4_UPLLN3               *((volatile unsigned int*)(0x426C020CUL))
#define bFM4_USBCLK_UPCR4_UPLLN4               *((volatile unsigned int*)(0x426C0210UL))
#define bFM4_USBCLK_UP_STR_UPRDY               *((volatile unsigned int*)(0x426C0280UL))
#define bFM4_USBCLK_UPINT_ENR_UPCSE            *((volatile unsigned int*)(0x426C0300UL))
#define bFM4_USBCLK_UPINT_CLR_UPCSC            *((volatile unsigned int*)(0x426C0380UL))
#define bFM4_USBCLK_UPINT_STR_UPCSI            *((volatile unsigned int*)(0x426C0400UL))
#define bFM4_USBCLK_USBEN_USBEN                *((volatile unsigned int*)(0x426C0600UL))

/* CAN prescaler register */
#define bFM4_CANPRES_CANPRE_CANPRE0            *((volatile unsigned int*)(0x426E0000UL))
#define bFM4_CANPRES_CANPRE_CANPRE1            *((volatile unsigned int*)(0x426E0004UL))
#define bFM4_CANPRES_CANPRE_CANPRE2            *((volatile unsigned int*)(0x426E0008UL))
#define bFM4_CANPRES_CANPRE_CANPRE3            *((volatile unsigned int*)(0x426E000CUL))

/* MFS UART channel 0 registers */
#define bFM4_MFS0_UART_SMR_SOE                 *((volatile unsigned int*)(0x42700000UL))
#define bFM4_MFS0_UART_SMR_BDS                 *((volatile unsigned int*)(0x42700008UL))
#define bFM4_MFS0_UART_SMR_SBL                 *((volatile unsigned int*)(0x4270000CUL))
#define bFM4_MFS0_UART_SMR_WUCR                *((volatile unsigned int*)(0x42700010UL))
#define bFM4_MFS0_UART_SMR_MD0                 *((volatile unsigned int*)(0x42700014UL))
#define bFM4_MFS0_UART_SMR_MD1                 *((volatile unsigned int*)(0x42700018UL))
#define bFM4_MFS0_UART_SMR_MD2                 *((volatile unsigned int*)(0x4270001CUL))
#define bFM4_MFS0_UART_SCR_TXE                 *((volatile unsigned int*)(0x42700020UL))
#define bFM4_MFS0_UART_SCR_RXE                 *((volatile unsigned int*)(0x42700024UL))
#define bFM4_MFS0_UART_SCR_TBIE                *((volatile unsigned int*)(0x42700028UL))
#define bFM4_MFS0_UART_SCR_TIE                 *((volatile unsigned int*)(0x4270002CUL))
#define bFM4_MFS0_UART_SCR_RIE                 *((volatile unsigned int*)(0x42700030UL))
#define bFM4_MFS0_UART_SCR_UPCL                *((volatile unsigned int*)(0x4270003CUL))
#define bFM4_MFS0_UART_ESCR_L0                 *((volatile unsigned int*)(0x42700080UL))
#define bFM4_MFS0_UART_ESCR_L1                 *((volatile unsigned int*)(0x42700084UL))
#define bFM4_MFS0_UART_ESCR_L2                 *((volatile unsigned int*)(0x42700088UL))
#define bFM4_MFS0_UART_ESCR_P                  *((volatile unsigned int*)(0x4270008CUL))
#define bFM4_MFS0_UART_ESCR_PEN                *((volatile unsigned int*)(0x42700090UL))
#define bFM4_MFS0_UART_ESCR_INV                *((volatile unsigned int*)(0x42700094UL))
#define bFM4_MFS0_UART_ESCR_ESBL               *((volatile unsigned int*)(0x42700098UL))
#define bFM4_MFS0_UART_ESCR_FLWEN              *((volatile unsigned int*)(0x4270009CUL))
#define bFM4_MFS0_UART_SSR_TBI                 *((volatile unsigned int*)(0x427000A0UL))
#define bFM4_MFS0_UART_SSR_TDRE                *((volatile unsigned int*)(0x427000A4UL))
#define bFM4_MFS0_UART_SSR_RDRF                *((volatile unsigned int*)(0x427000A8UL))
#define bFM4_MFS0_UART_SSR_ORE                 *((volatile unsigned int*)(0x427000ACUL))
#define bFM4_MFS0_UART_SSR_FRE                 *((volatile unsigned int*)(0x427000B0UL))
#define bFM4_MFS0_UART_SSR_PE                  *((volatile unsigned int*)(0x427000B4UL))
#define bFM4_MFS0_UART_SSR_REC                 *((volatile unsigned int*)(0x427000BCUL))
#define bFM4_MFS0_UART_RDR_AD                  *((volatile unsigned int*)(0x42700120UL))
#define bFM4_MFS0_UART_TDR_AD                  *((volatile unsigned int*)(0x42700120UL))
#define bFM4_MFS0_UART_BGR_EXT                 *((volatile unsigned int*)(0x427001BCUL))
#define bFM4_MFS0_UART_BGR1_EXT                *((volatile unsigned int*)(0x427001BCUL))
#define bFM4_MFS0_UART_FCR_FE1                 *((volatile unsigned int*)(0x42700280UL))
#define bFM4_MFS0_UART_FCR_FE2                 *((volatile unsigned int*)(0x42700284UL))
#define bFM4_MFS0_UART_FCR_FCL1                *((volatile unsigned int*)(0x42700288UL))
#define bFM4_MFS0_UART_FCR_FCL2                *((volatile unsigned int*)(0x4270028CUL))
#define bFM4_MFS0_UART_FCR_FSET                *((volatile unsigned int*)(0x42700290UL))
#define bFM4_MFS0_UART_FCR_FLD                 *((volatile unsigned int*)(0x42700294UL))
#define bFM4_MFS0_UART_FCR_FLST                *((volatile unsigned int*)(0x42700298UL))
#define bFM4_MFS0_UART_FCR_FSEL                *((volatile unsigned int*)(0x427002A0UL))
#define bFM4_MFS0_UART_FCR_FTIE                *((volatile unsigned int*)(0x427002A4UL))
#define bFM4_MFS0_UART_FCR_FDRQ                *((volatile unsigned int*)(0x427002A8UL))
#define bFM4_MFS0_UART_FCR_FRIIE               *((volatile unsigned int*)(0x427002ACUL))
#define bFM4_MFS0_UART_FCR_FLSTE               *((volatile unsigned int*)(0x427002B0UL))
#define bFM4_MFS0_UART_FCR0_FE1                *((volatile unsigned int*)(0x42700280UL))
#define bFM4_MFS0_UART_FCR0_FE2                *((volatile unsigned int*)(0x42700284UL))
#define bFM4_MFS0_UART_FCR0_FCL1               *((volatile unsigned int*)(0x42700288UL))
#define bFM4_MFS0_UART_FCR0_FCL2               *((volatile unsigned int*)(0x4270028CUL))
#define bFM4_MFS0_UART_FCR0_FSET               *((volatile unsigned int*)(0x42700290UL))
#define bFM4_MFS0_UART_FCR0_FLD                *((volatile unsigned int*)(0x42700294UL))
#define bFM4_MFS0_UART_FCR0_FLST               *((volatile unsigned int*)(0x42700298UL))
#define bFM4_MFS0_UART_FCR1_FSEL               *((volatile unsigned int*)(0x427002A0UL))
#define bFM4_MFS0_UART_FCR1_FTIE               *((volatile unsigned int*)(0x427002A4UL))
#define bFM4_MFS0_UART_FCR1_FDRQ               *((volatile unsigned int*)(0x427002A8UL))
#define bFM4_MFS0_UART_FCR1_FRIIE              *((volatile unsigned int*)(0x427002ACUL))
#define bFM4_MFS0_UART_FCR1_FLSTE              *((volatile unsigned int*)(0x427002B0UL))
#define bFM4_MFS0_UART_FBYTE_FD0               *((volatile unsigned int*)(0x42700300UL))
#define bFM4_MFS0_UART_FBYTE_FD1               *((volatile unsigned int*)(0x42700304UL))
#define bFM4_MFS0_UART_FBYTE_FD2               *((volatile unsigned int*)(0x42700308UL))
#define bFM4_MFS0_UART_FBYTE_FD3               *((volatile unsigned int*)(0x4270030CUL))
#define bFM4_MFS0_UART_FBYTE_FD4               *((volatile unsigned int*)(0x42700310UL))
#define bFM4_MFS0_UART_FBYTE_FD5               *((volatile unsigned int*)(0x42700314UL))
#define bFM4_MFS0_UART_FBYTE_FD6               *((volatile unsigned int*)(0x42700318UL))
#define bFM4_MFS0_UART_FBYTE_FD7               *((volatile unsigned int*)(0x4270031CUL))
#define bFM4_MFS0_UART_FBYTE_FD8               *((volatile unsigned int*)(0x42700320UL))
#define bFM4_MFS0_UART_FBYTE_FD9               *((volatile unsigned int*)(0x42700324UL))
#define bFM4_MFS0_UART_FBYTE_FD10              *((volatile unsigned int*)(0x42700328UL))
#define bFM4_MFS0_UART_FBYTE_FD11              *((volatile unsigned int*)(0x4270032CUL))
#define bFM4_MFS0_UART_FBYTE_FD12              *((volatile unsigned int*)(0x42700330UL))
#define bFM4_MFS0_UART_FBYTE_FD13              *((volatile unsigned int*)(0x42700334UL))
#define bFM4_MFS0_UART_FBYTE_FD14              *((volatile unsigned int*)(0x42700338UL))
#define bFM4_MFS0_UART_FBYTE_FD15              *((volatile unsigned int*)(0x4270033CUL))
#define bFM4_MFS0_UART_FBYTE1_FD0              *((volatile unsigned int*)(0x42700300UL))
#define bFM4_MFS0_UART_FBYTE1_FD1              *((volatile unsigned int*)(0x42700304UL))
#define bFM4_MFS0_UART_FBYTE1_FD2              *((volatile unsigned int*)(0x42700308UL))
#define bFM4_MFS0_UART_FBYTE1_FD3              *((volatile unsigned int*)(0x4270030CUL))
#define bFM4_MFS0_UART_FBYTE1_FD4              *((volatile unsigned int*)(0x42700310UL))
#define bFM4_MFS0_UART_FBYTE1_FD5              *((volatile unsigned int*)(0x42700314UL))
#define bFM4_MFS0_UART_FBYTE1_FD6              *((volatile unsigned int*)(0x42700318UL))
#define bFM4_MFS0_UART_FBYTE1_FD7              *((volatile unsigned int*)(0x4270031CUL))
#define bFM4_MFS0_UART_FBYTE2_FD8              *((volatile unsigned int*)(0x42700320UL))
#define bFM4_MFS0_UART_FBYTE2_FD9              *((volatile unsigned int*)(0x42700324UL))
#define bFM4_MFS0_UART_FBYTE2_FD10             *((volatile unsigned int*)(0x42700328UL))
#define bFM4_MFS0_UART_FBYTE2_FD11             *((volatile unsigned int*)(0x4270032CUL))
#define bFM4_MFS0_UART_FBYTE2_FD12             *((volatile unsigned int*)(0x42700330UL))
#define bFM4_MFS0_UART_FBYTE2_FD13             *((volatile unsigned int*)(0x42700334UL))
#define bFM4_MFS0_UART_FBYTE2_FD14             *((volatile unsigned int*)(0x42700338UL))
#define bFM4_MFS0_UART_FBYTE2_FD15             *((volatile unsigned int*)(0x4270033CUL))

