marcel-galliker/Mouvent-PrintEngine/rx_balance_ctrl/common/mb9b160l.h
/* MFS CSIO channel 6 registers */
#define bFM4_MFS6_CSIO_SMR_SOE                 *((volatile unsigned int*)(0x4270C000UL))
#define bFM4_MFS6_CSIO_SMR_SCKE                *((volatile unsigned int*)(0x4270C004UL))
#define bFM4_MFS6_CSIO_SMR_BDS                 *((volatile unsigned int*)(0x4270C008UL))
#define bFM4_MFS6_CSIO_SMR_SCINV               *((volatile unsigned int*)(0x4270C00CUL))
#define bFM4_MFS6_CSIO_SMR_MD0                 *((volatile unsigned int*)(0x4270C014UL))
#define bFM4_MFS6_CSIO_SMR_MD1                 *((volatile unsigned int*)(0x4270C018UL))
#define bFM4_MFS6_CSIO_SMR_MD2                 *((volatile unsigned int*)(0x4270C01CUL))
#define bFM4_MFS6_CSIO_SCR_TXE                 *((volatile unsigned int*)(0x4270C020UL))
#define bFM4_MFS6_CSIO_SCR_RXE                 *((volatile unsigned int*)(0x4270C024UL))
#define bFM4_MFS6_CSIO_SCR_TBIE                *((volatile unsigned int*)(0x4270C028UL))
#define bFM4_MFS6_CSIO_SCR_TIE                 *((volatile unsigned int*)(0x4270C02CUL))
#define bFM4_MFS6_CSIO_SCR_RIE                 *((volatile unsigned int*)(0x4270C030UL))
#define bFM4_MFS6_CSIO_SCR_SPI                 *((volatile unsigned int*)(0x4270C034UL))
#define bFM4_MFS6_CSIO_SCR_MS                  *((volatile unsigned int*)(0x4270C038UL))
#define bFM4_MFS6_CSIO_SCR_UPCL                *((volatile unsigned int*)(0x4270C03CUL))
#define bFM4_MFS6_CSIO_ESCR_L0                 *((volatile unsigned int*)(0x4270C080UL))
#define bFM4_MFS6_CSIO_ESCR_L1                 *((volatile unsigned int*)(0x4270C084UL))
#define bFM4_MFS6_CSIO_ESCR_L2                 *((volatile unsigned int*)(0x4270C088UL))
#define bFM4_MFS6_CSIO_ESCR_WT0                *((volatile unsigned int*)(0x4270C08CUL))
#define bFM4_MFS6_CSIO_ESCR_WT1                *((volatile unsigned int*)(0x4270C090UL))
#define bFM4_MFS6_CSIO_ESCR_L3                 *((volatile unsigned int*)(0x4270C098UL))
#define bFM4_MFS6_CSIO_ESCR_SOP                *((volatile unsigned int*)(0x4270C09CUL))
#define bFM4_MFS6_CSIO_SSR_TBI                 *((volatile unsigned int*)(0x4270C0A0UL))
#define bFM4_MFS6_CSIO_SSR_TDRE                *((volatile unsigned int*)(0x4270C0A4UL))
#define bFM4_MFS6_CSIO_SSR_RDRF                *((volatile unsigned int*)(0x4270C0A8UL))
#define bFM4_MFS6_CSIO_SSR_ORE                 *((volatile unsigned int*)(0x4270C0ACUL))
#define bFM4_MFS6_CSIO_SSR_AWC                 *((volatile unsigned int*)(0x4270C0B0UL))
#define bFM4_MFS6_CSIO_SSR_REC                 *((volatile unsigned int*)(0x4270C0BCUL))
#define bFM4_MFS6_CSIO_FCR_FE1                 *((volatile unsigned int*)(0x4270C280UL))
#define bFM4_MFS6_CSIO_FCR_FE2                 *((volatile unsigned int*)(0x4270C284UL))
#define bFM4_MFS6_CSIO_FCR_FCL1                *((volatile unsigned int*)(0x4270C288UL))
#define bFM4_MFS6_CSIO_FCR_FCL2                *((volatile unsigned int*)(0x4270C28CUL))
#define bFM4_MFS6_CSIO_FCR_FSET                *((volatile unsigned int*)(0x4270C290UL))
#define bFM4_MFS6_CSIO_FCR_FLD                 *((volatile unsigned int*)(0x4270C294UL))
#define bFM4_MFS6_CSIO_FCR_FLST                *((volatile unsigned int*)(0x4270C298UL))
#define bFM4_MFS6_CSIO_FCR_FSEL                *((volatile unsigned int*)(0x4270C2A0UL))
#define bFM4_MFS6_CSIO_FCR_FTIE                *((volatile unsigned int*)(0x4270C2A4UL))
#define bFM4_MFS6_CSIO_FCR_FDRQ                *((volatile unsigned int*)(0x4270C2A8UL))
#define bFM4_MFS6_CSIO_FCR_FRIIE               *((volatile unsigned int*)(0x4270C2ACUL))
#define bFM4_MFS6_CSIO_FCR_FLSTE               *((volatile unsigned int*)(0x4270C2B0UL))
#define bFM4_MFS6_CSIO_FCR0_FE1                *((volatile unsigned int*)(0x4270C280UL))
#define bFM4_MFS6_CSIO_FCR0_FE2                *((volatile unsigned int*)(0x4270C284UL))
#define bFM4_MFS6_CSIO_FCR0_FCL1               *((volatile unsigned int*)(0x4270C288UL))
#define bFM4_MFS6_CSIO_FCR0_FCL2               *((volatile unsigned int*)(0x4270C28CUL))
#define bFM4_MFS6_CSIO_FCR0_FSET               *((volatile unsigned int*)(0x4270C290UL))
#define bFM4_MFS6_CSIO_FCR0_FLD                *((volatile unsigned int*)(0x4270C294UL))
#define bFM4_MFS6_CSIO_FCR0_FLST               *((volatile unsigned int*)(0x4270C298UL))
#define bFM4_MFS6_CSIO_FCR1_FSEL               *((volatile unsigned int*)(0x4270C2A0UL))
#define bFM4_MFS6_CSIO_FCR1_FTIE               *((volatile unsigned int*)(0x4270C2A4UL))
#define bFM4_MFS6_CSIO_FCR1_FDRQ               *((volatile unsigned int*)(0x4270C2A8UL))
#define bFM4_MFS6_CSIO_FCR1_FRIIE              *((volatile unsigned int*)(0x4270C2ACUL))
#define bFM4_MFS6_CSIO_FCR1_FLSTE              *((volatile unsigned int*)(0x4270C2B0UL))
#define bFM4_MFS6_CSIO_FBYTE_FD0               *((volatile unsigned int*)(0x4270C300UL))
#define bFM4_MFS6_CSIO_FBYTE_FD1               *((volatile unsigned int*)(0x4270C304UL))
#define bFM4_MFS6_CSIO_FBYTE_FD2               *((volatile unsigned int*)(0x4270C308UL))
#define bFM4_MFS6_CSIO_FBYTE_FD3               *((volatile unsigned int*)(0x4270C30CUL))
#define bFM4_MFS6_CSIO_FBYTE_FD4               *((volatile unsigned int*)(0x4270C310UL))
#define bFM4_MFS6_CSIO_FBYTE_FD5               *((volatile unsigned int*)(0x4270C314UL))
#define bFM4_MFS6_CSIO_FBYTE_FD6               *((volatile unsigned int*)(0x4270C318UL))
#define bFM4_MFS6_CSIO_FBYTE_FD7               *((volatile unsigned int*)(0x4270C31CUL))
#define bFM4_MFS6_CSIO_FBYTE_FD8               *((volatile unsigned int*)(0x4270C320UL))
#define bFM4_MFS6_CSIO_FBYTE_FD9               *((volatile unsigned int*)(0x4270C324UL))
#define bFM4_MFS6_CSIO_FBYTE_FD10              *((volatile unsigned int*)(0x4270C328UL))
#define bFM4_MFS6_CSIO_FBYTE_FD11              *((volatile unsigned int*)(0x4270C32CUL))
#define bFM4_MFS6_CSIO_FBYTE_FD12              *((volatile unsigned int*)(0x4270C330UL))
#define bFM4_MFS6_CSIO_FBYTE_FD13              *((volatile unsigned int*)(0x4270C334UL))
#define bFM4_MFS6_CSIO_FBYTE_FD14              *((volatile unsigned int*)(0x4270C338UL))
#define bFM4_MFS6_CSIO_FBYTE_FD15              *((volatile unsigned int*)(0x4270C33CUL))
#define bFM4_MFS6_CSIO_FBYTE1_FD0              *((volatile unsigned int*)(0x4270C300UL))
#define bFM4_MFS6_CSIO_FBYTE1_FD1              *((volatile unsigned int*)(0x4270C304UL))
#define bFM4_MFS6_CSIO_FBYTE1_FD2              *((volatile unsigned int*)(0x4270C308UL))
#define bFM4_MFS6_CSIO_FBYTE1_FD3              *((volatile unsigned int*)(0x4270C30CUL))
#define bFM4_MFS6_CSIO_FBYTE1_FD4              *((volatile unsigned int*)(0x4270C310UL))
#define bFM4_MFS6_CSIO_FBYTE1_FD5              *((volatile unsigned int*)(0x4270C314UL))
#define bFM4_MFS6_CSIO_FBYTE1_FD6              *((volatile unsigned int*)(0x4270C318UL))
#define bFM4_MFS6_CSIO_FBYTE1_FD7              *((volatile unsigned int*)(0x4270C31CUL))
#define bFM4_MFS6_CSIO_FBYTE2_FD8              *((volatile unsigned int*)(0x4270C320UL))
#define bFM4_MFS6_CSIO_FBYTE2_FD9              *((volatile unsigned int*)(0x4270C324UL))
#define bFM4_MFS6_CSIO_FBYTE2_FD10             *((volatile unsigned int*)(0x4270C328UL))
#define bFM4_MFS6_CSIO_FBYTE2_FD11             *((volatile unsigned int*)(0x4270C32CUL))
#define bFM4_MFS6_CSIO_FBYTE2_FD12             *((volatile unsigned int*)(0x4270C330UL))
#define bFM4_MFS6_CSIO_FBYTE2_FD13             *((volatile unsigned int*)(0x4270C334UL))
#define bFM4_MFS6_CSIO_FBYTE2_FD14             *((volatile unsigned int*)(0x4270C338UL))
#define bFM4_MFS6_CSIO_FBYTE2_FD15             *((volatile unsigned int*)(0x4270C33CUL))
#define bFM4_MFS6_CSIO_SCSTR10_CSHD0           *((volatile unsigned int*)(0x4270C380UL))
#define bFM4_MFS6_CSIO_SCSTR10_CSHD1           *((volatile unsigned int*)(0x4270C384UL))
#define bFM4_MFS6_CSIO_SCSTR10_CSHD2           *((volatile unsigned int*)(0x4270C388UL))
#define bFM4_MFS6_CSIO_SCSTR10_CSHD3           *((volatile unsigned int*)(0x4270C38CUL))
#define bFM4_MFS6_CSIO_SCSTR10_CSHD4           *((volatile unsigned int*)(0x4270C390UL))
#define bFM4_MFS6_CSIO_SCSTR10_CSHD5           *((volatile unsigned int*)(0x4270C394UL))
#define bFM4_MFS6_CSIO_SCSTR10_CSHD6           *((volatile unsigned int*)(0x4270C398UL))
#define bFM4_MFS6_CSIO_SCSTR10_CSHD7           *((volatile unsigned int*)(0x4270C39CUL))
#define bFM4_MFS6_CSIO_SCSTR10_CSSU0           *((volatile unsigned int*)(0x4270C3A0UL))
#define bFM4_MFS6_CSIO_SCSTR10_CSSU1           *((volatile unsigned int*)(0x4270C3A4UL))
#define bFM4_MFS6_CSIO_SCSTR10_CSSU2           *((volatile unsigned int*)(0x4270C3A8UL))
#define bFM4_MFS6_CSIO_SCSTR10_CSSU3           *((volatile unsigned int*)(0x4270C3ACUL))
#define bFM4_MFS6_CSIO_SCSTR10_CSSU4           *((volatile unsigned int*)(0x4270C3B0UL))
#define bFM4_MFS6_CSIO_SCSTR10_CSSU5           *((volatile unsigned int*)(0x4270C3B4UL))
#define bFM4_MFS6_CSIO_SCSTR10_CSSU6           *((volatile unsigned int*)(0x4270C3B8UL))
#define bFM4_MFS6_CSIO_SCSTR10_CSSU7           *((volatile unsigned int*)(0x4270C3BCUL))
#define bFM4_MFS6_CSIO_SCSTR32_CSDS0           *((volatile unsigned int*)(0x4270C400UL))
#define bFM4_MFS6_CSIO_SCSTR32_CSDS1           *((volatile unsigned int*)(0x4270C404UL))
#define bFM4_MFS6_CSIO_SCSTR32_CSDS2           *((volatile unsigned int*)(0x4270C408UL))
#define bFM4_MFS6_CSIO_SCSTR32_CSDS3           *((volatile unsigned int*)(0x4270C40CUL))
#define bFM4_MFS6_CSIO_SCSTR32_CSDS4           *((volatile unsigned int*)(0x4270C410UL))
#define bFM4_MFS6_CSIO_SCSTR32_CSDS5           *((volatile unsigned int*)(0x4270C414UL))
#define bFM4_MFS6_CSIO_SCSTR32_CSDS6           *((volatile unsigned int*)(0x4270C418UL))
#define bFM4_MFS6_CSIO_SCSTR32_CSDS7           *((volatile unsigned int*)(0x4270C41CUL))
#define bFM4_MFS6_CSIO_SCSTR32_CSDS8           *((volatile unsigned int*)(0x4270C420UL))
#define bFM4_MFS6_CSIO_SCSTR32_CSDS9           *((volatile unsigned int*)(0x4270C424UL))
#define bFM4_MFS6_CSIO_SCSTR32_CSDS10          *((volatile unsigned int*)(0x4270C428UL))
#define bFM4_MFS6_CSIO_SCSTR32_CSDS11          *((volatile unsigned int*)(0x4270C42CUL))
#define bFM4_MFS6_CSIO_SCSTR32_CSDS12          *((volatile unsigned int*)(0x4270C430UL))
#define bFM4_MFS6_CSIO_SCSTR32_CSDS13          *((volatile unsigned int*)(0x4270C434UL))
#define bFM4_MFS6_CSIO_SCSTR32_CSDS14          *((volatile unsigned int*)(0x4270C438UL))
#define bFM4_MFS6_CSIO_SCSTR32_CSDS15          *((volatile unsigned int*)(0x4270C43CUL))
#define bFM4_MFS6_CSIO_SACSR_TMRE              *((volatile unsigned int*)(0x4270C480UL))
#define bFM4_MFS6_CSIO_SACSR_TDIV0             *((volatile unsigned int*)(0x4270C484UL))
#define bFM4_MFS6_CSIO_SACSR_TDIV1             *((volatile unsigned int*)(0x4270C488UL))
#define bFM4_MFS6_CSIO_SACSR_TDIV2             *((volatile unsigned int*)(0x4270C48CUL))
#define bFM4_MFS6_CSIO_SACSR_TDIV3             *((volatile unsigned int*)(0x4270C490UL))
#define bFM4_MFS6_CSIO_SACSR_TSYNE             *((volatile unsigned int*)(0x4270C498UL))
#define bFM4_MFS6_CSIO_SACSR_TINTE             *((volatile unsigned int*)(0x4270C49CUL))
#define bFM4_MFS6_CSIO_SACSR_TINT              *((volatile unsigned int*)(0x4270C4A0UL))
#define bFM4_MFS6_CSIO_SACSR_CSE               *((volatile unsigned int*)(0x4270C4ACUL))
#define bFM4_MFS6_CSIO_SACSR_CSEIE             *((volatile unsigned int*)(0x4270C4B0UL))
#define bFM4_MFS6_CSIO_SACSR_TBEEN             *((volatile unsigned int*)(0x4270C4B4UL))
#define bFM4_MFS6_CSIO_STMR_TM0                *((volatile unsigned int*)(0x4270C500UL))
#define bFM4_MFS6_CSIO_STMR_TM1                *((volatile unsigned int*)(0x4270C504UL))
#define bFM4_MFS6_CSIO_STMR_TM2                *((volatile unsigned int*)(0x4270C508UL))
#define bFM4_MFS6_CSIO_STMR_TM3                *((volatile unsigned int*)(0x4270C50CUL))
#define bFM4_MFS6_CSIO_STMR_TM4                *((volatile unsigned int*)(0x4270C510UL))
#define bFM4_MFS6_CSIO_STMR_TM5                *((volatile unsigned int*)(0x4270C514UL))
#define bFM4_MFS6_CSIO_STMR_TM6                *((volatile unsigned int*)(0x4270C518UL))
#define bFM4_MFS6_CSIO_STMR_TM7                *((volatile unsigned int*)(0x4270C51CUL))
#define bFM4_MFS6_CSIO_STMR_TM8                *((volatile unsigned int*)(0x4270C520UL))
#define bFM4_MFS6_CSIO_STMR_TM9                *((volatile unsigned int*)(0x4270C524UL))
#define bFM4_MFS6_CSIO_STMR_TM10               *((volatile unsigned int*)(0x4270C528UL))
#define bFM4_MFS6_CSIO_STMR_TM11               *((volatile unsigned int*)(0x4270C52CUL))
#define bFM4_MFS6_CSIO_STMR_TM12               *((volatile unsigned int*)(0x4270C530UL))
#define bFM4_MFS6_CSIO_STMR_TM13               *((volatile unsigned int*)(0x4270C534UL))
#define bFM4_MFS6_CSIO_STMR_TM14               *((volatile unsigned int*)(0x4270C538UL))
#define bFM4_MFS6_CSIO_STMR_TM15               *((volatile unsigned int*)(0x4270C53CUL))
#define bFM4_MFS6_CSIO_STMCR_TC0               *((volatile unsigned int*)(0x4270C580UL))
#define bFM4_MFS6_CSIO_STMCR_TC1               *((volatile unsigned int*)(0x4270C584UL))
#define bFM4_MFS6_CSIO_STMCR_TC2               *((volatile unsigned int*)(0x4270C588UL))
#define bFM4_MFS6_CSIO_STMCR_TC3               *((volatile unsigned int*)(0x4270C58CUL))
#define bFM4_MFS6_CSIO_STMCR_TC4               *((volatile unsigned int*)(0x4270C590UL))
#define bFM4_MFS6_CSIO_STMCR_TC5               *((volatile unsigned int*)(0x4270C594UL))
#define bFM4_MFS6_CSIO_STMCR_TC6               *((volatile unsigned int*)(0x4270C598UL))
#define bFM4_MFS6_CSIO_STMCR_TC7               *((volatile unsigned int*)(0x4270C59CUL))
#define bFM4_MFS6_CSIO_STMCR_TC8               *((volatile unsigned int*)(0x4270C5A0UL))
#define bFM4_MFS6_CSIO_STMCR_TC9               *((volatile unsigned int*)(0x4270C5A4UL))
#define bFM4_MFS6_CSIO_STMCR_TC10              *((volatile unsigned int*)(0x4270C5A8UL))
#define bFM4_MFS6_CSIO_STMCR_TC11              *((volatile unsigned int*)(0x4270C5ACUL))
#define bFM4_MFS6_CSIO_STMCR_TC12              *((volatile unsigned int*)(0x4270C5B0UL))
#define bFM4_MFS6_CSIO_STMCR_TC13              *((volatile unsigned int*)(0x4270C5B4UL))
#define bFM4_MFS6_CSIO_STMCR_TC14              *((volatile unsigned int*)(0x4270C5B8UL))
#define bFM4_MFS6_CSIO_STMCR_TC15              *((volatile unsigned int*)(0x4270C5BCUL))
#define bFM4_MFS6_CSIO_SCSCR_CSOE              *((volatile unsigned int*)(0x4270C600UL))
#define bFM4_MFS6_CSIO_SCSCR_CSEN0             *((volatile unsigned int*)(0x4270C604UL))
#define bFM4_MFS6_CSIO_SCSCR_CSLVL             *((volatile unsigned int*)(0x4270C614UL))
#define bFM4_MFS6_CSIO_SCSCR_CDIV0             *((volatile unsigned int*)(0x4270C618UL))
#define bFM4_MFS6_CSIO_SCSCR_CDIV1             *((volatile unsigned int*)(0x4270C61CUL))
#define bFM4_MFS6_CSIO_SCSCR_CDIV2             *((volatile unsigned int*)(0x4270C620UL))
#define bFM4_MFS6_CSIO_SCSCR_SCAM              *((volatile unsigned int*)(0x4270C624UL))

/* MFS LIN channel 6 registers */
#define bFM4_MFS6_LIN_SMR_SOE                  *((volatile unsigned int*)(0x4270C000UL))
#define bFM4_MFS6_LIN_SMR_SBL                  *((volatile unsigned int*)(0x4270C00CUL))
#define bFM4_MFS6_LIN_SMR_WUCR                 *((volatile unsigned int*)(0x4270C010UL))
#define bFM4_MFS6_LIN_SMR_MD0                  *((volatile unsigned int*)(0x4270C014UL))
#define bFM4_MFS6_LIN_SMR_MD1                  *((volatile unsigned int*)(0x4270C018UL))
#define bFM4_MFS6_LIN_SMR_MD2                  *((volatile unsigned int*)(0x4270C01CUL))
#define bFM4_MFS6_LIN_SCR_TXE                  *((volatile unsigned int*)(0x4270C020UL))
#define bFM4_MFS6_LIN_SCR_RXE                  *((volatile unsigned int*)(0x4270C024UL))
#define bFM4_MFS6_LIN_SCR_TBIE                 *((volatile unsigned int*)(0x4270C028UL))
#define bFM4_MFS6_LIN_SCR_TIE                  *((volatile unsigned int*)(0x4270C02CUL))
#define bFM4_MFS6_LIN_SCR_RIE                  *((volatile unsigned int*)(0x4270C030UL))
#define bFM4_MFS6_LIN_SCR_LBR                  *((volatile unsigned int*)(0x4270C034UL))
#define bFM4_MFS6_LIN_SCR_MS                   *((volatile unsigned int*)(0x4270C038UL))
#define bFM4_MFS6_LIN_SCR_UPCL                 *((volatile unsigned int*)(0x4270C03CUL))
#define bFM4_MFS6_LIN_ESCR_DEL0                *((volatile unsigned int*)(0x4270C080UL))
#define bFM4_MFS6_LIN_ESCR_DEL1                *((volatile unsigned int*)(0x4270C084UL))
#define bFM4_MFS6_LIN_ESCR_LBL0                *((volatile unsigned int*)(0x4270C088UL))
#define bFM4_MFS6_LIN_ESCR_LBL1                *((volatile unsigned int*)(0x4270C08CUL))
#define bFM4_MFS6_LIN_ESCR_LBIE                *((volatile unsigned int*)(0x4270C090UL))
#define bFM4_MFS6_LIN_ESCR_ESBL                *((volatile unsigned int*)(0x4270C098UL))
#define bFM4_MFS6_LIN_SSR_TBI                  *((volatile unsigned int*)(0x4270C0A0UL))
#define bFM4_MFS6_LIN_SSR_TDRE                 *((volatile unsigned int*)(0x4270C0A4UL))
#define bFM4_MFS6_LIN_SSR_RDRF                 *((volatile unsigned int*)(0x4270C0A8UL))
#define bFM4_MFS6_LIN_SSR_ORE                  *((volatile unsigned int*)(0x4270C0ACUL))
#define bFM4_MFS6_LIN_SSR_FRE                  *((volatile unsigned int*)(0x4270C0B0UL))
#define bFM4_MFS6_LIN_SSR_LBD                  *((volatile unsigned int*)(0x4270C0B4UL))
#define bFM4_MFS6_LIN_SSR_REC                  *((volatile unsigned int*)(0x4270C0BCUL))
#define bFM4_MFS6_LIN_BGR_EXT                  *((volatile unsigned int*)(0x4270C1BCUL))
#define bFM4_MFS6_LIN_BGR1_EXT                 *((volatile unsigned int*)(0x4270C1BCUL))
#define bFM4_MFS6_LIN_FCR_FE1                  *((volatile unsigned int*)(0x4270C280UL))
#define bFM4_MFS6_LIN_FCR_FE2                  *((volatile unsigned int*)(0x4270C284UL))
#define bFM4_MFS6_LIN_FCR_FCL1                 *((volatile unsigned int*)(0x4270C288UL))
#define bFM4_MFS6_LIN_FCR_FCL2                 *((volatile unsigned int*)(0x4270C28CUL))
#define bFM4_MFS6_LIN_FCR_FSET                 *((volatile unsigned int*)(0x4270C290UL))
#define bFM4_MFS6_LIN_FCR_FLD                  *((volatile unsigned int*)(0x4270C294UL))
#define bFM4_MFS6_LIN_FCR_FLST                 *((volatile unsigned int*)(0x4270C298UL))
#define bFM4_MFS6_LIN_FCR_FSEL                 *((volatile unsigned int*)(0x4270C2A0UL))
#define bFM4_MFS6_LIN_FCR_FTIE                 *((volatile unsigned int*)(0x4270C2A4UL))
#define bFM4_MFS6_LIN_FCR_FDRQ                 *((volatile unsigned int*)(0x4270C2A8UL))
#define bFM4_MFS6_LIN_FCR_FRIIE                *((volatile unsigned int*)(0x4270C2ACUL))
#define bFM4_MFS6_LIN_FCR_FLSTE                *((volatile unsigned int*)(0x4270C2B0UL))
#define bFM4_MFS6_LIN_FCR0_FE1                 *((volatile unsigned int*)(0x4270C280UL))
#define bFM4_MFS6_LIN_FCR0_FE2                 *((volatile unsigned int*)(0x4270C284UL))
#define bFM4_MFS6_LIN_FCR0_FCL1                *((volatile unsigned int*)(0x4270C288UL))
#define bFM4_MFS6_LIN_FCR0_FCL2                *((volatile unsigned int*)(0x4270C28CUL))
#define bFM4_MFS6_LIN_FCR0_FSET                *((volatile unsigned int*)(0x4270C290UL))
#define bFM4_MFS6_LIN_FCR0_FLD                 *((volatile unsigned int*)(0x4270C294UL))
#define bFM4_MFS6_LIN_FCR0_FLST                *((volatile unsigned int*)(0x4270C298UL))
#define bFM4_MFS6_LIN_FCR1_FSEL                *((volatile unsigned int*)(0x4270C2A0UL))
#define bFM4_MFS6_LIN_FCR1_FTIE                *((volatile unsigned int*)(0x4270C2A4UL))
#define bFM4_MFS6_LIN_FCR1_FDRQ                *((volatile unsigned int*)(0x4270C2A8UL))
#define bFM4_MFS6_LIN_FCR1_FRIIE               *((volatile unsigned int*)(0x4270C2ACUL))
#define bFM4_MFS6_LIN_FCR1_FLSTE               *((volatile unsigned int*)(0x4270C2B0UL))
#define bFM4_MFS6_LIN_FBYTE_FD0                *((volatile unsigned int*)(0x4270C300UL))
#define bFM4_MFS6_LIN_FBYTE_FD1                *((volatile unsigned int*)(0x4270C304UL))
#define bFM4_MFS6_LIN_FBYTE_FD2                *((volatile unsigned int*)(0x4270C308UL))
#define bFM4_MFS6_LIN_FBYTE_FD3                *((volatile unsigned int*)(0x4270C30CUL))
#define bFM4_MFS6_LIN_FBYTE_FD4                *((volatile unsigned int*)(0x4270C310UL))
#define bFM4_MFS6_LIN_FBYTE_FD5                *((volatile unsigned int*)(0x4270C314UL))
#define bFM4_MFS6_LIN_FBYTE_FD6                *((volatile unsigned int*)(0x4270C318UL))
#define bFM4_MFS6_LIN_FBYTE_FD7                *((volatile unsigned int*)(0x4270C31CUL))
#define bFM4_MFS6_LIN_FBYTE_FD8                *((volatile unsigned int*)(0x4270C320UL))
#define bFM4_MFS6_LIN_FBYTE_FD9                *((volatile unsigned int*)(0x4270C324UL))
#define bFM4_MFS6_LIN_FBYTE_FD10               *((volatile unsigned int*)(0x4270C328UL))
#define bFM4_MFS6_LIN_FBYTE_FD11               *((volatile unsigned int*)(0x4270C32CUL))
#define bFM4_MFS6_LIN_FBYTE_FD12               *((volatile unsigned int*)(0x4270C330UL))
#define bFM4_MFS6_LIN_FBYTE_FD13               *((volatile unsigned int*)(0x4270C334UL))
#define bFM4_MFS6_LIN_FBYTE_FD14               *((volatile unsigned int*)(0x4270C338UL))
#define bFM4_MFS6_LIN_FBYTE_FD15               *((volatile unsigned int*)(0x4270C33CUL))
#define bFM4_MFS6_LIN_FBYTE1_FD0               *((volatile unsigned int*)(0x4270C300UL))
#define bFM4_MFS6_LIN_FBYTE1_FD1               *((volatile unsigned int*)(0x4270C304UL))
#define bFM4_MFS6_LIN_FBYTE1_FD2               *((volatile unsigned int*)(0x4270C308UL))
#define bFM4_MFS6_LIN_FBYTE1_FD3               *((volatile unsigned int*)(0x4270C30CUL))
#define bFM4_MFS6_LIN_FBYTE1_FD4               *((volatile unsigned int*)(0x4270C310UL))
#define bFM4_MFS6_LIN_FBYTE1_FD5               *((volatile unsigned int*)(0x4270C314UL))
#define bFM4_MFS6_LIN_FBYTE1_FD6               *((volatile unsigned int*)(0x4270C318UL))
#define bFM4_MFS6_LIN_FBYTE1_FD7               *((volatile unsigned int*)(0x4270C31CUL))
#define bFM4_MFS6_LIN_FBYTE2_FD8               *((volatile unsigned int*)(0x4270C320UL))
#define bFM4_MFS6_LIN_FBYTE2_FD9               *((volatile unsigned int*)(0x4270C324UL))
#define bFM4_MFS6_LIN_FBYTE2_FD10              *((volatile unsigned int*)(0x4270C328UL))
#define bFM4_MFS6_LIN_FBYTE2_FD11              *((volatile unsigned int*)(0x4270C32CUL))
#define bFM4_MFS6_LIN_FBYTE2_FD12              *((volatile unsigned int*)(0x4270C330UL))
#define bFM4_MFS6_LIN_FBYTE2_FD13              *((volatile unsigned int*)(0x4270C334UL))
#define bFM4_MFS6_LIN_FBYTE2_FD14              *((volatile unsigned int*)(0x4270C338UL))
#define bFM4_MFS6_LIN_FBYTE2_FD15              *((volatile unsigned int*)(0x4270C33CUL))

