marcel-galliker/Mouvent-PrintEngine/rx_balance_ctrl/common/mb9b160l.h
/* MFS I2C channel 8 registers */
#define bFM4_MFS8_I2C_SMR_TIE                  *((volatile unsigned int*)(0x42710008UL))
#define bFM4_MFS8_I2C_SMR_RIE                  *((volatile unsigned int*)(0x4271000CUL))
#define bFM4_MFS8_I2C_SMR_MD0                  *((volatile unsigned int*)(0x42710014UL))
#define bFM4_MFS8_I2C_SMR_MD1                  *((volatile unsigned int*)(0x42710018UL))
#define bFM4_MFS8_I2C_SMR_MD2                  *((volatile unsigned int*)(0x4271001CUL))
#define bFM4_MFS8_I2C_IBCR_INT                 *((volatile unsigned int*)(0x42710020UL))
#define bFM4_MFS8_I2C_IBCR_BER                 *((volatile unsigned int*)(0x42710024UL))
#define bFM4_MFS8_I2C_IBCR_INTE                *((volatile unsigned int*)(0x42710028UL))
#define bFM4_MFS8_I2C_IBCR_CNDE                *((volatile unsigned int*)(0x4271002CUL))
#define bFM4_MFS8_I2C_IBCR_WSEL                *((volatile unsigned int*)(0x42710030UL))
#define bFM4_MFS8_I2C_IBCR_ACKE                *((volatile unsigned int*)(0x42710034UL))
#define bFM4_MFS8_I2C_IBCR_ACT                 *((volatile unsigned int*)(0x42710038UL))
#define bFM4_MFS8_I2C_IBCR_SCC                 *((volatile unsigned int*)(0x42710038UL))
#define bFM4_MFS8_I2C_IBCR_MSS                 *((volatile unsigned int*)(0x4271003CUL))
#define bFM4_MFS8_I2C_IBSR_BB                  *((volatile unsigned int*)(0x42710080UL))
#define bFM4_MFS8_I2C_IBSR_SPC                 *((volatile unsigned int*)(0x42710084UL))
#define bFM4_MFS8_I2C_IBSR_RSC                 *((volatile unsigned int*)(0x42710088UL))
#define bFM4_MFS8_I2C_IBSR_AL                  *((volatile unsigned int*)(0x4271008CUL))
#define bFM4_MFS8_I2C_IBSR_TRX                 *((volatile unsigned int*)(0x42710090UL))
#define bFM4_MFS8_I2C_IBSR_RSA                 *((volatile unsigned int*)(0x42710094UL))
#define bFM4_MFS8_I2C_IBSR_RACK                *((volatile unsigned int*)(0x42710098UL))
#define bFM4_MFS8_I2C_IBSR_FBT                 *((volatile unsigned int*)(0x4271009CUL))
#define bFM4_MFS8_I2C_SSR_TBI                  *((volatile unsigned int*)(0x427100A0UL))
#define bFM4_MFS8_I2C_SSR_TDRE                 *((volatile unsigned int*)(0x427100A4UL))
#define bFM4_MFS8_I2C_SSR_RDRF                 *((volatile unsigned int*)(0x427100A8UL))
#define bFM4_MFS8_I2C_SSR_ORE                  *((volatile unsigned int*)(0x427100ACUL))
#define bFM4_MFS8_I2C_SSR_TBIE                 *((volatile unsigned int*)(0x427100B0UL))
#define bFM4_MFS8_I2C_SSR_DMA                  *((volatile unsigned int*)(0x427100B4UL))
#define bFM4_MFS8_I2C_SSR_TSET                 *((volatile unsigned int*)(0x427100B8UL))
#define bFM4_MFS8_I2C_SSR_REC                  *((volatile unsigned int*)(0x427100BCUL))
#define bFM4_MFS8_I2C_ISBA_SA0                 *((volatile unsigned int*)(0x42710200UL))
#define bFM4_MFS8_I2C_ISBA_SA1                 *((volatile unsigned int*)(0x42710204UL))
#define bFM4_MFS8_I2C_ISBA_SA2                 *((volatile unsigned int*)(0x42710208UL))
#define bFM4_MFS8_I2C_ISBA_SA3                 *((volatile unsigned int*)(0x4271020CUL))
#define bFM4_MFS8_I2C_ISBA_SA4                 *((volatile unsigned int*)(0x42710210UL))
#define bFM4_MFS8_I2C_ISBA_SA5                 *((volatile unsigned int*)(0x42710214UL))
#define bFM4_MFS8_I2C_ISBA_SA6                 *((volatile unsigned int*)(0x42710218UL))
#define bFM4_MFS8_I2C_ISBA_SAEN                *((volatile unsigned int*)(0x4271021CUL))
#define bFM4_MFS8_I2C_ISMK_SM0                 *((volatile unsigned int*)(0x42710220UL))
#define bFM4_MFS8_I2C_ISMK_SM1                 *((volatile unsigned int*)(0x42710224UL))
#define bFM4_MFS8_I2C_ISMK_SM2                 *((volatile unsigned int*)(0x42710228UL))
#define bFM4_MFS8_I2C_ISMK_SM3                 *((volatile unsigned int*)(0x4271022CUL))
#define bFM4_MFS8_I2C_ISMK_SM4                 *((volatile unsigned int*)(0x42710230UL))
#define bFM4_MFS8_I2C_ISMK_SM5                 *((volatile unsigned int*)(0x42710234UL))
#define bFM4_MFS8_I2C_ISMK_SM6                 *((volatile unsigned int*)(0x42710238UL))
#define bFM4_MFS8_I2C_ISMK_EN                  *((volatile unsigned int*)(0x4271023CUL))
#define bFM4_MFS8_I2C_FCR_FE1                  *((volatile unsigned int*)(0x42710280UL))
#define bFM4_MFS8_I2C_FCR_FE2                  *((volatile unsigned int*)(0x42710284UL))
#define bFM4_MFS8_I2C_FCR_FCL1                 *((volatile unsigned int*)(0x42710288UL))
#define bFM4_MFS8_I2C_FCR_FCL2                 *((volatile unsigned int*)(0x4271028CUL))
#define bFM4_MFS8_I2C_FCR_FSET                 *((volatile unsigned int*)(0x42710290UL))
#define bFM4_MFS8_I2C_FCR_FLD                  *((volatile unsigned int*)(0x42710294UL))
#define bFM4_MFS8_I2C_FCR_FLST                 *((volatile unsigned int*)(0x42710298UL))
#define bFM4_MFS8_I2C_FCR_FSEL                 *((volatile unsigned int*)(0x427102A0UL))
#define bFM4_MFS8_I2C_FCR_FTIE                 *((volatile unsigned int*)(0x427102A4UL))
#define bFM4_MFS8_I2C_FCR_FDRQ                 *((volatile unsigned int*)(0x427102A8UL))
#define bFM4_MFS8_I2C_FCR_FRIIE                *((volatile unsigned int*)(0x427102ACUL))
#define bFM4_MFS8_I2C_FCR_FLSTE                *((volatile unsigned int*)(0x427102B0UL))
#define bFM4_MFS8_I2C_FCR0_FE1                 *((volatile unsigned int*)(0x42710280UL))
#define bFM4_MFS8_I2C_FCR0_FE2                 *((volatile unsigned int*)(0x42710284UL))
#define bFM4_MFS8_I2C_FCR0_FCL1                *((volatile unsigned int*)(0x42710288UL))
#define bFM4_MFS8_I2C_FCR0_FCL2                *((volatile unsigned int*)(0x4271028CUL))
#define bFM4_MFS8_I2C_FCR0_FSET                *((volatile unsigned int*)(0x42710290UL))
#define bFM4_MFS8_I2C_FCR0_FLD                 *((volatile unsigned int*)(0x42710294UL))
#define bFM4_MFS8_I2C_FCR0_FLST                *((volatile unsigned int*)(0x42710298UL))
#define bFM4_MFS8_I2C_FCR1_FSEL                *((volatile unsigned int*)(0x427102A0UL))
#define bFM4_MFS8_I2C_FCR1_FTIE                *((volatile unsigned int*)(0x427102A4UL))
#define bFM4_MFS8_I2C_FCR1_FDRQ                *((volatile unsigned int*)(0x427102A8UL))
#define bFM4_MFS8_I2C_FCR1_FRIIE               *((volatile unsigned int*)(0x427102ACUL))
#define bFM4_MFS8_I2C_FCR1_FLSTE               *((volatile unsigned int*)(0x427102B0UL))
#define bFM4_MFS8_I2C_FBYTE_FD0                *((volatile unsigned int*)(0x42710300UL))
#define bFM4_MFS8_I2C_FBYTE_FD1                *((volatile unsigned int*)(0x42710304UL))
#define bFM4_MFS8_I2C_FBYTE_FD2                *((volatile unsigned int*)(0x42710308UL))
#define bFM4_MFS8_I2C_FBYTE_FD3                *((volatile unsigned int*)(0x4271030CUL))
#define bFM4_MFS8_I2C_FBYTE_FD4                *((volatile unsigned int*)(0x42710310UL))
#define bFM4_MFS8_I2C_FBYTE_FD5                *((volatile unsigned int*)(0x42710314UL))
#define bFM4_MFS8_I2C_FBYTE_FD6                *((volatile unsigned int*)(0x42710318UL))
#define bFM4_MFS8_I2C_FBYTE_FD7                *((volatile unsigned int*)(0x4271031CUL))
#define bFM4_MFS8_I2C_FBYTE_FD8                *((volatile unsigned int*)(0x42710320UL))
#define bFM4_MFS8_I2C_FBYTE_FD9                *((volatile unsigned int*)(0x42710324UL))
#define bFM4_MFS8_I2C_FBYTE_FD10               *((volatile unsigned int*)(0x42710328UL))
#define bFM4_MFS8_I2C_FBYTE_FD11               *((volatile unsigned int*)(0x4271032CUL))
#define bFM4_MFS8_I2C_FBYTE_FD12               *((volatile unsigned int*)(0x42710330UL))
#define bFM4_MFS8_I2C_FBYTE_FD13               *((volatile unsigned int*)(0x42710334UL))
#define bFM4_MFS8_I2C_FBYTE_FD14               *((volatile unsigned int*)(0x42710338UL))
#define bFM4_MFS8_I2C_FBYTE_FD15               *((volatile unsigned int*)(0x4271033CUL))
#define bFM4_MFS8_I2C_FBYTE1_FD0               *((volatile unsigned int*)(0x42710300UL))
#define bFM4_MFS8_I2C_FBYTE1_FD1               *((volatile unsigned int*)(0x42710304UL))
#define bFM4_MFS8_I2C_FBYTE1_FD2               *((volatile unsigned int*)(0x42710308UL))
#define bFM4_MFS8_I2C_FBYTE1_FD3               *((volatile unsigned int*)(0x4271030CUL))
#define bFM4_MFS8_I2C_FBYTE1_FD4               *((volatile unsigned int*)(0x42710310UL))
#define bFM4_MFS8_I2C_FBYTE1_FD5               *((volatile unsigned int*)(0x42710314UL))
#define bFM4_MFS8_I2C_FBYTE1_FD6               *((volatile unsigned int*)(0x42710318UL))
#define bFM4_MFS8_I2C_FBYTE1_FD7               *((volatile unsigned int*)(0x4271031CUL))
#define bFM4_MFS8_I2C_FBYTE2_FD8               *((volatile unsigned int*)(0x42710320UL))
#define bFM4_MFS8_I2C_FBYTE2_FD9               *((volatile unsigned int*)(0x42710324UL))
#define bFM4_MFS8_I2C_FBYTE2_FD10              *((volatile unsigned int*)(0x42710328UL))
#define bFM4_MFS8_I2C_FBYTE2_FD11              *((volatile unsigned int*)(0x4271032CUL))
#define bFM4_MFS8_I2C_FBYTE2_FD12              *((volatile unsigned int*)(0x42710330UL))
#define bFM4_MFS8_I2C_FBYTE2_FD13              *((volatile unsigned int*)(0x42710334UL))
#define bFM4_MFS8_I2C_FBYTE2_FD14              *((volatile unsigned int*)(0x42710338UL))
#define bFM4_MFS8_I2C_FBYTE2_FD15              *((volatile unsigned int*)(0x4271033CUL))

/* MFS UART channel 9 registers */
#define bFM4_MFS9_UART_SMR_SOE                 *((volatile unsigned int*)(0x42712000UL))
#define bFM4_MFS9_UART_SMR_BDS                 *((volatile unsigned int*)(0x42712008UL))
#define bFM4_MFS9_UART_SMR_SBL                 *((volatile unsigned int*)(0x4271200CUL))
#define bFM4_MFS9_UART_SMR_WUCR                *((volatile unsigned int*)(0x42712010UL))
#define bFM4_MFS9_UART_SMR_MD0                 *((volatile unsigned int*)(0x42712014UL))
#define bFM4_MFS9_UART_SMR_MD1                 *((volatile unsigned int*)(0x42712018UL))
#define bFM4_MFS9_UART_SMR_MD2                 *((volatile unsigned int*)(0x4271201CUL))
#define bFM4_MFS9_UART_SCR_TXE                 *((volatile unsigned int*)(0x42712020UL))
#define bFM4_MFS9_UART_SCR_RXE                 *((volatile unsigned int*)(0x42712024UL))
#define bFM4_MFS9_UART_SCR_TBIE                *((volatile unsigned int*)(0x42712028UL))
#define bFM4_MFS9_UART_SCR_TIE                 *((volatile unsigned int*)(0x4271202CUL))
#define bFM4_MFS9_UART_SCR_RIE                 *((volatile unsigned int*)(0x42712030UL))
#define bFM4_MFS9_UART_SCR_UPCL                *((volatile unsigned int*)(0x4271203CUL))
#define bFM4_MFS9_UART_ESCR_L0                 *((volatile unsigned int*)(0x42712080UL))
#define bFM4_MFS9_UART_ESCR_L1                 *((volatile unsigned int*)(0x42712084UL))
#define bFM4_MFS9_UART_ESCR_L2                 *((volatile unsigned int*)(0x42712088UL))
#define bFM4_MFS9_UART_ESCR_P                  *((volatile unsigned int*)(0x4271208CUL))
#define bFM4_MFS9_UART_ESCR_PEN                *((volatile unsigned int*)(0x42712090UL))
#define bFM4_MFS9_UART_ESCR_INV                *((volatile unsigned int*)(0x42712094UL))
#define bFM4_MFS9_UART_ESCR_ESBL               *((volatile unsigned int*)(0x42712098UL))
#define bFM4_MFS9_UART_ESCR_FLWEN              *((volatile unsigned int*)(0x4271209CUL))
#define bFM4_MFS9_UART_SSR_TBI                 *((volatile unsigned int*)(0x427120A0UL))
#define bFM4_MFS9_UART_SSR_TDRE                *((volatile unsigned int*)(0x427120A4UL))
#define bFM4_MFS9_UART_SSR_RDRF                *((volatile unsigned int*)(0x427120A8UL))
#define bFM4_MFS9_UART_SSR_ORE                 *((volatile unsigned int*)(0x427120ACUL))
#define bFM4_MFS9_UART_SSR_FRE                 *((volatile unsigned int*)(0x427120B0UL))
#define bFM4_MFS9_UART_SSR_PE                  *((volatile unsigned int*)(0x427120B4UL))
#define bFM4_MFS9_UART_SSR_REC                 *((volatile unsigned int*)(0x427120BCUL))
#define bFM4_MFS9_UART_RDR_AD                  *((volatile unsigned int*)(0x42712120UL))
#define bFM4_MFS9_UART_TDR_AD                  *((volatile unsigned int*)(0x42712120UL))
#define bFM4_MFS9_UART_BGR_EXT                 *((volatile unsigned int*)(0x427121BCUL))
#define bFM4_MFS9_UART_BGR1_EXT                *((volatile unsigned int*)(0x427121BCUL))
#define bFM4_MFS9_UART_FCR_FE1                 *((volatile unsigned int*)(0x42712280UL))
#define bFM4_MFS9_UART_FCR_FE2                 *((volatile unsigned int*)(0x42712284UL))
#define bFM4_MFS9_UART_FCR_FCL1                *((volatile unsigned int*)(0x42712288UL))
#define bFM4_MFS9_UART_FCR_FCL2                *((volatile unsigned int*)(0x4271228CUL))
#define bFM4_MFS9_UART_FCR_FSET                *((volatile unsigned int*)(0x42712290UL))
#define bFM4_MFS9_UART_FCR_FLD                 *((volatile unsigned int*)(0x42712294UL))
#define bFM4_MFS9_UART_FCR_FLST                *((volatile unsigned int*)(0x42712298UL))
#define bFM4_MFS9_UART_FCR_FSEL                *((volatile unsigned int*)(0x427122A0UL))
#define bFM4_MFS9_UART_FCR_FTIE                *((volatile unsigned int*)(0x427122A4UL))
#define bFM4_MFS9_UART_FCR_FDRQ                *((volatile unsigned int*)(0x427122A8UL))
#define bFM4_MFS9_UART_FCR_FRIIE               *((volatile unsigned int*)(0x427122ACUL))
#define bFM4_MFS9_UART_FCR_FLSTE               *((volatile unsigned int*)(0x427122B0UL))
#define bFM4_MFS9_UART_FCR0_FE1                *((volatile unsigned int*)(0x42712280UL))
#define bFM4_MFS9_UART_FCR0_FE2                *((volatile unsigned int*)(0x42712284UL))
#define bFM4_MFS9_UART_FCR0_FCL1               *((volatile unsigned int*)(0x42712288UL))
#define bFM4_MFS9_UART_FCR0_FCL2               *((volatile unsigned int*)(0x4271228CUL))
#define bFM4_MFS9_UART_FCR0_FSET               *((volatile unsigned int*)(0x42712290UL))
#define bFM4_MFS9_UART_FCR0_FLD                *((volatile unsigned int*)(0x42712294UL))
#define bFM4_MFS9_UART_FCR0_FLST               *((volatile unsigned int*)(0x42712298UL))
#define bFM4_MFS9_UART_FCR1_FSEL               *((volatile unsigned int*)(0x427122A0UL))
#define bFM4_MFS9_UART_FCR1_FTIE               *((volatile unsigned int*)(0x427122A4UL))
#define bFM4_MFS9_UART_FCR1_FDRQ               *((volatile unsigned int*)(0x427122A8UL))
#define bFM4_MFS9_UART_FCR1_FRIIE              *((volatile unsigned int*)(0x427122ACUL))
#define bFM4_MFS9_UART_FCR1_FLSTE              *((volatile unsigned int*)(0x427122B0UL))
#define bFM4_MFS9_UART_FBYTE_FD0               *((volatile unsigned int*)(0x42712300UL))
#define bFM4_MFS9_UART_FBYTE_FD1               *((volatile unsigned int*)(0x42712304UL))
#define bFM4_MFS9_UART_FBYTE_FD2               *((volatile unsigned int*)(0x42712308UL))
#define bFM4_MFS9_UART_FBYTE_FD3               *((volatile unsigned int*)(0x4271230CUL))
#define bFM4_MFS9_UART_FBYTE_FD4               *((volatile unsigned int*)(0x42712310UL))
#define bFM4_MFS9_UART_FBYTE_FD5               *((volatile unsigned int*)(0x42712314UL))
#define bFM4_MFS9_UART_FBYTE_FD6               *((volatile unsigned int*)(0x42712318UL))
#define bFM4_MFS9_UART_FBYTE_FD7               *((volatile unsigned int*)(0x4271231CUL))
#define bFM4_MFS9_UART_FBYTE_FD8               *((volatile unsigned int*)(0x42712320UL))
#define bFM4_MFS9_UART_FBYTE_FD9               *((volatile unsigned int*)(0x42712324UL))
#define bFM4_MFS9_UART_FBYTE_FD10              *((volatile unsigned int*)(0x42712328UL))
#define bFM4_MFS9_UART_FBYTE_FD11              *((volatile unsigned int*)(0x4271232CUL))
#define bFM4_MFS9_UART_FBYTE_FD12              *((volatile unsigned int*)(0x42712330UL))
#define bFM4_MFS9_UART_FBYTE_FD13              *((volatile unsigned int*)(0x42712334UL))
#define bFM4_MFS9_UART_FBYTE_FD14              *((volatile unsigned int*)(0x42712338UL))
#define bFM4_MFS9_UART_FBYTE_FD15              *((volatile unsigned int*)(0x4271233CUL))
#define bFM4_MFS9_UART_FBYTE1_FD0              *((volatile unsigned int*)(0x42712300UL))
#define bFM4_MFS9_UART_FBYTE1_FD1              *((volatile unsigned int*)(0x42712304UL))
#define bFM4_MFS9_UART_FBYTE1_FD2              *((volatile unsigned int*)(0x42712308UL))
#define bFM4_MFS9_UART_FBYTE1_FD3              *((volatile unsigned int*)(0x4271230CUL))
#define bFM4_MFS9_UART_FBYTE1_FD4              *((volatile unsigned int*)(0x42712310UL))
#define bFM4_MFS9_UART_FBYTE1_FD5              *((volatile unsigned int*)(0x42712314UL))
#define bFM4_MFS9_UART_FBYTE1_FD6              *((volatile unsigned int*)(0x42712318UL))
#define bFM4_MFS9_UART_FBYTE1_FD7              *((volatile unsigned int*)(0x4271231CUL))
#define bFM4_MFS9_UART_FBYTE2_FD8              *((volatile unsigned int*)(0x42712320UL))
#define bFM4_MFS9_UART_FBYTE2_FD9              *((volatile unsigned int*)(0x42712324UL))
#define bFM4_MFS9_UART_FBYTE2_FD10             *((volatile unsigned int*)(0x42712328UL))
#define bFM4_MFS9_UART_FBYTE2_FD11             *((volatile unsigned int*)(0x4271232CUL))
#define bFM4_MFS9_UART_FBYTE2_FD12             *((volatile unsigned int*)(0x42712330UL))
#define bFM4_MFS9_UART_FBYTE2_FD13             *((volatile unsigned int*)(0x42712334UL))
#define bFM4_MFS9_UART_FBYTE2_FD14             *((volatile unsigned int*)(0x42712338UL))
#define bFM4_MFS9_UART_FBYTE2_FD15             *((volatile unsigned int*)(0x4271233CUL))

