marcel-galliker/Mouvent-PrintEngine/rx_balance_ctrl/common/mb9b160l.h
/* Watch counter registers */
#define bFM4_WC_WCRD_CTR0                      *((volatile unsigned int*)(0x42740000UL))
#define bFM4_WC_WCRD_CTR1                      *((volatile unsigned int*)(0x42740004UL))
#define bFM4_WC_WCRD_CTR2                      *((volatile unsigned int*)(0x42740008UL))
#define bFM4_WC_WCRD_CTR3                      *((volatile unsigned int*)(0x4274000CUL))
#define bFM4_WC_WCRD_CTR4                      *((volatile unsigned int*)(0x42740010UL))
#define bFM4_WC_WCRD_CTR5                      *((volatile unsigned int*)(0x42740014UL))
#define bFM4_WC_WCRL_RLC0                      *((volatile unsigned int*)(0x42740020UL))
#define bFM4_WC_WCRL_RLC1                      *((volatile unsigned int*)(0x42740024UL))
#define bFM4_WC_WCRL_RLC2                      *((volatile unsigned int*)(0x42740028UL))
#define bFM4_WC_WCRL_RLC3                      *((volatile unsigned int*)(0x4274002CUL))
#define bFM4_WC_WCRL_RLC4                      *((volatile unsigned int*)(0x42740030UL))
#define bFM4_WC_WCRL_RLC5                      *((volatile unsigned int*)(0x42740034UL))
#define bFM4_WC_WCCR_WCIF                      *((volatile unsigned int*)(0x42740040UL))
#define bFM4_WC_WCCR_WCIE                      *((volatile unsigned int*)(0x42740044UL))
#define bFM4_WC_WCCR_CS0                       *((volatile unsigned int*)(0x42740048UL))
#define bFM4_WC_WCCR_CS1                       *((volatile unsigned int*)(0x4274004CUL))
#define bFM4_WC_WCCR_WCOP                      *((volatile unsigned int*)(0x42740058UL))
#define bFM4_WC_WCCR_WCEN                      *((volatile unsigned int*)(0x4274005CUL))
#define bFM4_WC_CLK_SEL_SEL_IN                 *((volatile unsigned int*)(0x42740200UL))
#define bFM4_WC_CLK_SEL_SEL_OUT                *((volatile unsigned int*)(0x42740220UL))
#define bFM4_WC_CLK_EN_CLK_EN                  *((volatile unsigned int*)(0x42740280UL))
#define bFM4_WC_CLK_EN_CLK_EN_R                *((volatile unsigned int*)(0x42740284UL))

/* Real time clock registers */
#define bFM4_RTC_WTCR10_ST                     *((volatile unsigned int*)(0x42762000UL))
#define bFM4_RTC_WTCR10_RUN                    *((volatile unsigned int*)(0x42762008UL))
#define bFM4_RTC_WTCR10_SRST                   *((volatile unsigned int*)(0x4276200CUL))
#define bFM4_RTC_WTCR10_SCST                   *((volatile unsigned int*)(0x42762010UL))
#define bFM4_RTC_WTCR10_SCRST                  *((volatile unsigned int*)(0x42762014UL))
#define bFM4_RTC_WTCR10_BUSY                   *((volatile unsigned int*)(0x42762018UL))
#define bFM4_RTC_WTCR10_TRANS                  *((volatile unsigned int*)(0x4276201CUL))
#define bFM4_RTC_WTCR11_MIEN                   *((volatile unsigned int*)(0x42762080UL))
#define bFM4_RTC_WTCR11_HEN                    *((volatile unsigned int*)(0x42762084UL))
#define bFM4_RTC_WTCR11_DEN                    *((volatile unsigned int*)(0x42762088UL))
#define bFM4_RTC_WTCR11_MOEN                   *((volatile unsigned int*)(0x4276208CUL))
#define bFM4_RTC_WTCR11_YEN                    *((volatile unsigned int*)(0x42762090UL))
#define bFM4_RTC_WTCR12_INTSSI                 *((volatile unsigned int*)(0x42762100UL))
#define bFM4_RTC_WTCR12_INTSI                  *((volatile unsigned int*)(0x42762104UL))
#define bFM4_RTC_WTCR12_INTMI                  *((volatile unsigned int*)(0x42762108UL))
#define bFM4_RTC_WTCR12_INTHI                  *((volatile unsigned int*)(0x4276210CUL))
#define bFM4_RTC_WTCR12_INTTMI                 *((volatile unsigned int*)(0x42762110UL))
#define bFM4_RTC_WTCR12_INTALI                 *((volatile unsigned int*)(0x42762114UL))
#define bFM4_RTC_WTCR12_INTERI                 *((volatile unsigned int*)(0x42762118UL))
#define bFM4_RTC_WTCR12_INTCRI                 *((volatile unsigned int*)(0x4276211CUL))
#define bFM4_RTC_WTCR13_INTSSIE                *((volatile unsigned int*)(0x42762180UL))
#define bFM4_RTC_WTCR13_INTSIE                 *((volatile unsigned int*)(0x42762184UL))
#define bFM4_RTC_WTCR13_INTMIE                 *((volatile unsigned int*)(0x42762188UL))
#define bFM4_RTC_WTCR13_INTHIE                 *((volatile unsigned int*)(0x4276218CUL))
#define bFM4_RTC_WTCR13_INTTMIE                *((volatile unsigned int*)(0x42762190UL))
#define bFM4_RTC_WTCR13_INTALIE                *((volatile unsigned int*)(0x42762194UL))
#define bFM4_RTC_WTCR13_INTERIE                *((volatile unsigned int*)(0x42762198UL))
#define bFM4_RTC_WTCR13_INTCRIE                *((volatile unsigned int*)(0x4276219CUL))
#define bFM4_RTC_WTCR20_CREAD                  *((volatile unsigned int*)(0x42762200UL))
#define bFM4_RTC_WTCR20_CWRITE                 *((volatile unsigned int*)(0x42762204UL))
#define bFM4_RTC_WTCR20_BREAD                  *((volatile unsigned int*)(0x42762208UL))
#define bFM4_RTC_WTCR20_BWRITE                 *((volatile unsigned int*)(0x4276220CUL))
#define bFM4_RTC_WTCR20_PREAD                  *((volatile unsigned int*)(0x42762210UL))
#define bFM4_RTC_WTCR20_PWRITE                 *((volatile unsigned int*)(0x42762214UL))
#define bFM4_RTC_WTCR21_TMST                   *((volatile unsigned int*)(0x42762280UL))
#define bFM4_RTC_WTCR21_TMEN                   *((volatile unsigned int*)(0x42762284UL))
#define bFM4_RTC_WTCR21_TMRUN                  *((volatile unsigned int*)(0x42762288UL))
#define bFM4_RTC_WTSR_S0                       *((volatile unsigned int*)(0x42762380UL))
#define bFM4_RTC_WTSR_S1                       *((volatile unsigned int*)(0x42762384UL))
#define bFM4_RTC_WTSR_S2                       *((volatile unsigned int*)(0x42762388UL))
#define bFM4_RTC_WTSR_S3                       *((volatile unsigned int*)(0x4276238CUL))
#define bFM4_RTC_WTSR_TS0                      *((volatile unsigned int*)(0x42762390UL))
#define bFM4_RTC_WTSR_TS1                      *((volatile unsigned int*)(0x42762394UL))
#define bFM4_RTC_WTSR_TS2                      *((volatile unsigned int*)(0x42762398UL))
#define bFM4_RTC_WTMIR_MI0                     *((volatile unsigned int*)(0x42762400UL))
#define bFM4_RTC_WTMIR_MI1                     *((volatile unsigned int*)(0x42762404UL))
#define bFM4_RTC_WTMIR_MI2                     *((volatile unsigned int*)(0x42762408UL))
#define bFM4_RTC_WTMIR_MI3                     *((volatile unsigned int*)(0x4276240CUL))
#define bFM4_RTC_WTMIR_TMI0                    *((volatile unsigned int*)(0x42762410UL))
#define bFM4_RTC_WTMIR_TMI1                    *((volatile unsigned int*)(0x42762414UL))
#define bFM4_RTC_WTMIR_TMI2                    *((volatile unsigned int*)(0x42762418UL))
#define bFM4_RTC_WTHR_H0                       *((volatile unsigned int*)(0x42762480UL))
#define bFM4_RTC_WTHR_H1                       *((volatile unsigned int*)(0x42762484UL))
#define bFM4_RTC_WTHR_H2                       *((volatile unsigned int*)(0x42762488UL))
#define bFM4_RTC_WTHR_H3                       *((volatile unsigned int*)(0x4276248CUL))
#define bFM4_RTC_WTHR_TH0                      *((volatile unsigned int*)(0x42762490UL))
#define bFM4_RTC_WTHR_TH1                      *((volatile unsigned int*)(0x42762494UL))
#define bFM4_RTC_WTDR_D0                       *((volatile unsigned int*)(0x42762500UL))
#define bFM4_RTC_WTDR_D1                       *((volatile unsigned int*)(0x42762504UL))
#define bFM4_RTC_WTDR_D2                       *((volatile unsigned int*)(0x42762508UL))
#define bFM4_RTC_WTDR_D3                       *((volatile unsigned int*)(0x4276250CUL))
#define bFM4_RTC_WTDR_TD0                      *((volatile unsigned int*)(0x42762510UL))
#define bFM4_RTC_WTDR_TD1                      *((volatile unsigned int*)(0x42762514UL))
#define bFM4_RTC_WTDW_DW0                      *((volatile unsigned int*)(0x42762580UL))
#define bFM4_RTC_WTDW_DW1                      *((volatile unsigned int*)(0x42762584UL))
#define bFM4_RTC_WTDW_DW2                      *((volatile unsigned int*)(0x42762588UL))
#define bFM4_RTC_WTMOR_MO0                     *((volatile unsigned int*)(0x42762600UL))
#define bFM4_RTC_WTMOR_MO1                     *((volatile unsigned int*)(0x42762604UL))
#define bFM4_RTC_WTMOR_MO2                     *((volatile unsigned int*)(0x42762608UL))
#define bFM4_RTC_WTMOR_MO3                     *((volatile unsigned int*)(0x4276260CUL))
#define bFM4_RTC_WTMOR_TMO                     *((volatile unsigned int*)(0x42762610UL))
#define bFM4_RTC_WTYR_Y0                       *((volatile unsigned int*)(0x42762680UL))
#define bFM4_RTC_WTYR_Y1                       *((volatile unsigned int*)(0x42762684UL))
#define bFM4_RTC_WTYR_Y2                       *((volatile unsigned int*)(0x42762688UL))
#define bFM4_RTC_WTYR_Y3                       *((volatile unsigned int*)(0x4276268CUL))
#define bFM4_RTC_WTYR_TY0                      *((volatile unsigned int*)(0x42762690UL))
#define bFM4_RTC_WTYR_TY1                      *((volatile unsigned int*)(0x42762694UL))
#define bFM4_RTC_WTYR_TY2                      *((volatile unsigned int*)(0x42762698UL))
#define bFM4_RTC_WTYR_TY3                      *((volatile unsigned int*)(0x4276269CUL))
#define bFM4_RTC_ALMIR_AMI0                    *((volatile unsigned int*)(0x42762700UL))
#define bFM4_RTC_ALMIR_AMI1                    *((volatile unsigned int*)(0x42762704UL))
#define bFM4_RTC_ALMIR_AMI2                    *((volatile unsigned int*)(0x42762708UL))
#define bFM4_RTC_ALMIR_AMI3                    *((volatile unsigned int*)(0x4276270CUL))
#define bFM4_RTC_ALMIR_TAMI0                   *((volatile unsigned int*)(0x42762710UL))
#define bFM4_RTC_ALMIR_TAMI1                   *((volatile unsigned int*)(0x42762714UL))
#define bFM4_RTC_ALMIR_TAMI2                   *((volatile unsigned int*)(0x42762718UL))
#define bFM4_RTC_ALHR_AH0                      *((volatile unsigned int*)(0x42762780UL))
#define bFM4_RTC_ALHR_AH1                      *((volatile unsigned int*)(0x42762784UL))
#define bFM4_RTC_ALHR_AH2                      *((volatile unsigned int*)(0x42762788UL))
#define bFM4_RTC_ALHR_AH3                      *((volatile unsigned int*)(0x4276278CUL))
#define bFM4_RTC_ALHR_TAH0                     *((volatile unsigned int*)(0x42762790UL))
#define bFM4_RTC_ALHR_TAH1                     *((volatile unsigned int*)(0x42762794UL))
#define bFM4_RTC_ALDR_AD0                      *((volatile unsigned int*)(0x42762800UL))
#define bFM4_RTC_ALDR_AD1                      *((volatile unsigned int*)(0x42762804UL))
#define bFM4_RTC_ALDR_AD2                      *((volatile unsigned int*)(0x42762808UL))
#define bFM4_RTC_ALDR_AD3                      *((volatile unsigned int*)(0x4276280CUL))
#define bFM4_RTC_ALDR_TAD0                     *((volatile unsigned int*)(0x42762810UL))
#define bFM4_RTC_ALDR_TAD1                     *((volatile unsigned int*)(0x42762814UL))
#define bFM4_RTC_ALMOR_AMO0                    *((volatile unsigned int*)(0x42762880UL))
#define bFM4_RTC_ALMOR_AMO1                    *((volatile unsigned int*)(0x42762884UL))
#define bFM4_RTC_ALMOR_AMO2                    *((volatile unsigned int*)(0x42762888UL))
#define bFM4_RTC_ALMOR_AMO3                    *((volatile unsigned int*)(0x4276288CUL))
#define bFM4_RTC_ALMOR_TAMO                    *((volatile unsigned int*)(0x42762890UL))
#define bFM4_RTC_ALYR_AY0                      *((volatile unsigned int*)(0x42762900UL))
#define bFM4_RTC_ALYR_AY1                      *((volatile unsigned int*)(0x42762904UL))
#define bFM4_RTC_ALYR_AY2                      *((volatile unsigned int*)(0x42762908UL))
#define bFM4_RTC_ALYR_AY3                      *((volatile unsigned int*)(0x4276290CUL))
#define bFM4_RTC_ALYR_TAY0                     *((volatile unsigned int*)(0x42762910UL))
#define bFM4_RTC_ALYR_TAY1                     *((volatile unsigned int*)(0x42762914UL))
#define bFM4_RTC_ALYR_TAY2                     *((volatile unsigned int*)(0x42762918UL))
#define bFM4_RTC_ALYR_TAY3                     *((volatile unsigned int*)(0x4276291CUL))
#define bFM4_RTC_WTTR0_TM0                     *((volatile unsigned int*)(0x42762980UL))
#define bFM4_RTC_WTTR0_TM1                     *((volatile unsigned int*)(0x42762984UL))
#define bFM4_RTC_WTTR0_TM2                     *((volatile unsigned int*)(0x42762988UL))
#define bFM4_RTC_WTTR0_TM3                     *((volatile unsigned int*)(0x4276298CUL))
#define bFM4_RTC_WTTR0_TM4                     *((volatile unsigned int*)(0x42762990UL))
#define bFM4_RTC_WTTR0_TM5                     *((volatile unsigned int*)(0x42762994UL))
#define bFM4_RTC_WTTR0_TM6                     *((volatile unsigned int*)(0x42762998UL))
#define bFM4_RTC_WTTR0_TM7                     *((volatile unsigned int*)(0x4276299CUL))
#define bFM4_RTC_WTTR1_TM8                     *((volatile unsigned int*)(0x42762A00UL))
#define bFM4_RTC_WTTR1_TM9                     *((volatile unsigned int*)(0x42762A04UL))
#define bFM4_RTC_WTTR1_TM10                    *((volatile unsigned int*)(0x42762A08UL))
#define bFM4_RTC_WTTR1_TM11                    *((volatile unsigned int*)(0x42762A0CUL))
#define bFM4_RTC_WTTR1_TM12                    *((volatile unsigned int*)(0x42762A10UL))
#define bFM4_RTC_WTTR1_TM13                    *((volatile unsigned int*)(0x42762A14UL))
#define bFM4_RTC_WTTR1_TM14                    *((volatile unsigned int*)(0x42762A18UL))
#define bFM4_RTC_WTTR1_TM15                    *((volatile unsigned int*)(0x42762A1CUL))
#define bFM4_RTC_WTTR2_TM16                    *((volatile unsigned int*)(0x42762A80UL))
#define bFM4_RTC_WTTR2_TM17                    *((volatile unsigned int*)(0x42762A84UL))
#define bFM4_RTC_WTCAL1_WTCAL10                *((volatile unsigned int*)(0x42762B80UL))
#define bFM4_RTC_WTCAL1_WTCAL11                *((volatile unsigned int*)(0x42762B84UL))
#define bFM4_RTC_WTCALEN_WTCALEN               *((volatile unsigned int*)(0x42762C00UL))
#define bFM4_RTC_WTDIV_WTDIV0                  *((volatile unsigned int*)(0x42762C80UL))
#define bFM4_RTC_WTDIV_WTDIV1                  *((volatile unsigned int*)(0x42762C84UL))
#define bFM4_RTC_WTDIV_WTDIV2                  *((volatile unsigned int*)(0x42762C88UL))
#define bFM4_RTC_WTDIV_WTDIV3                  *((volatile unsigned int*)(0x42762C8CUL))
#define bFM4_RTC_WTDIVEN_WTDIVEN               *((volatile unsigned int*)(0x42762D00UL))
#define bFM4_RTC_WTDIVEN_WTDIVRDY              *((volatile unsigned int*)(0x42762D04UL))
#define bFM4_RTC_WTCALPRD_WTCALPRD0            *((volatile unsigned int*)(0x42762D80UL))
#define bFM4_RTC_WTCALPRD_WTCALPRD1            *((volatile unsigned int*)(0x42762D84UL))
#define bFM4_RTC_WTCALPRD_WTCALPRD2            *((volatile unsigned int*)(0x42762D88UL))
#define bFM4_RTC_WTCALPRD_WTCALPRD3            *((volatile unsigned int*)(0x42762D8CUL))
#define bFM4_RTC_WTCALPRD_WTCALPRD4            *((volatile unsigned int*)(0x42762D90UL))
#define bFM4_RTC_WTCALPRD_WTCALPRD5            *((volatile unsigned int*)(0x42762D94UL))
#define bFM4_RTC_WTCOSEL_WTCOSEL               *((volatile unsigned int*)(0x42762E00UL))
#define bFM4_RTC_VB_CLKDIV_DIV0                *((volatile unsigned int*)(0x42762E80UL))
#define bFM4_RTC_VB_CLKDIV_DIV1                *((volatile unsigned int*)(0x42762E84UL))
#define bFM4_RTC_VB_CLKDIV_DIV2                *((volatile unsigned int*)(0x42762E88UL))
#define bFM4_RTC_VB_CLKDIV_DIV3                *((volatile unsigned int*)(0x42762E8CUL))
#define bFM4_RTC_VB_CLKDIV_DIV4                *((volatile unsigned int*)(0x42762E90UL))
#define bFM4_RTC_VB_CLKDIV_DIV5                *((volatile unsigned int*)(0x42762E94UL))
#define bFM4_RTC_VB_CLKDIV_DIV6                *((volatile unsigned int*)(0x42762E98UL))
#define bFM4_RTC_VB_CLKDIV_DIV7                *((volatile unsigned int*)(0x42762E9CUL))
#define bFM4_RTC_WTOSCCNT_SOSCEX               *((volatile unsigned int*)(0x42762F00UL))
#define bFM4_RTC_WTOSCCNT_SOSCNTL              *((volatile unsigned int*)(0x42762F04UL))
#define bFM4_RTC_EWKUP_WUP0                    *((volatile unsigned int*)(0x42763100UL))
#define bFM4_RTC_VDET_PON                      *((volatile unsigned int*)(0x4276319CUL))
#define bFM4_RTC_VBPFR_VPFR0                   *((volatile unsigned int*)(0x42763280UL))
#define bFM4_RTC_VBPFR_VPFR1                   *((volatile unsigned int*)(0x42763284UL))
#define bFM4_RTC_VBPFR_VPFR2                   *((volatile unsigned int*)(0x42763288UL))
#define bFM4_RTC_VBPFR_VPFR3                   *((volatile unsigned int*)(0x4276328CUL))
#define bFM4_RTC_VBPFR_SPSR0                   *((volatile unsigned int*)(0x42763290UL))
#define bFM4_RTC_VBPFR_SPSR1                   *((volatile unsigned int*)(0x42763294UL))
#define bFM4_RTC_VBPCR_VPCR0                   *((volatile unsigned int*)(0x42763300UL))
#define bFM4_RTC_VBPCR_VPCR1                   *((volatile unsigned int*)(0x42763304UL))
#define bFM4_RTC_VBPCR_VPCR2                   *((volatile unsigned int*)(0x42763308UL))
#define bFM4_RTC_VBPCR_VPCR3                   *((volatile unsigned int*)(0x4276330CUL))
#define bFM4_RTC_VBDDR_VDDR0                   *((volatile unsigned int*)(0x42763380UL))
#define bFM4_RTC_VBDDR_VDDR1                   *((volatile unsigned int*)(0x42763384UL))
#define bFM4_RTC_VBDDR_VDDR2                   *((volatile unsigned int*)(0x42763388UL))
#define bFM4_RTC_VBDDR_VDDR3                   *((volatile unsigned int*)(0x4276338CUL))
#define bFM4_RTC_VBDIR_VDIR0                   *((volatile unsigned int*)(0x42763400UL))
#define bFM4_RTC_VBDIR_VDIR1                   *((volatile unsigned int*)(0x42763404UL))
#define bFM4_RTC_VBDIR_VDIR2                   *((volatile unsigned int*)(0x42763408UL))
#define bFM4_RTC_VBDIR_VDIR3                   *((volatile unsigned int*)(0x4276340CUL))
#define bFM4_RTC_VBDOR_VDOR0                   *((volatile unsigned int*)(0x42763480UL))
#define bFM4_RTC_VBDOR_VDOR1                   *((volatile unsigned int*)(0x42763484UL))
#define bFM4_RTC_VBDOR_VDOR2                   *((volatile unsigned int*)(0x42763488UL))
#define bFM4_RTC_VBDOR_VDOR3                   *((volatile unsigned int*)(0x4276348CUL))
#define bFM4_RTC_VBPZR_VPZR0                   *((volatile unsigned int*)(0x42763500UL))
#define bFM4_RTC_VBPZR_VPZR1                   *((volatile unsigned int*)(0x42763504UL))

